{"id":12,"date":"2014-01-06T01:07:46","date_gmt":"2014-01-06T09:07:46","guid":{"rendered":"http:\/\/www.wordcounter.net\/blog\/?p=12"},"modified":"2015-07-02T10:56:21","modified_gmt":"2015-07-02T17:56:21","slug":"generate-writing-ideas","status":"publish","type":"post","link":"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html","title":{"rendered":"53 Places and Ways to Get Ideas for Your Writing"},"content":{"rendered":"<p><center><a href=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/writing-ideas.jpg\"><img loading=\"lazy\" src=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/writing-ideas-550x366.jpg\" alt=\"how to get writing ideas\" width=\"550\" height=\"366\" class=\"alignnone size-medium wp-image-50\" srcset=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/writing-ideas-550x366.jpg 550w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/writing-ideas-700x466.jpg 700w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/writing-ideas-624x416.jpg 624w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/writing-ideas.jpg 1024w\" sizes=\"(max-width: 550px) 100vw, 550px\" \/><\/a><\/center><\/p>\n<p>Getting ideas isn&#8217;t as difficult or mystical as many make it out to be. It&#8217;s not a matter of being struck by lightning or having the muse whisper ideas into your ear. The truth is, ideas are everywhere. You just have to pay attention and train yourself to see an idea in what others see as just a normal part of every day life. If you can do that, you&#8217;ll never be without an idea for stories, articles, and other projects. Here are fifty-three sources of ideas to get you started.<\/p>\n<h2>Books<\/h2>\n<p>Good writers read widely. They don&#8217;t steal from other&#8217;s work, but they do find inspiration in the work of others. A passage in a book, a fact, a line of dialogue, or an unresolved situation can give you an idea for your own work.<\/p>\n<h2>Movies<\/h2>\n<p>Movies are more visual than books, but the same idea applies. You may find an idea in something that the filmmakers left unresolved, or in a fact presented in a documentary.<\/p>\n<h2>Magazines\/journals\/trade publications<\/h2>\n<p>Magazines exist for almost every interest and hobby. They are packed with facts, statistics, interesting pictures, sordid tabloid gossip, and boring trade secrets. Any of this can be fodder for your work.<\/p>\n<h2>Blogs<\/h2>\n<p>Like magazines, blogs are full of all kinds of stories and information. Read ones that interest you, but also take the time to scan some that are outside of your interests so you learn something new and unexpected.<\/p>\n<h2>People watching<\/h2>\n<p>People are fascinating. They do strange things and all you have to do is sit in a public place and watch them. Someone&#8217;s mannerisms, actions, or situation may inspire you.<\/p>\n<h2>Message forums<\/h2>\n<p>Again, read forums that reflect your interests, but also read some that are completely new to you. People post the strangest things including things that are way more personal than you&#8217;d expect to find in a &#8220;public&#8221; place.<\/p>\n<h2>Music<\/h2>\n<p>A good lyric or arrangement can give you an idea. Or maybe you start to wonder about the artist who wrote the song, or the drummer who can drum like no one you ever heard before. At the very least, music can set a mood that may make it easier for you to think of new ideas.<\/p>\n<h2>Nature<\/h2>\n<p>Take a walk outside and pay attention to what you see, hear, and smell.<\/p>\n<h2>Relaxation<\/h2>\n<p>Ideas seem to flow easier when you&#8217;re relaxed. This is why many writers get ideas as they&#8217;re about to drift off to sleep, doing mindless chores, or while in the shower. Chill out and let your brain do the work.<\/p>\n<h2>Idea generators\/prompts<\/h2>\n<p>There are plenty of books and websites that offer up brief prompts or situations to get you going. &#8220;Two people are sitting at a restaurant table, conversing. One jumps up and points at the other and starts shouting. What&#8217;s going on here?&#8221;<\/p>\n<h2>Artwork\/Photography<\/h2>\n<p>Art is inspiring in two ways. Just being in the presence of creativity and mastery can get you thinking of things you want to do. You can also use the art as a prompt. For example, if you see a painting of peasants fleeing their homes, pick one of the peasants and finish his or her story.<\/p>\n<h2>Friends\/family<\/h2>\n<p>The people we&#8217;re close to often tell interesting stories. Too often, though, we tune them out. Take the time to listen whenever someone starts up with, &#8220;When I was a kid&#8230;&#8221;<\/p>\n<h2>Travel<\/h2>\n<p>Travel opens your eyes to how other people live and new places. It&#8217;s a great way to find ideas.<\/p>\n<h2>Exercise<\/h2>\n<p>Exercise relaxes your mind and gives you time to think. If you exercise outside, you can combine some nature watching with your exercise. If you&#8217;re in a gym, throw in some people watching and eavesdropping. Or just tune it all out and let your subconscious surprise you.<\/p>\n<h2>Pressure<\/h2>\n<p>Some people crumble under deadlines, but others thrive. Sometimes there&#8217;s nothing like knowing you have to produce an article or story to get the ideas flowing. True story: I once won a short story contest with a story I wrote the night before the deadline. I&#8217;d put it off and put it off and finally decided to sit down and write. I was stumped for a while but then I just started with the first crazy thing that came into my head. I don&#8217;t recommend living a life that&#8217;s stressed out all of the time but sometimes a little pressure can get you moving when nothing else can.<\/p>\n<h2>Writer&#8217;s groups<\/h2>\n<p>Your writing colleagues may be able to help you come up with an idea, or the act of simply hanging out with them may generate an idea.<\/p>\n<h2>Book clubs<\/h2>\n<p>Not only are you reading, but you&#8217;re discussing what you read with others. Hearing how other people experience the book may give you an idea or a new way of seeing the material that can be spun off into your own work.<\/p>\n<h2>Newspapers\/TV News<\/h2>\n<p>Read the headlines to see what&#8217;s happening. Read the ads, the comics, and the lifestyle section, as well. You never know when something will hit you. Also, if your library has old newspapers on microfilm, trawl through those. Televised news can also be a source of ideas. Everything from the headlines to the anchors themselves becomes fair game.<\/p>\n<h2>Journaling<\/h2>\n<p>Writing down the events of the day, working through a problem, ranting about your boss, or just jotting down your random thoughts will sometimes yield an idea you wouldn&#8217;t have thought of otherwise. Just remember to keep the journal private. Blogs are good for some things, but posting your most intimate, uncensored, and damaging thoughts isn&#8217;t one of them.<\/p>\n<h2>Dreams<\/h2>\n<p>It&#8217;s funny what our subconscious serves up at night. A lot of it makes no sense, but every once in a while you get a dream (or part of a dream) that&#8217;s the idea for a great story.<\/p>\n<h2>Blue Sky<\/h2>\n<p>Disney has a process called &#8220;Blue Sky.&#8221; This is where everyone involved in a project (and even some who are not involved like the janitors) are asked to simply throw ideas into the mix without censoring. Every idea, no matter how silly, far-fetched, or expensive is written down and considered. No one is allowed to say, &#8220;That won&#8217;t work,&#8221; on the first pass. Most ideas are eventually discarded, but some (or combinations of some) work out and go on to become movies or attractions. Have your own &#8220;Blue Sky&#8221; time and just write down every crazy thing that comes into your head. When you go back and read it, you might be surprised at what you find.<\/p>\n<h2>Get out of your rut<\/h2>\n<p>Ruts make it difficult for us to see new things. Try driving to work a different way, take a new route for your evening walk, eat at a new restaurant, or go somewhere you wouldn&#8217;t normally choose. Just do something different and see if you get new ideas.<\/p>\n<h2>Pinterest\/collages<\/h2>\n<p>The ideas here come from looking at interesting combinations of things you might not have thought of. Why is someone showcasing jam jars with vampires?<\/p>\n<h2>Freewriting<\/h2>\n<p>This is similar to journaling, except you&#8217;re not trying to record your thoughts or the events of your life, per se. You start with a prompt or something that just pops into your head and write whatever comes to mind. Or, you could start with a question about a current project or something that you want to know. Write for ten or fifteen minutes without censoring yourself and then see what you&#8217;ve got.<\/p>\n<h2>Historical research<\/h2>\n<p>History is full of fun facts and events that can be used for stories and articles. Many things are well known, but it&#8217;s often the overlooked things and people, or the events that get one line mentions in books that are the most fun to think about.<\/p>\n<h2>Memories\/personal experience<\/h2>\n<p>Where better to get ideas than from your own personal experience? Maybe you write about your high school boyfriend, or the time your neighbor pissed you off.<\/p>\n<h2>Daydreams<\/h2>\n<p>Staring out the window and daydreaming can be a valid way to get an idea. It relaxes your brain and you often think about things that aren&#8217;t terribly realistic or which you wouldn&#8217;t do in real life. When daydreaming, we often turn off the censor in our minds which leads to ideas flowing more freely.<\/p>\n<h2>Ask, &#8220;What if&#8230;?&#8221;<\/h2>\n<p>This is the best question to ask when looking for ideas. Take any situation, experience, or product and ask, &#8220;What if&#8230;?&#8221; Then fill in the blank with whatever crazy thing you want.<\/p>\n<h2>Fix a problem or address a need<\/h2>\n<p>Ever said to yourself, &#8220;If only this product did [insert feature].&#8221; Or, &#8220;Wouldn&#8217;t it be neat if I could do [insert ability or problem fix].&#8221; Or, &#8220;I really need [insert need here], but it doesn&#8217;t exist.&#8221; Sure, your solution could be really out there, but that&#8217;s where the story begins.<\/p>\n<h2>Mash up ideas<\/h2>\n<p>Things that at first seem like they have no relation to each other can sometimes be made to fit together in a new and interesting way. Look at the people who put Pride and Prejudice together with Zombies. It might seem crazy, but go with it and see where it leads.<\/p>\n<h2>Re-read your old work<\/h2>\n<p>Maybe there&#8217;s something there you didn&#8217;t explore fully the first time, or you see a new way you can slant it to appeal to new markets.<\/p>\n<h2>Talk to strangers<\/h2>\n<p>Chat up the shopkeeper or the guy changing your oil. Talk to the guy who fixes your furnace or your favorite librarian. You don&#8217;t have to become best friends, but you never know when a fascinating story or idea will come out of their experience.<\/p>\n<h2>Attend an event<\/h2>\n<p>Go to a conference or seminar. Better yet, go to one that covers a topic or industry with which you have no experience. You might see a whole different world and way of thinking that opens your mind.<\/p>\n<h2>Newsletters<\/h2>\n<p>Newsletters can be good sources for keeping up with trends, following events in a field, or just getting bits of gossip that are fun to read. Subscribe to newsletters from a variety of fields and interests.<\/p>\n<h2>Statistics<\/h2>\n<p>Numbers don&#8217;t lie. Or do they? Statistics can represent hard facts, or they can be manipulated by various groups to gain support for their causes. Whenever you see a statistic, stop and think about what it means, who benefits from this statistic, and how you might work it into a story or article.<\/p>\n<h2>Take the opposite position<\/h2>\n<p>Whenever you encounter an article or real life situation, try taking the opposite position. They say yes, you say no. They say good idea, you say bad idea. They say, &#8220;They lived happily ever after,&#8221; you say, &#8220;And they died in complete misery.&#8221;<\/p>\n<h2>Take a class<\/h2>\n<p>Classes not only teach you new things, they expose you to new people and new ways of looking at the world. Pick something you want to know (or that your character wants to know) and take a class on the subject.<\/p>\n<h2>Learn something new<\/h2>\n<p>The age old advice for writers is to &#8220;write what you know.&#8221; But the best articles and story ideas often come from learning about what you don&#8217;t know. Ask yourself, &#8220;What do I want to know?&#8221; and then go learn about it.<\/p>\n<h2>Read your junk mail<\/h2>\n<p>Yes, most of it is pure garbage. But every now and then you get a piece with an interesting statistic, a cause you&#8217;ve never heard of before, or a political appeal that&#8217;s so far &#8220;out there&#8221; that you wonder where these people come from.<\/p>\n<h2>Be somebody else for a while<\/h2>\n<p>The old saying that you don&#8217;t know about someone else&#8217;s experience until you&#8217;ve walked a mile in their shoes is true. Do manual labor instead of working your cushy desk job. Spend a day in a wheelchair or wearing a blindfold to see how hard it is to be disabled. Immerse yourself in the conservative political rhetoric instead of the liberal, or vice versa. Spend some time in someone else&#8217;s shoes and see how it changes your outlook on things.<\/p>\n<h2>Ask what happens next<\/h2>\n<p>Say that a police car blows by you at 90 MPH, followed closely by an ambulance and a fire truck. There are choppers overhead, too. Think about what they could be responding to and where the story goes from there. Whenever you see something interesting happening in the world around you, ask what happens next.<\/p>\n<h2>Social media<\/h2>\n<p>It&#8217;s the <a href=\"https:\/\/www.facebook.com\/pages\/Word-Counter\/674540739257131\">ultimate source<\/a> for keeping up with tends, reading about people&#8217;s lives, seeing interesting pictures, and hearing the best gossip. It&#8217;s a petri dish of ideas.<\/p>\n<h2>Hobbies<\/h2>\n<p>Your hobbies might introduce you to new people, places, or ways of thinking. If your hobbies tend to be solitary like reading or knitting, see if you can join a club or go to classes to broaden your horizons.<\/p>\n<h2>Finish the story<\/h2>\n<p>So, you watched a movie or read a book and then wondered what happened to the characters after the end. Continue the story. This is the basis for fan fiction, but it can also be lead to something that you can turn into your own story. Not to mention there is a whole industry these days that takes old books like Pride and Prejudice and remakes them or their characters into something else.<\/p>\n<h2>Play like a kid<\/h2>\n<p>When we become adults, we often stop playing. But it&#8217;s during play that some of the best ideas can come out. Remember when you were a kid? You&#8217;d start with a game, or maybe something like playing house and then it would evolve into something else as you went along. That tree became the enemy castle. The creek became a mighty river that swallowed your settlers. (Or it held a giant crocodile.) Or your dolls were suddenly living in opulence in the mansion you set up under the dining room table. GI Joe was getting along great with Barbie and they were raising a herd of Star Wars Action figures. Kids are great at creating things on the fly because they don&#8217;t stop to say, &#8220;That&#8217;s not believable.&#8221; They just go with it.<\/p>\n<h2>Religion<\/h2>\n<p>Religious texts are full of stories and allegories that can become ideas for other things. I&#8217;m not saying that you should devalue religion, but some things can be the basis for something else. How many stories are similar to the fall of Adam and Eve, or to the trials of Job, for example?<\/p>\n<h2>Re-write history<\/h2>\n<p>How many books on the market today took a real life event and then re-imagined the outcome? It doesn&#8217;t even have to be a well known historical event. You can take an event from your own life and imagine that it turned out differently.<\/p>\n<h2>Take something ordinary to the extreme<\/h2>\n<p>Much of what we see and do everyday is fairly boring. But what if you took something ordinary and took it to the extreme? (In your head, only, please. No matter how much you want to kill your neighbor, do it on the page, not in real life.) What would happen if, instead of stopping at that stoplight, you ran it and got chased by cops and ended up in a ditch and then running for your life? What if, instead of kowtowing politely to your boss you told him off?<\/p>\n<h2>Scientific research and experimentation<\/h2>\n<p>Plenty of ideas can be found in cutting edge scientific research. Some of it is already pretty far out there and you can use your imagination to take it even further or to consider the consequences of such research. You can also do a few experiments yourself to see what happens. (Just don&#8217;t blow up your house.)<\/p>\n<h2>Check the calendar<\/h2>\n<p>There are always holidays, observances, and tribute months coming up. Think about what happens on these days or during these time periods and ask how you can make one of them relevant to your audience. Or ask what would happen to a character who&#8217;s observing one of these holidays and something goes wrong. Or ask why the character is participating in a holiday activity.<\/p>\n<h2>Look at objects<\/h2>\n<p>Really take the time to study that glass or coffee table. Study that building or train. We see so many things every day but we rarely really look at them. Who knows what you might see in everyday objects.<\/p>\n<h2>Quotes<\/h2>\n<p>I recently finished reading, &#8220;My Year With Eleanor,&#8221; which was based on one of Eleanor Roosevelt&#8217;s quotes. &#8220;Do one thing every day that scares you,&#8221; prompted the author to spend a year doing exactly that.<\/p>\n<h2>Eavesdrop<\/h2>\n<p>Like people watching, listening to their conversations can be fascinating. Don&#8217;t listen where you aren&#8217;t supposed to, but if someone is having a full volume conversation in a restaurant or yelling into their cell phone at the park, tune in to what they&#8217;re saying. The situation might be ripe for a story.<\/p>\n<p>Remember that the idea is only a small part of the creative process and it&#8217;s actually the easiest part. Everyone has ideas, and a lot of people have the same ideas. And some ideas, in their original form, are too silly, incomplete, or nonsensical to become stories. It&#8217;s what you do with the idea that matters. What matters most is that you do something with the ideas you get. A notebook full of great ideas isn&#8217;t worth anything until you put them on paper and turn them into stories or articles that others want to read.<\/p>\n<p>(Photo courtesy of <a href=\"http:\/\/www.flickr.com\/photos\/97789668@N07\/9271500576\/\">nic519<\/a>)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Getting ideas isn&#8217;t as difficult or mystical as many make it out to be. It&#8217;s not a matter of being struck by lightning or having the muse whisper ideas into your ear. The truth is, ideas are everywhere. You just have to pay attention and train yourself to see an idea in what others see &hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[10,12,11,9],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>53 Places and Ways to Get Ideas for Your Writing - Word Counter Blog<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"53 Places and Ways to Get Ideas for Your Writing - Word Counter Blog\" \/>\n<meta property=\"og:description\" content=\"Getting ideas isn&#8217;t as difficult or mystical as many make it out to be. It&#8217;s not a matter of being struck by lightning or having the muse whisper ideas into your ear. The truth is, ideas are everywhere. You just have to pay attention and train yourself to see an idea in what others see &hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html\" \/>\n<meta property=\"og:site_name\" content=\"Word Counter Blog\" \/>\n<meta property=\"article:published_time\" content=\"2014-01-06T09:07:46+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-07-02T17:56:21+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/writing-ideas-550x366.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"15 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\",\"url\":\"https:\/\/wordcounter.net\/blog\/\",\"name\":\"Word Counter Blog\",\"description\":\"Because words count\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/wordcounter.net\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html#primaryimage\",\"url\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/writing-ideas.jpg\",\"contentUrl\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/writing-ideas.jpg\",\"width\":1024,\"height\":683,\"caption\":\"how to get writing ideas\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html#webpage\",\"url\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html\",\"name\":\"53 Places and Ways to Get Ideas for Your Writing - Word Counter Blog\",\"isPartOf\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html#primaryimage\"},\"datePublished\":\"2014-01-06T09:07:46+00:00\",\"dateModified\":\"2015-07-02T17:56:21+00:00\",\"author\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\"},\"breadcrumb\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/wordcounter.net\/blog\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"53 Places and Ways to Get Ideas for Your Writing\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\",\"name\":\"admin\",\"url\":\"https:\/\/wordcounter.net\/blog\/author\/admin\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"53 Places and Ways to Get Ideas for Your Writing - Word Counter Blog","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html","og_locale":"en_US","og_type":"article","og_title":"53 Places and Ways to Get Ideas for Your Writing - Word Counter Blog","og_description":"Getting ideas isn&#8217;t as difficult or mystical as many make it out to be. It&#8217;s not a matter of being struck by lightning or having the muse whisper ideas into your ear. The truth is, ideas are everywhere. You just have to pay attention and train yourself to see an idea in what others see &hellip;","og_url":"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html","og_site_name":"Word Counter Blog","article_published_time":"2014-01-06T09:07:46+00:00","article_modified_time":"2015-07-02T17:56:21+00:00","og_image":[{"url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/writing-ideas-550x366.jpg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"15 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/wordcounter.net\/blog\/#website","url":"https:\/\/wordcounter.net\/blog\/","name":"Word Counter Blog","description":"Because words count","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/wordcounter.net\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html#primaryimage","url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/writing-ideas.jpg","contentUrl":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/writing-ideas.jpg","width":1024,"height":683,"caption":"how to get writing ideas"},{"@type":"WebPage","@id":"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html#webpage","url":"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html","name":"53 Places and Ways to Get Ideas for Your Writing - Word Counter Blog","isPartOf":{"@id":"https:\/\/wordcounter.net\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html#primaryimage"},"datePublished":"2014-01-06T09:07:46+00:00","dateModified":"2015-07-02T17:56:21+00:00","author":{"@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef"},"breadcrumb":{"@id":"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/wordcounter.net\/blog\/2014\/01\/06\/1012_generate-writing-ideas.html#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/wordcounter.net\/blog"},{"@type":"ListItem","position":2,"name":"53 Places and Ways to Get Ideas for Your Writing"}]},{"@type":"Person","@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef","name":"admin","url":"https:\/\/wordcounter.net\/blog\/author\/admin"}]}},"_links":{"self":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/12"}],"collection":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/comments?post=12"}],"version-history":[{"count":7,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/12\/revisions"}],"predecessor-version":[{"id":412,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/12\/revisions\/412"}],"wp:attachment":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/media?parent=12"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/categories?post=12"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/tags?post=12"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}