{"id":14,"date":"2014-01-13T14:12:08","date_gmt":"2014-01-13T22:12:08","guid":{"rendered":"http:\/\/www.wordcounter.net\/blog\/?p=14"},"modified":"2017-03-01T07:46:22","modified_gmt":"2017-03-01T15:46:22","slug":"25-excuses-for-not-writing","status":"publish","type":"post","link":"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html","title":{"rendered":"25 Excuses for Not Writing (And Why They&#8217;re Not Valid)"},"content":{"rendered":"<p><center><a href=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/no-excuses.jpg\"><img loading=\"lazy\" src=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/no-excuses-550x463.jpg\" alt=\"writing excuses\" width=\"550\" height=\"463\" class=\"alignnone size-medium wp-image-56\" srcset=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/no-excuses-550x463.jpg 550w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/no-excuses-700x589.jpg 700w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/no-excuses-624x525.jpg 624w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/no-excuses.jpg 893w\" sizes=\"(max-width: 550px) 100vw, 550px\" \/><\/a><\/center><\/p>\n<p>Writers (and those who want to be writers) have tons of excuses for not writing. I&#8217;m not sure there&#8217;s any other occupation with quite so many excuses for not working as writing. Everyone from school kids who have to write a term paper to novelists and freelance writers have piles of excuses for not doing the work. <\/p>\n<p>Worse, many writers and would-be-writers have convinced themselves that these excuses are valid. While some of them may be valid on a limited basis (if you&#8217;re sick, injured, or in the middle of some kind of true crisis, for example, you may really not be able to write), most of them are just ways we try to justify our fears, insecurities, or laziness. They&#8217;re nothing but excuses, not legitimate reasons for skipping work. To help you sort out valid from invalid excuses, here are some of the <a href=\"https:\/\/wordcounter.net\/blog\/2013\/12\/writer-resolutions\/\">most common excuses writers give<\/a> for not working and why most of them are garbage. <\/p>\n<h2>I don&#8217;t have time<\/h2>\n<p>Everybody&#8217;s busy. We all have errands to run, jobs to do, family to take care of, volunteer assignments, and appointments to keep. If everyone was &#8220;too busy&#8221; to write, we&#8217;d never have another book published. If writing is something you want to do, you have to make it a priority. Drop whatever obligations you can get out of, delegate stuff to other people, and let the dishes sit in the sink for a little longer. <\/p>\n<h2>My family will hate me<\/h2>\n<p>This excuse comes up on two fronts. The first is that your family will hate you if you use real-life experiences in your work. They won&#8217;t like seeing themselves in print. And they probably won&#8217;t. But you can change names and alter events to protect the innocent. If they still get mad, well, you can hope that your royalty checks are enough to shut them up. The second fear is that your family will hate you if you start making writing a priority in your life. They may not get as much time as they&#8217;re used to and they might (gasp) have to start doing some more things for themselves. That&#8217;s not a bad thing. You can work out compromises as you go along to make sure they don&#8217;t feel left out. <\/p>\n<h2>I&#8217;m too old to start<\/h2>\n<p>&#8220;You can&#8217;t get published if you&#8217;re over forty. Publishers only want hot young authors who are TV worthy.&#8221; Or, &#8220;They won&#8217;t take a chance on an old guy who won&#8217;t live to give them thirty books.&#8221; Sometimes this is (sadly) true. But it&#8217;s even more true that publishers are businesses that want excellent products to sell. If you&#8217;ve got a great story well told or an original non-fiction book, they&#8217;ll want it, even if you&#8217;ve got one foot in the grave and it&#8217;s the only book you&#8217;re likely to ever write. <\/p>\n<h2>I&#8217;m too young to start<\/h2>\n<p>Yes, sometimes young authors lack experience and training and that comes through in their work, leading to rejections. But the younger you are when you start the learning process, the longer and more successful your career can be. <\/p>\n<h2>No one will take me seriously<\/h2>\n<p>They may not. Your work may be ridiculed and pushed aside. Or it may not. You won&#8217;t know unless you try. And unless your goal is to be a great literary author or the author of a serious non-fiction book, being taken seriously doesn&#8217;t matter all that much, anyway. <\/p>\n<h2>I&#8217;ve got writer&#8217;s block<\/h2>\n<p>There is no such thing as writer&#8217;s block. If you can&#8217;t think of a single thing to put on the page, you&#8217;ve got a very big problem and it probably means you&#8217;ve gone blind, deaf, and mute as well. With everything that goes on around you every day and all that has happened in your life, you should always be able to find something to write about. Whether what you write is good or not is a separate problem, but it&#8217;s not writer&#8217;s block. <\/p>\n<h2>It&#8217;ll never be published<\/h2>\n<p>Maybe not, but is publication the only reason you want to write? Do you want to write because you enjoy it, because you like to tell stories, or because you like to learn new things? If so, so what if you don&#8217;t get published? Writing is often its own reward and publication is just icing on the cake. <\/p>\n<h2>I have no talent<\/h2>\n<p>You may not. Lots of people don&#8217;t. But anyone can learn to write better. Spend some time in classes and working with a good writer&#8217;s group or mentor. You can get better. It may not be so much a lack of talent as you just don&#8217;t know the mechanics very well. At least try to improve before you write yourself off as a no-talent hack. <\/p>\n<h2>I&#8217;m saving it for when I retire\/have more free time\/the kids are gone<\/h2>\n<p>Sure. And something else will always insert itself into that, &#8220;free time.&#8221; Besides, what if you drop dead before you can retire, or what if the kids never leave? You have to write now, not put it off to some point in the future that may never come. <\/p>\n<h2>I don&#8217;t have any good ideas<\/h2>\n<p><a href=\"https:\/\/wordcounter.net\/blog\/2014\/01\/generate-writing-ideas\/\">Ideas are all over the place<\/a>, you just have to learn how to recognize them and then turn that tiny fragment of an idea into a story or article. Everything that you read, watch, see, hear, or smell has the potential to be a good idea. <\/p>\n<h2>There are too many interruptions<\/h2>\n<p>You can move your work area to someplace less distracting like the library. Turn off the phone and refuse to answer the door. Buy some noise-canceling headphones. Turn off your internet connection and email notifications. If the kids won&#8217;t leave you alone, drop them off at the movies for a couple of hours. Dump them on your spouse for the afternoon and go to the library. Distractions can be managed if you&#8217;re motivated.<\/p>\n<h2>I need an MFA before I can write<\/h2>\n<p>Yes, you might need some more training before your work is publishable. Chances are, though, that you can learn what you need through an extension course or by working with a writer&#8217;s group and by practicing on your own. An MFA is nice, but very few people &#8220;need&#8221; one at all, much less need to complete one before they can write at all. After all, if you can&#8217;t write without it, how are you going to get into the program in the first place?<\/p>\n<h2>The last thing I wrote was rejected<\/h2>\n<p>Every writer is rejected. Most of them get rejected a lot. Even writers that are now legends like J.K. Rowling were rejected. It&#8217;s not always a matter of your work being bad. Sometimes it&#8217;s just that the particular publisher didn&#8217;t need what you&#8217;re selling, or that they already have something similar on their list. You have to keep writing and submitting. <\/p>\n<h2>There&#8217;s not a market for what I want to write<\/h2>\n<p>True, it can be harder to get work published that doesn&#8217;t fit into an established genre. But someone has to be the first to start a new trend. It could be you. <\/p>\n<h2>I&#8217;m too tired and stressed<\/h2>\n<p>Then get your life under control. Go to bed earlier. Try writing in the morning while you&#8217;re still fresh. Drop some obligations to reduce your stress. Figure out what&#8217;s stressing you and then work to eliminate or control it. Exercise to burn off some anger and increase your energy levels. Eat right to keep your overall health in balance. Everyone is tired and stressed but you have to learn how to get things under control so that you can be productive. <\/p>\n<h2>People will laugh at me<\/h2>\n<p>They might. Generally, though, most people are too absorbed in themselves to care about what you&#8217;re doing. And no publisher or agent is going to call you up and laugh at your submission to your face. They&#8217;re too busy to bother laughing at you. You&#8217;ll just get a polite rejection with no laughter. <\/p>\n<h2>The whole thing is just too hard<\/h2>\n<p>If it&#8217;s just too hard to write and go through the process of submitting and revising your work, you&#8217;re in the wrong line of work. Writing is a job and, like any job, it&#8217;s not easy. If it were easy, we&#8217;d all be getting six-figure royalty checks.  <\/p>\n<h2>I&#8217;ll never finish, so why start?<\/h2>\n<p>This speaks to a problem with completion. Do you finish other things you start? If so, then writing just isn&#8217;t important enough to you to finish. Think about whether it&#8217;s something you want to do. If you never finish anything, then you&#8217;ve got a bigger problem you have to solve before you can write or do anything else successfully. Regardless, starting is worthwhile because you might discover that this is the one thing you do finish. <\/p>\n<h2>I&#8217;d rather be doing something else<\/h2>\n<p>Then go do it. Writing is either important enough to you that you will forego other activities, or it&#8217;s not. If you don&#8217;t want to do it, don&#8217;t. If you want to write, you&#8217;ll put your butt in the chair and do the work. Otherwise you&#8217;ll go to the movies and let other people&#8217;s work populate the bookshelves. <\/p>\n<h2>I don&#8217;t know how to get published<\/h2>\n<p>A lot of people don&#8217;t, but they learn. There are plenty of books and magazines to help you and in the age of the Internet, the answer to any question is one Google away. There are also extension classes dedicated to the publishing process. Write the story or book first, then worry about what comes next. <\/p>\n<h2>I have nothing new to say<\/h2>\n<p>If everything on the market had to be 100% original, we could all stop writing right now. There is very little that hasn&#8217;t already been covered. What matters is how you present your material. Is your voice unique? Do you have a slightly different angle on an old problem? Can you improve on something someone has already done? <\/p>\n<h2>I&#8217;m not an expert on anything<\/h2>\n<p>You don&#8217;t have to be. You can learn what you need to know as you go along. Sure, publishers like people who are well established in their fields, but you have a chance even if you&#8217;re not that guy. If you are professional and have something original to say, you can find work. And you can make yourself an expert. Start writing for smaller publications and work your way up. By the time you get to the upper echelon of publications, you&#8217;ll be an expert. <\/p>\n<h2>I&#8217;m not web savvy<\/h2>\n<p>It helps if you know how to set up a blog or website, and if you can promote yourself on Facebook and Twitter. But you can either learn these things as you  go along, or hire someone to handle them for you. There are plenty of writers who pay someone to maintain their websites or presence on social media. There are also plenty of writers who&#8217;ve gone to classes to learn about these things. <\/p>\n<h2>I can&#8217;t handle failure (or success)<\/h2>\n<p>And if you never write, you won&#8217;t have to, now will you? That&#8217;s the allure of this excuse. But if you can&#8217;t handle failure or success in your writing, how can you handle anything that happens to you? Do you freak out if you get promoted at work? Probably not. Are you reduced to despondency if your dinner party doesn&#8217;t turn out the way you hoped? Probably not. The good news is that failure or success in writing is rarely life-threatening. So your story doesn&#8217;t get published? You had a good time writing it, didn&#8217;t you? And you probably weren&#8217;t counting on the money just yet. So try again. And if you succeed, the odds are very low that you&#8217;ll succeed to the point that the paparazzi are camping outside your door and the phone is ringing day and night with people wanting interviews. <\/p>\n<h2>I work full-time and have to take care of the house\/kids\/pets, too<\/h2>\n<p>Again, you need to prioritize your time. Can you write on your lunch hour? Are the kids old enough that they can be dropped at a friend&#8217;s house for a couple of hours? Can they carpool with someone else in their activities once a week so you don&#8217;t have to drive them? And if you do drive them, can you take your laptop and write while you wait? Do you have a spouse that can pick up some of the work? Can you hire a housekeeper who comes in once a month to deal with the worst of the housework? You have to have time for the things that are important to you, whether it&#8217;s writing or something else. Otherwise you&#8217;ll go bonkers. Figure out how to carve that time out of your schedule. <\/p>\n<p>If you find yourself offering up excuse after excuse, it might be time to reevaluate your career choice. You probably shouldn&#8217;t be a writer. If you really want to write, however, you have to realize that these excuses are just that. Excuses. And they&#8217;re probably hiding something else like fear, insecurity, or even something like depression. It may be that you really don&#8217;t want to be a writer. If you deal with the root problem, your excuses will likely go away.<\/p>\n<p>(Image courtesy of <a href=\"http:\/\/www.flickr.com\/photos\/8599338@N04\/3264376846\/\">Achim Hepp<\/a>)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Writers (and those who want to be writers) have tons of excuses for not writing. I&#8217;m not sure there&#8217;s any other occupation with quite so many excuses for not working as writing. Everyone from school kids who have to write a term paper to novelists and freelance writers have piles of excuses for not doing &hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[22,20,14,15,21,17,16,18,13,19],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>25 Excuses for Not Writing (And Why They&#039;re Not Valid) - Word Counter Blog<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"25 Excuses for Not Writing (And Why They&#039;re Not Valid) - Word Counter Blog\" \/>\n<meta property=\"og:description\" content=\"Writers (and those who want to be writers) have tons of excuses for not writing. I&#8217;m not sure there&#8217;s any other occupation with quite so many excuses for not working as writing. Everyone from school kids who have to write a term paper to novelists and freelance writers have piles of excuses for not doing &hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html\" \/>\n<meta property=\"og:site_name\" content=\"Word Counter Blog\" \/>\n<meta property=\"article:published_time\" content=\"2014-01-13T22:12:08+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2017-03-01T15:46:22+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/no-excuses-550x463.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\",\"url\":\"https:\/\/wordcounter.net\/blog\/\",\"name\":\"Word Counter Blog\",\"description\":\"Because words count\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/wordcounter.net\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html#primaryimage\",\"url\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/no-excuses.jpg\",\"contentUrl\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/no-excuses.jpg\",\"width\":893,\"height\":752,\"caption\":\"writing excuses\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html#webpage\",\"url\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html\",\"name\":\"25 Excuses for Not Writing (And Why They're Not Valid) - Word Counter Blog\",\"isPartOf\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html#primaryimage\"},\"datePublished\":\"2014-01-13T22:12:08+00:00\",\"dateModified\":\"2017-03-01T15:46:22+00:00\",\"author\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\"},\"breadcrumb\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/wordcounter.net\/blog\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"25 Excuses for Not Writing (And Why They&#8217;re Not Valid)\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\",\"name\":\"admin\",\"url\":\"https:\/\/wordcounter.net\/blog\/author\/admin\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"25 Excuses for Not Writing (And Why They're Not Valid) - Word Counter Blog","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html","og_locale":"en_US","og_type":"article","og_title":"25 Excuses for Not Writing (And Why They're Not Valid) - Word Counter Blog","og_description":"Writers (and those who want to be writers) have tons of excuses for not writing. I&#8217;m not sure there&#8217;s any other occupation with quite so many excuses for not working as writing. Everyone from school kids who have to write a term paper to novelists and freelance writers have piles of excuses for not doing &hellip;","og_url":"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html","og_site_name":"Word Counter Blog","article_published_time":"2014-01-13T22:12:08+00:00","article_modified_time":"2017-03-01T15:46:22+00:00","og_image":[{"url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/no-excuses-550x463.jpg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/wordcounter.net\/blog\/#website","url":"https:\/\/wordcounter.net\/blog\/","name":"Word Counter Blog","description":"Because words count","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/wordcounter.net\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html#primaryimage","url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/no-excuses.jpg","contentUrl":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/no-excuses.jpg","width":893,"height":752,"caption":"writing excuses"},{"@type":"WebPage","@id":"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html#webpage","url":"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html","name":"25 Excuses for Not Writing (And Why They're Not Valid) - Word Counter Blog","isPartOf":{"@id":"https:\/\/wordcounter.net\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html#primaryimage"},"datePublished":"2014-01-13T22:12:08+00:00","dateModified":"2017-03-01T15:46:22+00:00","author":{"@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef"},"breadcrumb":{"@id":"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/wordcounter.net\/blog"},{"@type":"ListItem","position":2,"name":"25 Excuses for Not Writing (And Why They&#8217;re Not Valid)"}]},{"@type":"Person","@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef","name":"admin","url":"https:\/\/wordcounter.net\/blog\/author\/admin"}]}},"_links":{"self":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/14"}],"collection":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/comments?post=14"}],"version-history":[{"count":9,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/14\/revisions"}],"predecessor-version":[{"id":2961,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/14\/revisions\/2961"}],"wp:attachment":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/media?parent=14"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/categories?post=14"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/tags?post=14"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}