{"id":23,"date":"2015-07-02T09:54:54","date_gmt":"2015-07-02T16:54:54","guid":{"rendered":"http:\/\/www.wordcounter.net\/blog\/?p=23"},"modified":"2015-07-02T12:41:04","modified_gmt":"2015-07-02T19:41:04","slug":"ways-writers-alienate-clients","status":"publish","type":"post","link":"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html","title":{"rendered":"23 Ways Writers Alienate Clients, Publishers, Editors, and Agents"},"content":{"rendered":"<p><center><a href=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2015\/07\/alienate-clients.jpg\"><img loading=\"lazy\" src=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2015\/07\/alienate-clients.jpg\" alt=\"How writers alienate clients and plublishers\" width=\"500\" height=\"375\" class=\"alignnone size-full wp-image-398\" \/><\/a><\/center><\/p>\n<p>Being a writer isn&#8217;t usually thought of as a job that annoys and alienates other people. It&#8217;s not like you&#8217;re a telemarketer. But it&#8217;s entirely possible to so annoy and anger your clients, publishers, agents, and editors to a degree that they will never want to work with you again. Obviously, this is not the way to create a productive writing career. Here are twenty-three things you don&#8217;t want to do if you want to be successful and keep happy clients and associates.<\/p>\n<h2>Don&#8217;t follow directions<\/h2>\n<p>If you are told to keep a piece to a certain <a href=\"https:\/\/wordcounter.net\">word count<\/a>, do it. If you&#8217;re told to format a work a certain way, do it. If you&#8217;re told to turn in drafts at certain points during the project, do it. Clients and editors have these rules for a reason. You are not allowed to go against them just because you feel like it, or because you&#8217;re artistically inspired to do so. If you have a genuinely good reason for wanting to go against their directions, ask first. Don&#8217;t just do it and assume it will be okay. It won&#8217;t. <\/p>\n<h2>Miss your deadlines<\/h2>\n<p>Deadlines are set for a reason. The client needs the project. The magazine or book goes to the printer on a certain date. Your clients are counting on you to deliver by the deadline you&#8217;ve been given. Preferably earlier if you can manage it. Never miss a deadline. If something comes up that will make you miss the deadline, communicate that immediately and do all you can do to rectify the mess, but expect the client to be very unhappy.<\/p>\n<h2>Submit error-filled or incomplete work<\/h2>\n<p>You&#8217;re a writer. You&#8217;re the one they&#8217;re counting on to submit a clean manuscript. Errors, typos and mistakes happen, but do everything you can to make sure they don&#8217;t happen to you. Recheck everything to make sure you&#8217;ve included everything the client asked for. If the client wanted a messy, mistake-filled project, they wouldn&#8217;t have bothered hiring a professional.<\/p>\n<h2>Be demanding<\/h2>\n<p>Agents, editors, and their interns and assistants do not work for you. They can be your partners in getting your work published, but you do not get to give them orders or make unreasonable demands. Asking your agent&#8217;s intern to make ten copies of your manuscript for your family to read is just wrong. Make them yourself. Similarly, you don&#8217;t walk into a meeting and demand coffee or a twenty percent increase in your fee. You can advise when asked and negotiate when appropriate, but being demanding and pushy will get the door slammed in your face.<\/p>\n<h2>Be a diva<\/h2>\n<p>People who throw fits when things don&#8217;t go their way, who think that they are above criticism, and who insist that their work is always perfect and does not need revision are divas. No one is perfect and everyone&#8217;s work needs touching up. Get over it and be humble. Listen to the client and take feedback constructively. Throw your fits in private, not in the client&#8217;s office.<\/p>\n<h2>Don&#8217;t communicate<\/h2>\n<p>You don&#8217;t want to communicate so much that you become annoying (see #11), but most of the time you are expected to let the client know how it&#8217;s going, especially if you are having any problems. Ask questions if something isn&#8217;t clear and let the client know if anything might prevent you from meeting a deadline.<\/p>\n<h2>Be impatient<\/h2>\n<p>Clients, agents, and publishers all have a lot of work to do. They&#8217;ll get to your submission or your invoice when they have a chance. Pestering them daily will only make them mad. Exercise some patience. If a significant amount of time goes by without hearing anything or if they haven&#8217;t contacted you after promising to do so by a certain date, then it&#8217;s okay to send a quick email or make a quick call saying, &#8220;I submitted Project X to you on such-and-such date and haven&#8217;t heard anything. I just wanted to make certain you received it or if there are any problems.&#8221;<\/p>\n<h2>Don&#8217;t do the assignment<\/h2>\n<p>If you are assigned to write an article on fly fishing, the editor does not want to receive your fabulous article on bowling instead. You write and submit what you are assigned, not what your &#8220;muse&#8221; directed to you write. There are plenty of <a href=\"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html\">excuses writers use not to write<\/a>. Don&#8217;t fall for them, and make sure you <a href=\"https:\/\/wordcounter.net\/blog\/2014\/01\/31\/1061_finding-time-to-write.html\">find the time to write<\/a>.<\/p>\n<h2>Don&#8217;t seek clarification<\/h2>\n<p>If you don&#8217;t think you have a good grasp of what the client wants, you need to ask for clarification. Don&#8217;t do what you think they want, make sure you know it&#8217;s what they want. Too often a writer produces a work that technically meets the assignment guidelines, but falls short of what the client envisioned for the product. This is sometimes a failure to communicate and since you can&#8217;t read minds, you need to be sure you know what the client wants. Ask and then try to get it in writing so there are no misunderstandings later.<\/p>\n<h2>Be financially unreasonable<\/h2>\n<p><a href=\"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html\">Fees for most projects<\/a> are negotiated up front, as are the cases where the writer can increase the fee (the client asks for more revisions than negotiated, the scope or size of the project changes, etc.). That&#8217;s the time to ask for more money if you think you&#8217;re worth it. Holding the project hostage at the end while you argue for more money isn&#8217;t cool. If you do this, you&#8217;d better have a darn good reason and be prepared to end up in court.<\/p>\n<h2>Be needy<\/h2>\n<p>Yes, you want to communicate with the client and you want to be sure that what you&#8217;re writing is going to meet their needs. But you don&#8217;t want to be the person that they just can&#8217;t get rid of. Always calling and asking about tiny things, asking for feedback and critique when it&#8217;s not appropriate, and asking for detailed explanations of rejections just screams insecurity. Editors and publishers want confident writers, not writers that require babysitting.<\/p>\n<h2>Be unprofessional<\/h2>\n<p>If you have to go to a client&#8217;s office or appear in a video chat, dress appropriately. Skip the shorts, sweats, and pajama bottoms. Speak clearly and make eye contact. Don&#8217;t mumble or use slang and curse words. Be polite to everyone you interact with, including receptionists and interns. Act like the professional you are.<\/p>\n<h2>Don&#8217;t know your limits<\/h2>\n<p>Yes, you want to be involved in the production of your book or magazine article, but things like cover art, marketing, legalese, placement within the magazine, and paper choices are best left to the professionals. Once you&#8217;ve sold your work, other professionals step in to work through their parts of the process. If you insist on butting in at every stage, you&#8217;re going to wear out your welcome. Fast. If someone asks your advice, give it quickly (without expounding at length as to why you&#8217;re such an &#8220;expert&#8221; in this area) and then shut up.<\/p>\n<h2>Don&#8217;t know your limits, Part II<\/h2>\n<p>Don&#8217;t take on work for which you are not qualified. While it&#8217;s fine to stretch a little bit, claiming to be an expert at something that you know nothing about is wrong and will only cause problems when you can&#8217;t deliver the work as promised. Don&#8217;t advertise yourself as being able to write a proposal for a multimillion dollar grant if you&#8217;ve never written a grant proposal in your life, for example. Build your skills through volunteer work or for lower profile clients before you put yourself up for big assignments.<\/p>\n<h2>Resort to gimmicks to get attention<\/h2>\n<p>Calling at odd hours, sending gifts in the mail, sending singing telegrams, writing in strange fonts or colors, or in any way trying to &#8220;stand out&#8221; is frowned upon. If you must respond to someone&#8217;s kindness, a simple thank you note will suffice.<\/p>\n<h2>Be immature<\/h2>\n<p>Getting rejected sucks, but acting like a baby, throwing a tantrum over the phone, sending hate mail, or posting your gripes on Facebook or your blog will ensure that the agent or editor will remember you and will never look at anything you send in ever again. Ever.<\/p>\n<h2>Call or email when you&#8217;re mad<\/h2>\n<p>Something hasn&#8217;t gone right with a project and you&#8217;re pissed off. Resist the urge to pick up the phone immediately. It&#8217;s in the heat of anger that things are said that can&#8217;t be taken back and which aren&#8217;t even rational. Cool off, think the situation through, and then call or email. It may really be the client&#8217;s fault, but venting your anger all over the place isn&#8217;t going to help.<\/p>\n<h2>Outsource without permission<\/h2>\n<p>If you&#8217;ve taken on too much work, it can be tempting to ask a friend to help you out and write a couple of articles or chapters for you. But there are problems. First, your contract may prohibit this and there can be consequences if you&#8217;re caught. Second, the other person may not do professional work and you could be stuck with the bad rap. Third, this practice gives the impression that you don&#8217;t care about the client enough to pay attention to their project and that you are too disorganized to handle your workload.<\/p>\n<h2>Plagiarize<\/h2>\n<p>It doesn&#8217;t matter how strapped for time you are, or how unreasonable the client may be. Stealing another writer&#8217;s work is just wrong. And on the same note, never submit the same work to two clients without permission. No editor wants to see that their article is exactly the same as the one their competitor ran three months ago.<\/p>\n<h2>Play hard to get<\/h2>\n<p>An agent or editor isn&#8217;t going to spend days trying to track you down. Make sure that you give working and correct phone numbers and email addresses, and that information is consistent across your letterhead, website, and business cards.<\/p>\n<h2>Disappear<\/h2>\n<p>If at any point in the project you don&#8217;t think you can continue, tell the editor. Don&#8217;t just stop returning phone calls and emails, even if you think you have a good reason. Agents and editors will remember your disappearing act.<\/p>\n<h2>Have loose lips<\/h2>\n<p>Many clients expect confidentiality. Even those that don&#8217;t specify it contractually aren&#8217;t going to be happy to see you talk about their work or see you make fun of them on your social networking profile. And be careful what you say in public, too, because you never know who is listening. Keep your mouth shut about your clients, your work for them, and anything that you learn about them while working on their projects.<\/p>\n<h2>Be a drunken fool<\/h2>\n<p>The higher your profile in the writing community, the more that drunken or foolish conduct will reflect upon you. You might be able to get away with it if you&#8217;re unknown (but I still don&#8217;t recommend it), but if your name is appearing regularly in magazines and books, you have to watch what you say and do in public. Just because you work behind a computer doesn&#8217;t mean that you are invisible. You don&#8217;t want to get out of control at parties (particularly business-related functions), post a video of your drunken striptease on Facebook, or have your sister-in-law post pictures of you kissing the waiter at your cousin&#8217;s wedding. Clients don&#8217;t like to be associated with writers who engage in bad behavior.<\/p>\n<p>Publishing and the business world are much smaller than you think. It doesn&#8217;t take long for word of bad behavior to spread. If you turn in shoddy work (or turn in nothing at all), act like a diva, and make unreasonable demands, you can expect to find that getting assignments will become very difficult, if not impossible. Be professional and on your best behavior at all times. That&#8217;s the way to make money as a writer. <\/p>\n<p>(Photo courtesy of <a href=\"https:\/\/www.flickr.com\/photos\/striatic\/2192192956\/\">hobvias sudoneighm<\/a>)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Being a writer isn&#8217;t usually thought of as a job that annoys and alienates other people. It&#8217;s not like you&#8217;re a telemarketer. But it&#8217;s entirely possible to so annoy and anger your clients, publishers, agents, and editors to a degree that they will never want to work with you again. Obviously, this is not the &hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[185,184,189,186,183,188,187],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>23 Ways Writers Alienate Clients, Publishers, Editors, and Agents - Word Counter Blog<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"23 Ways Writers Alienate Clients, Publishers, Editors, and Agents - Word Counter Blog\" \/>\n<meta property=\"og:description\" content=\"Being a writer isn&#8217;t usually thought of as a job that annoys and alienates other people. It&#8217;s not like you&#8217;re a telemarketer. But it&#8217;s entirely possible to so annoy and anger your clients, publishers, agents, and editors to a degree that they will never want to work with you again. Obviously, this is not the &hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html\" \/>\n<meta property=\"og:site_name\" content=\"Word Counter Blog\" \/>\n<meta property=\"article:published_time\" content=\"2015-07-02T16:54:54+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-07-02T19:41:04+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2015\/07\/alienate-clients.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\",\"url\":\"https:\/\/wordcounter.net\/blog\/\",\"name\":\"Word Counter Blog\",\"description\":\"Because words count\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/wordcounter.net\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html#primaryimage\",\"url\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2015\/07\/alienate-clients.jpg\",\"contentUrl\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2015\/07\/alienate-clients.jpg\",\"width\":500,\"height\":375,\"caption\":\"How writers alienate clients and plublishers\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html#webpage\",\"url\":\"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html\",\"name\":\"23 Ways Writers Alienate Clients, Publishers, Editors, and Agents - Word Counter Blog\",\"isPartOf\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html#primaryimage\"},\"datePublished\":\"2015-07-02T16:54:54+00:00\",\"dateModified\":\"2015-07-02T19:41:04+00:00\",\"author\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\"},\"breadcrumb\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/wordcounter.net\/blog\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"23 Ways Writers Alienate Clients, Publishers, Editors, and Agents\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\",\"name\":\"admin\",\"url\":\"https:\/\/wordcounter.net\/blog\/author\/admin\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"23 Ways Writers Alienate Clients, Publishers, Editors, and Agents - Word Counter Blog","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html","og_locale":"en_US","og_type":"article","og_title":"23 Ways Writers Alienate Clients, Publishers, Editors, and Agents - Word Counter Blog","og_description":"Being a writer isn&#8217;t usually thought of as a job that annoys and alienates other people. It&#8217;s not like you&#8217;re a telemarketer. But it&#8217;s entirely possible to so annoy and anger your clients, publishers, agents, and editors to a degree that they will never want to work with you again. Obviously, this is not the &hellip;","og_url":"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html","og_site_name":"Word Counter Blog","article_published_time":"2015-07-02T16:54:54+00:00","article_modified_time":"2015-07-02T19:41:04+00:00","og_image":[{"url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2015\/07\/alienate-clients.jpg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/wordcounter.net\/blog\/#website","url":"https:\/\/wordcounter.net\/blog\/","name":"Word Counter Blog","description":"Because words count","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/wordcounter.net\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html#primaryimage","url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2015\/07\/alienate-clients.jpg","contentUrl":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2015\/07\/alienate-clients.jpg","width":500,"height":375,"caption":"How writers alienate clients and plublishers"},{"@type":"WebPage","@id":"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html#webpage","url":"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html","name":"23 Ways Writers Alienate Clients, Publishers, Editors, and Agents - Word Counter Blog","isPartOf":{"@id":"https:\/\/wordcounter.net\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html#primaryimage"},"datePublished":"2015-07-02T16:54:54+00:00","dateModified":"2015-07-02T19:41:04+00:00","author":{"@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef"},"breadcrumb":{"@id":"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/wordcounter.net\/blog\/2015\/07\/02\/1023_ways-writers-alienate-clients.html#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/wordcounter.net\/blog"},{"@type":"ListItem","position":2,"name":"23 Ways Writers Alienate Clients, Publishers, Editors, and Agents"}]},{"@type":"Person","@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef","name":"admin","url":"https:\/\/wordcounter.net\/blog\/author\/admin"}]}},"_links":{"self":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/23"}],"collection":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/comments?post=23"}],"version-history":[{"count":7,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/23\/revisions"}],"predecessor-version":[{"id":423,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/23\/revisions\/423"}],"wp:attachment":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/media?parent=23"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/categories?post=23"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/tags?post=23"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}