{"id":27,"date":"2014-01-22T11:50:23","date_gmt":"2014-01-22T19:50:23","guid":{"rendered":"http:\/\/www.wordcounter.net\/blog\/?p=27"},"modified":"2019-08-24T03:56:07","modified_gmt":"2019-08-24T10:56:07","slug":"25-ways-to-improve-your-writing-vocabulary","status":"publish","type":"post","link":"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html","title":{"rendered":"25 Ways to Improve Your Writing Vocabulary"},"content":{"rendered":"<p><center><a href=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/vocabulary.jpg\"><img loading=\"lazy\" class=\"alignnone size-medium wp-image-64\" src=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/vocabulary-550x354.jpg\" alt=\"learn new vocabulary\" width=\"550\" height=\"354\" srcset=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/vocabulary-550x354.jpg 550w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/vocabulary-700x451.jpg 700w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/vocabulary-624x402.jpg 624w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/vocabulary.jpg 1022w\" sizes=\"(max-width: 550px) 100vw, 550px\" \/><\/a><\/center>A great vocabulary is just one essential tool in a writer&#8217;s toolbox, along with punctuation, grammar, and many others. Vocabulary can make your writing more powerful and more effective and help you say exactly what you mean. This indispensable tool will help you choose the best word for every job and avoid vague words that do not give your readers a good sense of your meaning.<\/p>\n<p>Building your vocabulary is one of the easiest ways to improve the power of your writing and make any writing task that much easier, as you will have several synonyms in your repertoire to pull from every time. Developing your vocabulary need not be difficult or painful. Here are 25 ways you can improve your writing vocabulary every day.<\/p>\n<h2>Use New Words<\/h2>\n<p>Use a word immediately after you learn it. Try to make a game out of using a new word as soon as you learn it. Every day, try to slip in a new word into the conversation, a journal entry, an assignment or an email to a friend. Do this as often as possible, and repeat the word to yourself.<\/p>\n<h2>Read Every Day<\/h2>\n<p>Once you&#8217;re out of school, word drills and assigned reading become things of the past. While these were tools for building your vocabulary repertoire while you were young, it doesn&#8217;t mean you should abandon reading. Try to read a well-written and edited essay, magazine article, book or news article every day. Nonfiction and technical books will quickly teach you new ways to think and speak with words you may be unfamiliar with, but any type of reading will help you along.<\/p>\n<h2>Learn Roots<\/h2>\n<p>Learn the roots of words. Most words in the English language are built from a common root, prefix, and suffix, usually with an origin in the Greek or Latin language. Once you learn a root, you&#8217;ll begin to understand more words that use the same root. For example, -duc- (Latin root word) means to lead or to make, such as in the words produce or deduce.<\/p>\n<h2>Use a Thesaurus<\/h2>\n<p>Keep a thesaurus handy. As you write, keep a thesaurus handy and use it when you find yourself using a word too often, or using a word that you know doesn&#8217;t quite convey the right meaning. This will help you better express yourself, and you&#8217;ll also learn a new word in the process.<\/p>\n<h2>Develop Practical Vocabulary<\/h2>\n<p>This means you should start by learning words that express what&#8217;s important to you for the task at hand. A good example of this is learning trade language or words you use often in a hobby or vocation. Rather than immediately turning to cliches or jargon that&#8217;s tossed around, look for clearer words to express to peers what you&#8217;re writing about.<\/p>\n<h2>Learn New Words Every Day<\/h2>\n<p>To improve your vocabulary quickly, make an effort to learn at least one new word every single day. There are plenty of ways to do this, such as a Word of the Day calendar or email list, or simply picking a word from a thesaurus or dictionary.<\/p>\n<h2>Look up Words You Don&#8217;t Know<\/h2>\n<p>How often do you come across words that are unfamiliar as you read? Don&#8217;t just gloss over them; take the time to look them up, and if you don&#8217;t have the time right then, write them down and look them up later.<\/p>\n<h2>Keep a Journal<\/h2>\n<p>Journaling won&#8217;t just help you develop your writing style, it will also help you improve your vocabulary. Try to use new or interesting words you&#8217;ve learned recently into a journal entry for the day or the week.<\/p>\n<h2>Identify Empty Words<\/h2>\n<p>You&#8217;re probably familiar with empty words in your speech (such as &#8220;uh&#8221; or &#8220;um&#8221;), but your writing probably has empty words as well. Look for these empty words in your writing that do not offer any substance to your reader and replace them with something more appropriate. The same principle applies to phrases and sentences, so make sure that you haven&#8217;t used six or seven phrases to say something that could be better communicated in one sentence filled with carefully-chosen words.<\/p>\n<h2>Diversify Your Reading List<\/h2>\n<p>If you tend to read the same sort of things day in and day out, you may not be exposing yourself to a wide enough range of vocabulary. Diversify the topics you read to include natural science, Shakespeare, contemporary literature, politics, history, philosophy or any other topics you think you may enjoy.<\/p>\n<h2>Do Word Puzzles<\/h2>\n<p>Word puzzles in the newspaper or a magazine aren&#8217;t just a fun way to fill time, they&#8217;re also perfect for boosting your working vocabulary. Crossword puzzles are a challenge that get your brain working hard to search your memory for words you do know but don&#8217;t use, and this can help you move words from your memory banks into your working set of vocabulary which will come across in your writing.<\/p>\n<h2>Try Word Board Games<\/h2>\n<p>There are plenty of <a href=\"https:\/\/wordcounter.net\/blog\/2016\/06\/22\/101824_word-games.html\">word games<\/a> on the market designed to improve vocabulary and language skills without being a bore. Some of these games you may have played as a child, so it&#8217;s time to break them out again and get to &#8220;work.&#8221; If you have a friend who could also use some help &#8212; or someone with a great vocabulary you think will challenge you &#8212; invite them over for a game night.<\/p>\n<h2>Practice New Words in Divergent Ways<\/h2>\n<p>It takes between 10 and 20 repetitions to make a new word a part of your vocabulary. To help the word settle into your mind and memory, write it down (both the definition and a sentence you make up using the word), use it in conversation, include it in an email or any other way you can think of.<\/p>\n<h2>Make up Associations<\/h2>\n<p>Start by saying the new word aloud, then relate it to a word you already know. A good example of this is gargantuan, which means &#8220;very large&#8221; or &#8220;gigantic.&#8221; Say a sequence aloud: small, medium, large, very large, gargantuan. Then list things you think are gargantuan.<\/p>\n<h2>Use Mnemonics<\/h2>\n<p>Mnemonic techniques are memory tricks you can use to remember new words. You may remember a word by sounding it out and thinking of a funny sentence that matches the meaning, such as turning egregious (extremely bad) into &#8220;Don&#8217;t let that smelly rotten egg reach us!&#8221;<\/p>\n<h2>Visualize New Words<\/h2>\n<p>Research shows that visualization is a great way to remember new words and their meanings. A good example of this is the word stratovolcano, which is a high, pointed mountain with a violent explosion. One way to remember this meaning is the fact that the prefix &#8220;strato&#8221; sounds like &#8220;straight-oh,&#8221; which may make you think of a straight ruler or a &#8220;straight-o-volcano,&#8221; which describes the word&#8217;s definition.<\/p>\n<h2>Make Your Own Vocabulary Tests<\/h2>\n<p>Keep a list of the new words you learn each week and incorporate into writing and conversation. At the end of each week, make yourself a quiz using the words to cement them in your memory.<\/p>\n<h2>Make Synonym Word Lists<\/h2>\n<p>Do you find yourself turning to the same word again and again in your writing? Grab a piece of paper and write it at the top. Next, brainstorm or use a thesaurus to generate a list of ten to twenty new words you can use instead. You can keep these lists in a vocabulary notebook and add to them whenever you learn a new synonym.<\/p>\n<h2>Take a Writing Course<\/h2>\n<p>There are plenty of online courses as well as in-person classes you can attend to boost your writing vocabulary and learn how to use new words correctly. Try to find a self-paced course that uses assignments and quizzes to hep you increase fluency and brush up on your writing skills. Some classes are aimed at essay writing or creative writing, so you can find a class that will help you improve the style you need the most help with.<\/p>\n<h2>Edit Your Own Writing<\/h2>\n<p>After you finish writing, be your own editor and go though the piece with a fine-toothed comb to identify overused and nondescript words with something more precise or colorful. Editing is an important process for spotting writing errors, but it&#8217;s also great for improving the tone, style, and clarity of your writing. It might help to read the sentences aloud, then note any lack of precision. Search through your memory for more descriptive words, or consult a thesaurus if you need to.<\/p>\n<p>As you replace words, remember that using a large number of complex words won&#8217;t necessarily clarify the meaning, and it may just make your writing more pompous. Ask yourself, &#8220;Do I know a better word to use instead?&#8221; You may replace &#8220;use&#8221; with &#8220;acquire&#8221; or &#8220;obtain,&#8221; or &#8220;do&#8221; with &#8220;perform.&#8221;<\/p>\n<h2>Move Words from Comprehensive to Expressive Vocabulary<\/h2>\n<p>You actually have two types of vocabulary: one is a much larger set of words you understand, even if only vaguely, and the other is a smaller set of words you actually use to express yourself. Moving words from your comprehensive, but passive vocabulary, to your active, expressive vocabulary is easier than you think. To do this, you&#8217;ll need to know how to define, pronounce and spell the words. Say them out loud and use them at every opportunity to move them into your active set.<\/p>\n<h2>Ask for Feedback<\/h2>\n<p>Do you think your writing could use some help? If you&#8217;re struggling with your written vocabulary, try asking someone else for help. A second set of eyes can offer a great deal of insight and spot problems you may not notice yourself, including poor word choice. Don&#8217;t be afraid to ask a friend, teacher, co-worker or someone online to review your writing for feedback on your vocabulary.<\/p>\n<h2>Carry a Dictionary and Thesaurus with You<\/h2>\n<p>How often do you find yourself with free time and nothing to do? Carry a pocket thesaurus or dictionary with you and you&#8217;ll find time to beef up your vocabulary while you&#8217;re waiting for an appointment, commuting to work or waiting for a bus. Whenever you have a few minutes to spare, read a page or two and learn a new word to add to your writing. It&#8217;s also a great idea to look up obscure words you don&#8217;t quite grasp that come to you on the fly as you go about your day. You can also use the dictionary or thesaurus to look up unfamiliar words you come across in your daily life.<\/p>\n<h2>Use College Preparation Tests<\/h2>\n<p>College prep tests that use SAT and ACT-type words are a great way to take your writing to the next level. This form of advanced study will challenge your mind and give you a new set of words to use that are practical and offer your writing the clarity it needs. You&#8217;ll also get the chance to brush up on the most important Latin and Greek roots and get a new set of words with activities to help move them into your active vocabulary set.<\/p>\n<h2>Play Games<\/h2>\n<p>There are tons of non-board games that will help you improve your writing vocabulary while you have fun. Try downloading fun word games onto your phone or computer so you can get some practice while you unwind after a busy day. Some games are designed to build vocabulary skills, but there are plenty of others that will help you practice spelling, phonics, and even typing skills. There are even some designed for college students to prepare for testing and vocabulary-rich exams.<\/p>\n<p>Hopefully, this list has given you an excellent place to start to build your vocabulary a bit at a time. If you think about it, there are opportunities all around you to develop this important skill, so spend time every day reading and listening to take in new words and then develop a system to incorporate these new words in your writing and speech. Before long, you&#8217;ll find your vocabulary has grown to a new level and your writing has gained the clarity you need with an ease you didn&#8217;t think possible.<\/p>\n<p><i>Author: Jovell Alingod<\/i><\/p>\n<p>(Image courtesy of <a href=\"http:\/\/www.flickr.com\/photos\/89165847@N00\/8231483775\/\">Michael Coghlan<\/a>)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A great vocabulary is just one essential tool in a writer&#8217;s toolbox, along with punctuation, grammar, and many others. Vocabulary can make your writing more powerful and more effective and help you say exactly what you mean. This indispensable tool will help you choose the best word for every job and avoid vague words that &hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[27,7,26,25,23,24],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>25 Ways to Improve Your Writing Vocabulary - Word Counter Blog<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"25 Ways to Improve Your Writing Vocabulary - Word Counter Blog\" \/>\n<meta property=\"og:description\" content=\"A great vocabulary is just one essential tool in a writer&#8217;s toolbox, along with punctuation, grammar, and many others. Vocabulary can make your writing more powerful and more effective and help you say exactly what you mean. This indispensable tool will help you choose the best word for every job and avoid vague words that &hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html\" \/>\n<meta property=\"og:site_name\" content=\"Word Counter Blog\" \/>\n<meta property=\"article:published_time\" content=\"2014-01-22T19:50:23+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-08-24T10:56:07+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/vocabulary-550x354.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\",\"url\":\"https:\/\/wordcounter.net\/blog\/\",\"name\":\"Word Counter Blog\",\"description\":\"Because words count\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/wordcounter.net\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html#primaryimage\",\"url\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/vocabulary.jpg\",\"contentUrl\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/vocabulary.jpg\",\"width\":1022,\"height\":659,\"caption\":\"learn new vocabulary\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html#webpage\",\"url\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html\",\"name\":\"25 Ways to Improve Your Writing Vocabulary - Word Counter Blog\",\"isPartOf\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html#primaryimage\"},\"datePublished\":\"2014-01-22T19:50:23+00:00\",\"dateModified\":\"2019-08-24T10:56:07+00:00\",\"author\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\"},\"breadcrumb\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/wordcounter.net\/blog\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"25 Ways to Improve Your Writing Vocabulary\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\",\"name\":\"admin\",\"url\":\"https:\/\/wordcounter.net\/blog\/author\/admin\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"25 Ways to Improve Your Writing Vocabulary - Word Counter Blog","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html","og_locale":"en_US","og_type":"article","og_title":"25 Ways to Improve Your Writing Vocabulary - Word Counter Blog","og_description":"A great vocabulary is just one essential tool in a writer&#8217;s toolbox, along with punctuation, grammar, and many others. Vocabulary can make your writing more powerful and more effective and help you say exactly what you mean. This indispensable tool will help you choose the best word for every job and avoid vague words that &hellip;","og_url":"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html","og_site_name":"Word Counter Blog","article_published_time":"2014-01-22T19:50:23+00:00","article_modified_time":"2019-08-24T10:56:07+00:00","og_image":[{"url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/vocabulary-550x354.jpg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/wordcounter.net\/blog\/#website","url":"https:\/\/wordcounter.net\/blog\/","name":"Word Counter Blog","description":"Because words count","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/wordcounter.net\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html#primaryimage","url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/vocabulary.jpg","contentUrl":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/01\/vocabulary.jpg","width":1022,"height":659,"caption":"learn new vocabulary"},{"@type":"WebPage","@id":"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html#webpage","url":"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html","name":"25 Ways to Improve Your Writing Vocabulary - Word Counter Blog","isPartOf":{"@id":"https:\/\/wordcounter.net\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html#primaryimage"},"datePublished":"2014-01-22T19:50:23+00:00","dateModified":"2019-08-24T10:56:07+00:00","author":{"@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef"},"breadcrumb":{"@id":"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/wordcounter.net\/blog"},{"@type":"ListItem","position":2,"name":"25 Ways to Improve Your Writing Vocabulary"}]},{"@type":"Person","@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef","name":"admin","url":"https:\/\/wordcounter.net\/blog\/author\/admin"}]}},"_links":{"self":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/27"}],"collection":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/comments?post=27"}],"version-history":[{"count":11,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/27\/revisions"}],"predecessor-version":[{"id":3369,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/27\/revisions\/3369"}],"wp:attachment":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/media?parent=27"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/categories?post=27"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/tags?post=27"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}