{"id":2729,"date":"2016-12-28T12:54:54","date_gmt":"2016-12-28T20:54:54","guid":{"rendered":"https:\/\/wordcounter.net\/blog\/?p=2729"},"modified":"2017-01-01T11:34:19","modified_gmt":"2017-01-01T19:34:19","slug":"top-writing-blogs","status":"publish","type":"post","link":"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html","title":{"rendered":"Top Writing Blogs to Check Out in 2017"},"content":{"rendered":"<p><center><a href=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/topblogs.jpg\"><img loading=\"lazy\" class=\"alignnone size-medium wp-image-2790\" src=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/topblogs-550x275.jpg\" alt=\"top writing blogs\" width=\"550\" height=\"275\" srcset=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/topblogs-550x275.jpg 550w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/topblogs-700x350.jpg 700w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/topblogs-624x312.jpg 624w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/topblogs.jpg 1024w\" sizes=\"(max-width: 550px) 100vw, 550px\" \/><\/a><\/center>Writing is a solitary occupation, but that doesn&#8217;t mean you&#8217;re on your own! While you use 2017 to try to up your <a href=\"https:\/\/wordcounter.net\">word count<\/a> and <a href=\"https:\/\/wordcounter.net\/blog\/2016\/01\/13\/101131_365-day-book-writing-challenge.html\">write that first novel<\/a>, you don&#8217;t have to do it all by yourself. There are plenty of sources to generate inspiration and helpful tips in the year to come.<\/p>\n<p>If you don&#8217;t know the adage that says writers should be readers too, it&#8217;s time you made it your own, and since you love writing, reading about writing makes absolute sense. You can get tips, tricks and ideas and become part of a community of aspiring writers who share their daily challenges and inspirations.<\/p>\n<p>Writing blogs come in almost as many genres as stories. Some are written by authors sharing their thoughts and experiences on the creative process. Some give you technical tips and tricks. Others offer writing prompts and exercises. Some are for novel writers while others focus on commercial writing. Whatever your interest in writing, you&#8217;re sure to find a good a match.<\/p>\n<p>But how will you find really good writer&#8217;s&#8217;blogs? If you&#8217;re a blogger already, you&#8217;ll know that the blogosphere is full of aspiring writers and poets, and sad to say, few of them are any good? If you don&#8217;t want to end up biting your tongue after reading a very bad post or hitting &#8220;like&#8221; simply because you can see the writer&#8217;s trying hard, check out these fantastic writing blogs by writers for writers.<\/p>\n<p><a href=\"http:\/\/goinswriter.com\/about-me\/\">Goins Writer<\/a><\/p>\n<p>Jeff Goins is a published author and writing coach with lots of great information to share. There are even a couple of downloadable e-books and papers which, regrettably, are punted through pop up advertising. It may seem a little annoying at first, but you&#8217;re sure to pick up some great tips and tricks from Jeff. He discusses novel writing, commercial writing and the road to publication, and if listening is more your speed after a day in front of the computer, you can always tune in to his podcasts.<\/p>\n<p><a href=\"http:\/\/writetodone.com\/about\/\">Write to Done<\/a><\/p>\n<p>Mary Jakcsh, chief editor of Write to Done, curates and creates content that&#8217;s aimed at giving writers lots of practice. She believes that anyone can become a good writer with a little practice. Posts like &#8220;How to be Insanely Creative on Demand&#8221; are sure to tickle your curiosity, and you should have plenty of fun trying to apply the handy tips and writing exercises you&#8217;ll find here.<\/p>\n<p><a href=\"http:\/\/thewritepractice.com\/about\/\">The Write Practice<\/a><\/p>\n<p>Joe Bunting gets endorsements from both Mary and Jeff, and sometimes guest blogs for Mary. He&#8217;s also a writing coach, and his blog has an up-to-the minute feel and plenty of tips on storytelling, character development, how to survive NaNoWriMo and more. He works with a team of professional writers to produce the blog, and you&#8217;ll get the benefit of getting the views of no less than seven writers. There are also loads of free exercises to sharpen your writing skills, so it&#8217;s a worthwhile subscription.<\/p>\n<p><a href=\"http:\/\/writershelpingwriters.net\/resident-writing-coaches\/\">Writers Helping Writers<\/a><\/p>\n<p>Here&#8217;s a blog that&#8217;s exactly what it says it is. All the contributors are published authors with a string of books under their belts, and they give you fabulous tips like &#8220;Dare to bad.&#8221; Dare to be bad? Yup, the first draft always is! At least when you know what&#8217;s bad, you can work on transforming it into something good. As for the blogs, most of them are wonderfully quirky and entertaining, so hit &#8220;follow&#8221; and enjoy the ride!<\/p>\n<p><a href=\"https:\/\/smartblogger.com\/author\/jon\/\">Smart Blogger<\/a><\/p>\n<p>Jon Morrow and associates share the secrets behind a successful blog. And if you&#8217;re hoping to become a published author, your blog is going to be one of your top marketing tools &#8211; provided you have enough followers! Plus, great blogs attract paid advertising, sponsorships, and opportunities for affiliate marketing. Yup, it&#8217;s salesy, but if you want a popular blog, knowing how to sell it is essential! This said, you might decide that the one to two sentence paragraphs that permeate the site won&#8217;t do for your book. You&#8217;re right! But they will work well on your blog&#8230;<\/p>\n<p><a href=\"http:\/\/www.livewritethrive.com\/about\/\">Live Write Thrive<\/a><\/p>\n<p>Would you like to get a view of writing from an editor&#8217;s perspective? Susanne Lakin is both a published author and a writing coach who will shoot from the hip if you give her your novel to look through. Apart from her &#8220;day job&#8221; providing critique and training for writers, there&#8217;s also the blog, so you can benefit from her skills even if you can&#8217;t afford them.<\/p>\n<p><a href=\"http:\/\/www.writers-village.org\/writing-award-blog\/try-this-new-writing-strategy-to-refresh-your-stories-%E2%80%93-and-your-life\">The Wicked Writing Blog<\/a> (aka Writers&#8217; Village)<\/p>\n<p>If you&#8217;d like to throw away your dictionary and punctuate as you please, you&#8217;ll love this anarchic, amusing, and downright entertaining blog. It has a point. Many famous authors who have made it into &#8220;Everybody&#8217;s idea of good literature&#8221; lists have broken the rules: some of them, or all of them. Discover the quirky side of writing here.<\/p>\n<p><a href=\"http:\/\/www.helpingwritersbecomeauthors.com\/about\/\">Helping Writers Become Authors<\/a><\/p>\n<p>If you want the nitty gritty without the sales-pitch, you&#8217;ll enjoy KM Weiland&#8217;s blog. Yes, she writes books about writing, and she&#8217;s written a few novels too, but she isn&#8217;t going to market you to death. There&#8217;s some really useful content there, and despite browsing her blog for minutes (I&#8217;m being honest here), I didn&#8217;t see a single pop up ad, download or sign up invitation. Yes, she does promote her books, but it seems she&#8217;s quite happy to sum up what&#8217;s in them in her blogs. I found the posts I read insightful, and I believe I&#8217;ll be back for more.<\/p>\n<p><a href=\"http:\/\/www.thecreativepenn.com\/about\/\">The Creative Penn<\/a><\/p>\n<p>Thriller writer Joanna Penn is a bestselling author who has also penned (Oh, the temptation to pun!) numerous &#8220;how to&#8221; books on writing and public speaking, and offers creative writing courses. As you&#8217;d expect, there&#8217;s a strong commercial element to her blog, but I didn&#8217;t find it too in your face, and there were some real gems among her tips and tricks.<\/p>\n<p><a href=\"http:\/\/www.stevenpressfield.com\/about\/\">Steven Pressfield Online<\/a><\/p>\n<p>Steven writes historical fiction with a warlike flavor. Chances are, you&#8217;ll have heard about his books or read them at one time or another, and he writes like a true warrior. He hosts several bloggers, but the overarching theme is a gritty tone. As an example, the blog header image currently reads, &#8220;Nobody wants to read your sh*t.&#8221; If you&#8217;re looking for writers who write about writing without pulling their punches, this is the place to be!<\/p>\n<p><a href=\"http:\/\/www.makealivingwriting.com\/about-carol\/\">Make a Living Writing<\/a><\/p>\n<p>Carol Tice is hardworking freelance writer who doesn&#8217;t believe we should be swallowing content mill rates. I like her already! Her blog is full of tips for those who want to make a living through their writing and actually get a fairly decent wage out of it. As a freelance writer, I can vouch for her tips. Follow her for inspiration and ideas that will help you to earn decent money for your writing.<\/p>\n<p><a href=\"https:\/\/www.brainpickings.org\/about\/\">Brain Pickings<\/a><\/p>\n<p>It&#8217;s ad free and interesting. The blog features a lot of information and advice from the greatest writers of our time, and several who were before it. Who is behind it? Maria Popova who says the blog &#8220;is my one-woman labor of love — a subjective lens on what matters in the world and why.&#8221; There&#8217;s plenty of food for thought. Don&#8217;t choose it for an easy read, though. The prose is pretty highbrow.<\/p>\n<p><a href=\"http:\/\/jodyhedlund.com\/about-jody\/my-writing-journey\/\">Jody Hedlund<\/a><\/p>\n<p>Here we have another busy, bestselling author. Much of what she shares is sheer inspiration rather than technical tips, but hey, sometimes inspiration and the will to get up and go on in the face of adversity is what we need most. Jody didn&#8217;t have an easy path to publication, but today, she&#8217;s so busy that her blog posts are rather irregular. Still, when she finds the time to write, her posts have value to writers who hope to emulate her success.<\/p>\n<p><a href=\"http:\/\/www.thewritersalleyblog.com\/p\/about-shopkeepers.html\">The Writers&#8217; Alley<\/a><\/p>\n<p>As long as you aren&#8217;t expecting anything too secular or irreverent, you might enjoy the Writers&#8217; Alley. The blog is administered by a group of 11 published authors who are also dedicated Christians, and the blog combines spirituality with emotion and tech tips. If you&#8217;re not into spirituality and emotion, it isn&#8217;t for you, but if you are, you are going to love it!<\/p>\n<p><a href=\"http:\/\/writersinthestormblog.com\/about\/\">Writers in the Storm<\/a><\/p>\n<p>Three published authors, one blog. They write about what it&#8217;s like handling deadlines, tackling author branding, juggling kids and writing and more. You may find it entertaining, interesting and useful if you are already a published author or want to read about the thrills, spills and challenges of being one.<\/p>\n<p><a href=\"http:\/\/beafreelanceblogger.com\/about\/\">Be a Freelance Blogger<\/a><\/p>\n<p>Here&#8217;s blog runs by a freelance blogging company, and Sophie Lizard ready to tell you what it takes. As someone who has been there, done that, and is still doing that, I approached her blog with skepticism, but she&#8217;s offering some quality information. Even if you don&#8217;t choose to use her as an agent, she&#8217;ll give you some useful tips. She shoots from the hip, and yes, it sounds a little rough in places, but that&#8217;s just how it is.<\/p>\n<p><a href=\"http:\/\/menwithpens.ca\/about\/\">Men with Pens<\/a><\/p>\n<p>If you&#8217;re starting out as freelance writer, you&#8217;ll find this blog inspiring. If you&#8217;ve been at it for a while, it may raise an eyebrow. I didn&#8217;t agree with everything I read here, but I thought overall it gave relatively good advice. There&#8217;s some good stuff on landing new jobs, but also an assumption that you NEED them. Um. I can&#8217;t agree there. Sell more time than you have and you end up subcontracting. Believe me, that way madness lies! Still, it&#8217;s a good blog for those who aren&#8217;t writing their magnum opus but would like to <a href=\"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html\">make some money from writing<\/a>.<\/p>\n<p><a href=\"http:\/\/writerswrite.co.za\/pages\/contact-us\">Writers Write<\/a><\/p>\n<p>Yes, it does sell writing courses. No, it doesn&#8217;t hide all the good stuff till you pay. There&#8217;s a lot of good technical information on the blog, and the writers have done their best to keep it entertaining. Even if you don&#8217;t sign up with the courses, it&#8217;s worthwhile following the blog because it addresses a lot of the &#8220;how to&#8221; questions that plague writers!<\/p>\n<p><a href=\"http:\/\/terribleminds.com\/ramble\/blog\/\">Terrible Minds<\/a><\/p>\n<p>I love it! It&#8217;s cynical, hard hitting and unconventional. That&#8217;s just what you want when following a published author with a blog called &#8220;Terrible Minds.&#8221; Chuck Wendig writes like a true genius, so even if you don&#8217;t agree with his blog posts, you&#8217;ll find them stimulating, and against his will, inspiring. Enjoy a good rant complete with colorful similes and vent under comments.<\/p>\n<p><a href=\"http:\/\/thecourage2create.com\/about\/\">The Courage 2 Create<\/a><\/p>\n<p>Enjoy a mixed bag of thoughts on everything from story development to general musings. Follow Olin Morales on his fiction writing journey &#8211; you&#8217;ll probably find you have a lot in common with this likeable blogger with a touch of the spiritual. Whether you really believe he speaks to angels or not, his posts are highly readable.<\/p>\n<p><a href=\"https:\/\/www.theedublogger.com\/2015\/10\/15\/50-ideas-for-student-blogging-and-writing-online\/\">The Edublogger<\/a><\/p>\n<p>Ronnie Burt provides blogging inspirations for students and points them towards other blogs that could be helpful in schoolwork. Even if you aren&#8217;t a student, you&#8217;ll find plenty of blogs about blogging, and maybe some new ideas you can apply to your own blog.<\/p>\n<p><a href=\"http:\/\/www.creative-writing-now.com\/about-us.html\">Creative Writing Now<\/a><\/p>\n<p>Are you looking for creative writing prompts and ideas? This blog goes all out, and the free downloadable e-book with its &#8220;30 days of inspiration&#8221; is super-tempting. The site is full of writing challenges that will give you all the writing practice you need to sharpen up your creative writing skills. There is a commercial element, but the free stuff is great!<\/p>\n<p><a href=\"http:\/\/www.advicetowriters.com\/\">Advice to Writers<\/a><\/p>\n<p>A small bite of inspiration every day will keep you writing, and Jon Winokur has consulted the greats to compile a long list of quotes from famous writers about being a writer. Some are thought-provoking, others are funny, and it&#8217;s a quick read if you&#8217;re in a mad hurry to make your next deadline.<\/p>\n<p><a href=\"http:\/\/www.dailywritingtips.com\/about\/\">Daily Writing Tips<\/a><\/p>\n<p>Technical tips really improve our writing. All of us have our pet writing failures, and by taking in one writing tip a day and making it your own, you can grow much faster as a writer. It&#8217;s not a light read, but it&#8217;s interesting. From common grammar and punctuation tips to discussions on related words and their origins, you&#8217;re sure to learn something valuable when you follow this blog.<\/p>\n<p><a href=\"http:\/\/accrispin.blogspot.co.za\/p\/about-writer-beware.html\">Writer Beware<\/a><\/p>\n<p>If you&#8217;re on the verge of publishing your first book, you need to be very careful of scams, intellectual property theft, contractual eye-waterers and more. Blog owner A. Crispin hasn&#8217;t posted anything since July, but the blog holds a serious collection of articles that could save you from getting ripped off. Check it out.<\/p>\n<p><a href=\"http:\/\/www.thewritingreader.com\/blog\/\">The Writing Reader<\/a><\/p>\n<p>I love <a href=\"https:\/\/wordcounter.net\/blog\/2016\/02\/03\/101077_creative-writing-ideas-prompts.html\">writing prompts<\/a> that come with a picture, and the Writing Reader gives you thousands of prompts in words and pictures. Ready to write but not sure what to write about? You&#8217;ll really get your creative juices flowing with this cool blog for writers!<\/p>\n<p><a href=\"http:\/\/www.thepassivevoice.com\/about\/\">The Passive Voice<\/a><\/p>\n<p>Here&#8217;s a blog with a difference! It&#8217;s a borrower, in that it quotes some of the best work on any given theme. Until you realize that, it may seem rather a strange read, but once you get used to the compilation style, the penny drops. Because it credits its sources, you&#8217;ll find other websites and blogs worth visiting too. Most posts deal with the latest publishing industry news which allows you to stay on top of the latest trends.<\/p>\n<p><a href=\"http:\/\/victoriamixon.com\/about\/\">Victoria Mixon, Author &amp; Editor<\/a><\/p>\n<p>Victoria Mixon has written what looks to be an excellent book on the art and craft on writing, but although she promotes it in her blog, she offers plenty of tantalizing tidbits for writers written in a unique style that&#8217;s never boring. Read and enjoy!<\/p>\n<p><a href=\"https:\/\/fantasyhandbook.wordpress.com\/about\/\">Fantasy Author&#8217;s Handbook<\/a><\/p>\n<p>Fantasy author Phillip Athans doesn&#8217;t just cover fantasy writing, there are plenty of tech tips too. You&#8217;ll like the way he writes; it&#8217;s clear, to the point, and covers everything from bringing politics into your story to common writing errors. Contrary to popular belief, fantasy is quite a difficult genre, and you should find plenty of information to get you through the process of writing and editing your novel.<\/p>\n<p><a href=\"http:\/\/erikanapoletano.com\/about\/\">Erika Napoletano<\/a><\/p>\n<p>Don&#8217;t read this blog if you can&#8217;t handle strong language and straight talk. Personally, I love it! If you need to get cussed out of bloggers block and set on the road to blogging fame again, Erika delivers the goods in an effective and entertaining way. It&#8217;s definitely a gutsy blog for gutsy bloggers! You&#8217;ll laugh, you&#8217;ll cringe, you&#8217;ll think &#8211; it&#8217;s one of the best on this list.<\/p>\n<p><strong>Do a bit of your own hunting!<\/strong><\/p>\n<p>As you can see, you&#8217;ll have your work cut out trying to determine just who you should follow. Whether you like your writing inspirations from the fringe (Terrible Minds, Wicked Writing), from a commercial perspective (Be a Freelance Blogger, Make a Living Writing), a spiritual one (Writers&#8217; Alley), technical (Writers Write) or a creative one (Writers Helping Writers), you&#8217;re sure to find the right writers&#8217; blog for your needs!<\/p>\n<p>Do you know of other writing blogs which should be included on this list? Let us know about them in the comments.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Writing is a solitary occupation, but that doesn&#8217;t mean you&#8217;re on your own! While you use 2017 to try to up your word count and write that first novel, you don&#8217;t have to do it all by yourself. There are plenty of sources to generate inspiration and helpful tips in the year to come. If &hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[210,844,846,843,270,845,731],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Top Writing Blogs to Check Out in 2017 - Word Counter Blog<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Top Writing Blogs to Check Out in 2017 - Word Counter Blog\" \/>\n<meta property=\"og:description\" content=\"Writing is a solitary occupation, but that doesn&#8217;t mean you&#8217;re on your own! While you use 2017 to try to up your word count and write that first novel, you don&#8217;t have to do it all by yourself. There are plenty of sources to generate inspiration and helpful tips in the year to come. If &hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html\" \/>\n<meta property=\"og:site_name\" content=\"Word Counter Blog\" \/>\n<meta property=\"article:published_time\" content=\"2016-12-28T20:54:54+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2017-01-01T19:34:19+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/topblogs-550x275.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\",\"url\":\"https:\/\/wordcounter.net\/blog\/\",\"name\":\"Word Counter Blog\",\"description\":\"Because words count\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/wordcounter.net\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html#primaryimage\",\"url\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/topblogs.jpg\",\"contentUrl\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/topblogs.jpg\",\"width\":1024,\"height\":512,\"caption\":\"top writing blogs\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html#webpage\",\"url\":\"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html\",\"name\":\"Top Writing Blogs to Check Out in 2017 - Word Counter Blog\",\"isPartOf\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html#primaryimage\"},\"datePublished\":\"2016-12-28T20:54:54+00:00\",\"dateModified\":\"2017-01-01T19:34:19+00:00\",\"author\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\"},\"breadcrumb\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/wordcounter.net\/blog\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Top Writing Blogs to Check Out in 2017\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\",\"name\":\"admin\",\"url\":\"https:\/\/wordcounter.net\/blog\/author\/admin\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Top Writing Blogs to Check Out in 2017 - Word Counter Blog","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html","og_locale":"en_US","og_type":"article","og_title":"Top Writing Blogs to Check Out in 2017 - Word Counter Blog","og_description":"Writing is a solitary occupation, but that doesn&#8217;t mean you&#8217;re on your own! While you use 2017 to try to up your word count and write that first novel, you don&#8217;t have to do it all by yourself. There are plenty of sources to generate inspiration and helpful tips in the year to come. If &hellip;","og_url":"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html","og_site_name":"Word Counter Blog","article_published_time":"2016-12-28T20:54:54+00:00","article_modified_time":"2017-01-01T19:34:19+00:00","og_image":[{"url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/topblogs-550x275.jpg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/wordcounter.net\/blog\/#website","url":"https:\/\/wordcounter.net\/blog\/","name":"Word Counter Blog","description":"Because words count","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/wordcounter.net\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html#primaryimage","url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/topblogs.jpg","contentUrl":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/topblogs.jpg","width":1024,"height":512,"caption":"top writing blogs"},{"@type":"WebPage","@id":"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html#webpage","url":"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html","name":"Top Writing Blogs to Check Out in 2017 - Word Counter Blog","isPartOf":{"@id":"https:\/\/wordcounter.net\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html#primaryimage"},"datePublished":"2016-12-28T20:54:54+00:00","dateModified":"2017-01-01T19:34:19+00:00","author":{"@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef"},"breadcrumb":{"@id":"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/wordcounter.net\/blog\/2016\/12\/28\/102729_top-writing-blogs.html#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/wordcounter.net\/blog"},{"@type":"ListItem","position":2,"name":"Top Writing Blogs to Check Out in 2017"}]},{"@type":"Person","@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef","name":"admin","url":"https:\/\/wordcounter.net\/blog\/author\/admin"}]}},"_links":{"self":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/2729"}],"collection":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/comments?post=2729"}],"version-history":[{"count":14,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/2729\/revisions"}],"predecessor-version":[{"id":2848,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/2729\/revisions\/2848"}],"wp:attachment":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/media?parent=2729"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/categories?post=2729"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/tags?post=2729"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}