{"id":2744,"date":"2016-12-19T06:42:56","date_gmt":"2016-12-19T14:42:56","guid":{"rendered":"https:\/\/wordcounter.net\/blog\/?p=2744"},"modified":"2017-01-01T11:20:14","modified_gmt":"2017-01-01T19:20:14","slug":"words-you-should-know","status":"publish","type":"post","link":"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html","title":{"rendered":"100 Words You Should Know"},"content":{"rendered":"<p><center><a href=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/adult-words.jpg\"><img loading=\"lazy\" class=\"alignnone size-medium wp-image-2779\" src=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/adult-words-550x287.jpg\" alt=\"words you should know\" width=\"550\" height=\"287\" srcset=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/adult-words-550x287.jpg 550w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/adult-words-700x366.jpg 700w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/adult-words-624x326.jpg 624w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/adult-words.jpg 1200w\" sizes=\"(max-width: 550px) 100vw, 550px\" \/><\/a><\/center>As an adult English speaker, you&#8217;re expected to have an extensive vocabulary that includes some words that are seldom used in conversational English. You should also be striving to <a href=\"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html\">improve your vocabulary<\/a>. While all these lists are somewhat subjective, they&#8217;re a good way to see how good your current vocabulary happens to be, and work on <a href=\"https:\/\/wordcounter.net\">some words<\/a> you may not know. See how you measure up to this list of 100 intermediate to advanced vocabulary words every adult should know.<\/p>\n<p>Just to make things more interesting, I&#8217;ve also peppered a few rather <a href=\"https:\/\/randomword.com\">obscure words<\/a> into the mix, and even though these may rarely be used, they&#8217;ll make you an even more dangerous Scrabble player, crossword whizz or other <a href=\"https:\/\/wordcounter.net\/blog\/2016\/06\/22\/101824_word-games.html\">word game player<\/a> than you already are. Enjoy!<\/p>\n<p>1. <strong>Acquiesce<\/strong><\/p>\n<p>This word means that a person has agreed or assented either verbally or tacitly to something. Even when it is well understood, this word is often misspelled.<\/p>\n<p>2. <strong>Aberration<\/strong><\/p>\n<p>Sometimes, it&#8217;s good to be different, but the word &#8220;aberration&#8221; describes an unwelcome oddity. So, if someone accuses you of aberrant behavior, they aren&#8217;t complimenting your originality.<\/p>\n<p>3. <strong>Abjure<\/strong><\/p>\n<p>If you solemnly renounce something, you have abjured it. The word is used in baptism ceremonies in certain churches. The person being baptized declares that he or she abjures Satan and all his works.<\/p>\n<p>3. <strong>Abrogate<\/strong><\/p>\n<p>Abrogation is a situation in which formal or legal measures are taken to do away with something. This would usually be a law or a formal rule that is repealed or temporarily suspended.<\/p>\n<p>4. <strong>Acronym<\/strong><\/p>\n<p>This should have been an easy one for lovers of language. An acronym is an abbreviation consisting of letters. For example, U.S.A for United States of America.<\/p>\n<p>5. <strong>Anachronism<\/strong><\/p>\n<p>I&#8217;m sure you will have encountered a few anachronisms during your life. An anachronism is something that is out of date and no longer relevant to the times. If you want to argue that something has lost its relevance by not changing with the times, you can describe it as being anachronistic or an anachronism.<\/p>\n<p>6. <strong>Anathema<\/strong><\/p>\n<p>No, it&#8217;s not a rather nice sounding girl&#8217;s name. It describes something that you vehemently dislike to the point of total rejection. For example: &#8220;He is an atheist; all forms of religion are anathema to him.&#8221;<\/p>\n<p>7. <strong>Antebellum<\/strong><\/p>\n<p>A thing that is described as &#8220;antebellum&#8221; was conceived or constructed prior to an important war. The plantation era before the American Civil War is sometimes referred to as the antebellum era, but the word can apply to anything that preceded a major war.<\/p>\n<p>8. <strong>Anthropogenic<\/strong><\/p>\n<p>Anything that has been caused by human interventions is anthropogenic. The word is usually used in the context of environmental degradation and pollution. Climate change, for example, could be described as an anthropogenic phenomenon.<\/p>\n<p>9. <strong>Antithesis<\/strong><\/p>\n<p>Something or someone that is the diametric opposite of something else. &#8220;He was the antithesis of the frivolous millionaire playboy,&#8221; would imply that the person was the opposite of what one expect from a happy-go-lucky millionaire. Perhaps he was very serious about current issues, or didn&#8217;t like wasting money on status symbols.<\/p>\n<p>10. <strong>Assonance<\/strong><\/p>\n<p>This is the sound a donkey makes. Alright, I&#8217;m kidding again, but it does have something to do with sound. It is a technique often used in creative writing and poetry in which similar sounding (but not necessarily rhyming) words are used in close proximity to one another.<\/p>\n<p>11. <strong>Benchmarking<\/strong><\/p>\n<p>Benchmarking involves selecting a certain state as being the norm against which other, similar things will be compared. For example, in vegetation surveys, undisturbed nature would be seen as the benchmark against which vegetation would be evaluated.<\/p>\n<p>12. <strong>Bellicose<\/strong><\/p>\n<p>This is a lovely word for describing people who are aggressive and even willing to fight over an issue. As you can imagine, bellicosity and politics often go hand in hand!<\/p>\n<p>13. <strong>Bowdlerize<\/strong><\/p>\n<p>This is a form of censorship that not only removes the portions of text some might consider risqué, but also weakens the work. The original Bowdler, published an expurgated version of Shakespeare. &#8220;Nothing is added to the original text; but those words and expressions omitted which cannot with propriety be read aloud in a family,&#8221; he wrote, blithely unaware that his 1818 work would turn his name into a byword for literary slaughter.<\/p>\n<p>14. <strong>Chicanery<\/strong><\/p>\n<p>&#8220;Chicanery&#8221; alludes to the use of dirty tricks in the financial, political or legal world. If you are ever accused of it, know that you are in deep trouble!<\/p>\n<p>15. <strong>Chthonic<\/strong><\/p>\n<p>You really won&#8217;t see this word in everyday use, but it&#8217;s a killer if you&#8217;re into word games! It refers to caves or the underworld. It is a synonym for the more well-known &#8220;subterranean&#8221; .<\/p>\n<p>16. <strong>Cerulean<\/strong><\/p>\n<p>You will no doubt have read about cerulean waters or skies and assumed that they were blue. You are right. Specifically, the word refers to a deep, sky-blue.<\/p>\n<p>17. <strong>Circumspect<\/strong><\/p>\n<p>If you are behaving with circumspection, you are watchful, wary or unwilling to take risks. One could almost say it was an antonym or opposite for &#8220;bellicose&#8221;!<\/p>\n<p>18. <strong>Circumlocution<\/strong><\/p>\n<p>Have you ever talked to someone who explains things in a roundabout way? They are guilty of circumlocution. They literally &#8220;talk around&#8221; a subject instead of being specific and concise.<\/p>\n<p>19. <strong>Cogent<\/strong><\/p>\n<p>The person who is guilty of circumlocution, should try to be more cogent. In other words, they should be clear, logical and convincing. When you present arguments, you will strive for cogency.<\/p>\n<p>20. <strong>Colloquial<\/strong><\/p>\n<p>This is the kind of language we use every day. It is the &#8220;spoken&#8221; form of a language, and is not appropriate when you are writing a formal text. That doesn&#8217;t mean that colloquial words are wrong or bad. They are simply informal.<\/p>\n<p>21. <strong>Conundrum<\/strong><\/p>\n<p>A conundrum could simply be a riddle, but it is also used to describe any puzzling or difficult question.<\/p>\n<p>22. <strong>Crepuscular<\/strong><\/p>\n<p>This lovely word is used to describe things that resemble or relate to twilight. In its simplest form, it is used to describe creatures that become active at twilight, but I&#8217;m sure you know a few people like that too!<\/p>\n<p>23. <strong>Deleterious<\/strong><\/p>\n<p>If something has harmful effects, they can be described as &#8220;deleterious effects.&#8221; You&#8217;ll often find this word being used in medical texts and in psychology. &#8220;Harmful&#8221; is just as good, but this word is ever so much weightier!<\/p>\n<p>24. <strong>Depredation<\/strong><\/p>\n<p>My mom used to use this word to describe my brother&#8217;s activities in the pantry. It describes an act of attack or plunder. Judging from the state of the grocery cupboard once my brother was finished, my mom described what he&#8217;d been up to very well.<\/p>\n<p>25. <strong>Didactic<\/strong><\/p>\n<p>In its simplest context, this word describes something that was designed to teach a lesson. For example, a didactic story would have a strong lesson to teach. However, the word can also be used negatively to describe someone who is preachy and patronizing.<\/p>\n<p>26. <strong>Egregious<\/strong><\/p>\n<p>Think of all the words that mean &#8220;terribly bad or shocking;&#8221; that&#8217;s what &#8220;egregious&#8221; means. Never did a difficult-seeming word have a simpler definition!<\/p>\n<p>27. <strong>Enervate<\/strong><\/p>\n<p>If you are feeling drained, weakened and tired out, you have probably been through some sort of enervating experience. There are good types of tiredness, but this is not one of them.<\/p>\n<p>28. <strong>Enfranchise<\/strong><\/p>\n<p>This means giving people freedom or the right to vote. Nowadays, we worry about disenfranchisement, a situation in which rights or freedoms are taken away.<\/p>\n<p>29. <strong>Entomophagy<\/strong><\/p>\n<p>This word is quite rarely used, but if we were to have a famine, or if certain exotic dishes became popular, we might need it. It means &#8220;the eating of insects,&#8221; and although it generally applies to animals and birds, there are plenty of people who eat insects as a matter of course! Any word with the suffix &#8220;phagy&#8221; or &#8220;phagous&#8221; refers to what an organism eats.<\/p>\n<p>30. <strong>Epiphany<\/strong><\/p>\n<p>An epiphany is an &#8220;Aha!&#8221; moment, but the word comes from the Christian festival celebrating the revelation of Christ to the magi. If you have a life-changing realization, it could be described as an epiphany.<\/p>\n<p>31. <strong>Epitome<\/strong><\/p>\n<p>A perfect example of something epitomizes it. &#8220;Her life so far is the epitome of the American Dream,&#8221; makes me think, &#8220;Wow, I want one just like it!&#8221;<\/p>\n<p>32. <strong>Eschatology<\/strong><\/p>\n<p>A lot of people discuss this quite heatedly without knowing the right word for it. It is a religious doctrine that deals with death, judgement, and what happens to the soul after death. And in case you were wondering &#8211; I didn&#8217;t know this word before I researched this article, but I thought we needed a few challenges.<\/p>\n<p>33. <strong>Eschew<\/strong><\/p>\n<p>Here&#8217;s a useful little word that says more than it seems to. For example, you could say someone doesn&#8217;t exercise, but if you say, &#8220;He eschewed exercise,&#8221; it implies a stronger and more deliberate aversion.<\/p>\n<p>34. <strong>Evanescent<\/strong><\/p>\n<p>If you have literary ambitions, this beautiful word is worth having in your vocabulary. It refers to something that is transitory, or that disappears or fades rapidly.<\/p>\n<p>35. <strong>Existential<\/strong><\/p>\n<p>The word structure says it all. It describes something to do with the nature of existence. If you&#8217;re into philosophy, you probably use this word a lot.<\/p>\n<p>36. <strong>Exponential<\/strong><\/p>\n<p>There is a mathematical description of exponents and what can be regarded as &#8220;exponential.&#8221; I&#8217;m not going to go into it here. We more often hear of it in a context that implies rapidly increasing growth. When you hear it, don&#8217;t just trust it. Ask for the figures.<\/p>\n<p>37. <strong>Facetious<\/strong><\/p>\n<p>This is one of my all-time favorite words, and I have frequently been accused of facetiousness. It means making inappropriate jokes or taking serious situations too lightly. I wouldn&#8217;t say it&#8217;s always a good thing, but sometimes, it helps, because there are times when we are way too serious about unimportant things.<\/p>\n<p>38. <strong>Fascism<\/strong><\/p>\n<p>What is it? It sounds great in political arguments, and the word is often bandied about. It is a type of nationalism that sprang up in Europe in the 1920&#8217;s, and it led to some pretty authoritarian governments that were known for their right-wing views and intolerance. If you want to know more about the deeper implications of fascism, read some history.<\/p>\n<p>39. <strong>Fatuous<\/strong><\/p>\n<p>A fatuous comment is silly, inane, or just plain stupid. Save this remark for someone who really deserves it, and serve it up cold.<\/p>\n<p>40. <strong>Fiduciary<\/strong><\/p>\n<p>If you encounter this word, it will be in a legal context. It is the term used to describe a trustee who takes care of assets on behalf of one or more beneficiaries.<\/p>\n<p>41. <strong>Filibuster<\/strong><\/p>\n<p>The filibuster is a person who uses a dirty, time-wasting trick to hold up a legislative decision. Without breaking any rules, the filibuster speaks at great length without saying anything useful. The word comes from the old English for &#8220;pirate,&#8221; and it is not a good thing to be.<\/p>\n<p>42. <strong>Fulminate<\/strong><\/p>\n<p>Let&#8217;s use an example: your teacher tells the class that the holiday assignment is a 10,000-word essay. After class, everyone discusses how furious they are, how unfair it is, and so on. They are, in fact, fulminating.<\/p>\n<p>43. <strong>Hegemony<\/strong><\/p>\n<p>Ever since people first got together to live in cities, there have been groups of citizens with differing cultural or social backgrounds. When one group politically dominates all the others, it is called a &#8220;hegemony,&#8221; and the term can be applied to any form of government that fits the description.<\/p>\n<p>44. <strong>Heuristic<\/strong><\/p>\n<p>If someone once helped you to work something out for yourself, he or she used a heuristic teaching method. You could call it &#8220;hands on&#8221; learning, but nobody shows you what to do. They just show you how to figure it out, and you get to feel great when you get it right.<\/p>\n<p>45. <strong>Holistic<\/strong><\/p>\n<p>The simplest definition for this would be to say that holism considers various factors that influence each other, and not just one factor, influence or symptom in isolation. The term is most commonly used in philosophy and medicine, but it is getting quite commercialized, and is sometimes used elsewhere too.<\/p>\n<p>46. <strong>Homonym<\/strong><\/p>\n<p>When two words are spelled the same, are pronounced the same, but have different meanings, they are homonyms. For instance, &#8220;The man standing beside the pole is a Pole.&#8221;<\/p>\n<p>47. <strong>Hubris<\/strong><\/p>\n<p>In Greek mythology, hubris was a state in which mankind defied the gods or thought itself better than the gods. Dreadful consequences predictably followed. Today, it means excessive pride or confidence that could lead to terrible consequences.<\/p>\n<p>48. <strong>Incisive<\/strong><\/p>\n<p>Have you ever tried to explain how you feel about something at length only for your listener to sum it all up in a sentence or two? That&#8217;s incisive thinking. It gets to the heart of the matter quickly, showing great insight.<\/p>\n<p>49. <strong>Incognito<\/strong><\/p>\n<p>Are you mysterious? Then you may like being incognito &#8211; using another identity or concealing your own identity in some other way.<\/p>\n<p>50. <strong>Inculcate<\/strong><\/p>\n<p>This means teaching someone a principle or habit in such a way that the lesson is fully ingrained and adopted.<\/p>\n<p>51. <strong>Interpolate<\/strong><\/p>\n<p>Interpolating something means inserting it between fixed points. The word is often used to indicate that something has been added to a book or text. Perhaps there are images, or perhaps a third party has added information. It can also be an interruption when someone is talking.<\/p>\n<p>52. <strong>Irony<\/strong><\/p>\n<p>Too easy? Nevertheless, this word is often incorrectly used. Irony means saying the opposite of what you mean for effect. Sometimes, events can be ironic for the same reason: they seem to contradict each other. Many people confuse it with sarcasm.<\/p>\n<p>53. <strong>Juxtaposition<\/strong><\/p>\n<p>When two contrasting situations or thoughts are compared for effect, we have a juxtaposition. It&#8217;s a useful technique in both creative and factual writing.<\/p>\n<p>54. <strong>Jejune<\/strong><\/p>\n<p>If someone presents you with a naïve point of view, seems to be oversimplifying, or has only superficial knowledge, you can use this word, both to describe their efforts, and to baffle them.<\/p>\n<p>55. <strong>Lionize<\/strong><\/p>\n<p>When you treat someone as if they were a celebrity, then you are lionizing them. Sometimes, we do this out of genuine respect for what they do, but sometimes, people do it to gain favor.<\/p>\n<p>56. <strong>Lucubration<\/strong><\/p>\n<p>The word &#8220;lucubration&#8221; could be used to indicate something that has been given a lot of study and deep thought, but it&#8217;s also a rather rude way of describing a piece of writing that seems terribly pedantic and overelaborate.<\/p>\n<p>57. <strong>Malapropism<\/strong><\/p>\n<p>The word &#8220;malapropism&#8221; was coined thanks to a 1755 play by Richard Sheridan. Mrs. Malaprop would often replace words with similar sounding ones with amusing results. If you talk about having &#8220;danced the flamingo&#8221; you are guilty of a malapropism.<\/p>\n<p>58. <strong>Magnanimous<\/strong><\/p>\n<p>When someone is very generous or forgiving to someone in a less powerful positon, you can call him or her &#8220;magnanimous.&#8221; It&#8217;s a form of generosity that isn&#8217;t really necessary, but that shows kindness.<\/p>\n<p>59. <strong>Mnemonic<\/strong><\/p>\n<p>When you use a combination of letters, a rhyme, or a set of associated things to remember a list of names or facts, you are using mnemonics.<\/p>\n<p>60. <strong>Motif<\/strong><\/p>\n<p>A motif could be something as simple as a design on a Tee shirt, or it can be a theme in writing or music. A leitmotif is a &#8220;leading motif&#8221; that is one of several motifs, but is dominant. In music, it could be a theme tune associated with a particular character.<\/p>\n<p>61. <strong>Moiety<\/strong><\/p>\n<p>In anthropology, this term relates to the groups into which people are divided during important rituals, but it has also come to mean a share, particularly a lesser one.<\/p>\n<p>62. <strong>Nihilism<\/strong><\/p>\n<p>&#8220;Nothing matters, everything is trivial, even existence is questionable and could be an illusion. There is no God, and nothing has any importance.&#8221; If this depressing philosophy appeals to you, you are a nihilist.<\/p>\n<p>63. <strong>Nomenclature<\/strong><\/p>\n<p>A nomenclature is a system designed for naming things. It could be a set of terminology, a term, or it could refer to a scientific naming system such as that used to identify all living things with two Latin names.<\/p>\n<p>64. <strong>Nemesis<\/strong><\/p>\n<p>You don&#8217;t want to meet this person or circumstance. It is an &#8220;inescapable agent&#8221; that leads to your downfall.<\/p>\n<p>65. <strong>Obfuscate<\/strong><\/p>\n<p>Scenario: you have just been to class. Your teacher has explained something at length in terms that have left you totally confused. Scenario two: you ask a friend why they did something you don&#8217;t quite approve of, and they give you a long story that leaves you feeling baffled. Words can be used to clarify, or they can be used to obfuscate facts.<\/p>\n<p>66. <strong>Obsequious<\/strong><\/p>\n<p>People are bowing and scraping and offering every possible tribute to someone in power. You have a feeling they&#8217;re being obsequious because of the servile degree of attention they are giving.<\/p>\n<p>67. <strong>Oligarchy<\/strong><\/p>\n<p>A small group of people with very similar interests have absolute control over the destiny of a country or an institution. Does that sound scary? Now you know what to call it!<\/p>\n<p>68. <strong>Onomatopoeia<\/strong><\/p>\n<p>&#8220;Bang! Crash! Zoink. Kerflabaflabaflaba!&#8221; Words that are meant to imitate sounds are examples of onomatopoeia.<\/p>\n<p>69. <strong>Ontology<\/strong><\/p>\n<p>What is the metaphysical nature of being? Do you have an opinion? That&#8217;s ontology! Don&#8217;t even ask me about mine&#8230;<\/p>\n<p>70. <strong>Orthography<\/strong><\/p>\n<p>How are words spelled? That&#8217;s orthography right there!<\/p>\n<p>71. <strong>Oxymoron<\/strong><\/p>\n<p>I&#8217;m sure you know a few phrases that are contradictions in terms. Some say that &#8220;military intelligence&#8221; is one of them. Which oxymoron is your favorite?<\/p>\n<p>72. <strong>Paradigm<\/strong><\/p>\n<p>If you go into business, you will hear this word rather a lot. It means a model that governs the way things are done, and they&#8217;ll usually be telling you that you need to shift it, or that there is a new one.<\/p>\n<p>73. <strong>Paucity<\/strong><\/p>\n<p>When there is too little of anything, you are suffering a paucity of it. It&#8217;s most often used in relation to facts, but it works just as well and even more uncomfortably with funds.<\/p>\n<p>74. <strong>Pecuniary<\/strong><\/p>\n<p>How remarkable that this word should follow my last incisive remark! Pecuniary considerations are about money. Please do not use them as the sole basis for choosing a career. You will be unhappy, but will have achieved pecuniary gain.<\/p>\n<p>75. <strong>Pedantic<\/strong><\/p>\n<p>Sometimes, it&#8217;s good to be fussy or finicky about the way you present information, but if you go too far with it, people will call you &#8220;pedantic.&#8221;<\/p>\n<p>76. <strong>Pedagogy<\/strong><\/p>\n<p>Pedagogy is teaching, and a pedagogue is a teacher, but this old-fashioned word is often used negatively to describe someone who teaches rather boringly.<\/p>\n<p>77. <strong>Pejorative<\/strong><\/p>\n<p>If you&#8217;re inclined to disapprove or disparage something, you are being pejorative. Pejorative words express disapproval.<\/p>\n<p>78. <strong>Phonemes<\/strong><\/p>\n<p>Phonemes are letters that distinguish very similar words from one another. For instance, &#8220;pad, pat, bad and bat&#8221; are distinguished from each other by phonemes.<\/p>\n<p>79. <strong>Plagiarism<\/strong><\/p>\n<p>As a student, you need to understand plagiarism and know how to avoid it. If you were to copy whole passages from someone else&#8217;s work, that&#8217;s plagiarism. Of course, plagiarism is something to be avoided whenever you are supposed to be producing original work.<\/p>\n<p>80. <strong>Proletariat<\/strong><\/p>\n<p>If you are an average working class person, you are a member of the proletariat. The word was extensively used in Marxist philosophy, but now it&#8217;s fair game for anyone to use.<\/p>\n<p>81. <strong>Prolix<\/strong><\/p>\n<p>When someone calls your written work &#8220;prolix,&#8221; you should not congratulate yourself. It means you have presented it in an overly complicated, wordy, or rambling fashion. It&#8217;s also a great scrabble word. Just imagine the score if you hit &#8220;triple word score&#8221; with it!<\/p>\n<p>89. <strong>Pusillanimous<\/strong><\/p>\n<p>Cowards, the lily-livered and the generally timid may be deserving of a suitably disparaging adjective. This is it.<\/p>\n<p>80. <strong>Quotidian<\/strong><\/p>\n<p>You could use this word to describe something that is mundane or that happens every day. If you&#8217;re looking for a synonym, try &#8220;everyday&#8221; for size. In medicine, it is used to describe a particularly nasty form of malaria.<\/p>\n<p>81. <strong>Reify<\/strong><\/p>\n<p>Never let it be said that we only looked at long words. This one means turning something abstract into something more real and easier to understand.<\/p>\n<p>82. <strong>Rubric<\/strong><\/p>\n<p>There are three meanings for this word. It could be a statement of purpose or function, a simple heading at the top of a document, or a note in a liturgical book indicating how a ceremony should be performed.<\/p>\n<p>83. <strong>Sanguine<\/strong><\/p>\n<p>I like people with a sanguine disposition. They are upbeat and optimistic. You can, for example, be sanguine about the future, your economic prospects, and so on. Of course, that doesn&#8217;t necessarily mean you are being realistic!<\/p>\n<p>84. <strong>Scurrilous<\/strong><\/p>\n<p>Being scurrilous could mean everything from being humorously insulting to being downright libelous and spreading nasty rumors.<\/p>\n<p>85. <strong>Sesquipedalian<\/strong><\/p>\n<p>What could be better than a really long word to describe the use of long words? I have to admit, this is one of my favorites, simply because it seems so appropriate, and rather funny.<\/p>\n<p>86. <strong>Soliloquy<\/strong><\/p>\n<p>Nowadays, if you were to talk to yourself about what your thoughts and feelings, people would think you had gone mad. Nevertheless, the soliloquy has been widely used in drama to give audiences an insight into the character&#8217;s thoughts.<\/p>\n<p>87. <strong>Tautology<\/strong><\/p>\n<p>There are two ways to use this word. A tautology could be an unnecessary repetition &#8211; repeating the same idea using different words. It could also be used to describe logic that is undeniably correct and proves a truth.<\/p>\n<p>88. <strong>Temerity<\/strong><\/p>\n<p>When you need a word to describe an action that is outrageously cheeky or audacious, this word is perfect for the job, &#8220;He had the temerity to decide I wouldn&#8217;t mind him copying my work.&#8221;<\/p>\n<p>89. <strong>Ubiquitous<\/strong><\/p>\n<p>Anything that is everywhere to be found or seems to be so is &#8220;ubiquitous.&#8221; &#8220;Text speak is becoming so ubiquitous that it may soon be accepted in business letters.&#8221;<\/p>\n<p>90. <strong>Umami<\/strong><\/p>\n<p>Your tongue can identify a number of flavors. Umami is a meaty flavor that is not sweet, sour, or salty.<\/p>\n<p>91. <strong>Vernacular<\/strong><\/p>\n<p>The language you speak at home, or the one spoken by a specific group of people in a country or region is its vernacular language. It also refers to architecture that focuses on what is functional.<\/p>\n<p>92. <strong>Verisimilitude<\/strong><\/p>\n<p>Is something real? Is it true? Are you unsure? Then you are doubting its verisimilitude. This word is handy because it combines the concepts of truth and reality.<\/p>\n<p>93. <strong>Vitriolic<\/strong><\/p>\n<p>When people are vitriolic, I either find it very funny (which they don&#8217;t intend) or annoying. Vitriolic speech or writing is bitter, caustic and acerbic.<\/p>\n<p>94. <strong>Ultracrepidarian<\/strong><\/p>\n<p>Do you know someone who always has advice for you no matter how little knowledge he or she has? Now you have the right word to describe this person!<\/p>\n<p>95. <strong>Unctuous<\/strong><\/p>\n<p>It&#8217;s usually very nice when people admire you, but sometimes you get the feeling that a person is being oily or insincere, and just wants to get into your good books. When this happens, you have just been the object of unctuous behavior.<\/p>\n<p>96. <strong>Uxorious<\/strong><\/p>\n<p>When a man is overly submissive towards his wife, he can be described as &#8220;uxorious.&#8221; Of course, she might just say that&#8217;s just how it should be!<\/p>\n<p>97. <strong>Vacuity<\/strong><\/p>\n<p>&#8220;I admire your vacuity,&#8221; he said. &#8220;Why, thank you,&#8221; she replied, proving the point. Vacuity is empty-headedness and a lack of intelligence.<\/p>\n<p>98. <strong>Xeric<\/strong><\/p>\n<p>Generally, when we see the prefix &#8220;Xero&#8221; or &#8220;Xer&#8221; we can associate the word that it introduces with something very dry. A xeric life form can tolerate, and even prefers very dry conditions, and a xerophyte, is a plant that tolerates extremely dry environments.<\/p>\n<p>99. <strong>Zymurgy<\/strong><\/p>\n<p>This is a very helpful scrabble word, but what does it mean? Zymurgy is the art of brewing, wine-making or distilling.<\/p>\n<p>100. <strong>Zephyr<\/strong><\/p>\n<p>A zephyr is a pleasant, light breeze that you&#8217;d welcome on a hot summer day. &#8220;A passing zephyr rustled through the treetops.&#8221; Ah! Poetic!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As an adult English speaker, you&#8217;re expected to have an extensive vocabulary that includes some words that are seldom used in conversational English. You should also be striving to improve your vocabulary. While all these lists are somewhat subjective, they&#8217;re a good way to see how good your current vocabulary happens to be, and work &hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[840,837,842,838,841,839],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>100 Words You Should Know - Word Counter Blog<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"100 Words You Should Know - Word Counter Blog\" \/>\n<meta property=\"og:description\" content=\"As an adult English speaker, you&#8217;re expected to have an extensive vocabulary that includes some words that are seldom used in conversational English. You should also be striving to improve your vocabulary. While all these lists are somewhat subjective, they&#8217;re a good way to see how good your current vocabulary happens to be, and work &hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html\" \/>\n<meta property=\"og:site_name\" content=\"Word Counter Blog\" \/>\n<meta property=\"article:published_time\" content=\"2016-12-19T14:42:56+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2017-01-01T19:20:14+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/adult-words-550x287.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"19 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\",\"url\":\"https:\/\/wordcounter.net\/blog\/\",\"name\":\"Word Counter Blog\",\"description\":\"Because words count\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/wordcounter.net\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html#primaryimage\",\"url\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/adult-words.jpg\",\"contentUrl\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/adult-words.jpg\",\"width\":1200,\"height\":628,\"caption\":\"words you should know\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html#webpage\",\"url\":\"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html\",\"name\":\"100 Words You Should Know - Word Counter Blog\",\"isPartOf\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html#primaryimage\"},\"datePublished\":\"2016-12-19T14:42:56+00:00\",\"dateModified\":\"2017-01-01T19:20:14+00:00\",\"author\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\"},\"breadcrumb\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/wordcounter.net\/blog\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"100 Words You Should Know\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\",\"name\":\"admin\",\"url\":\"https:\/\/wordcounter.net\/blog\/author\/admin\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"100 Words You Should Know - Word Counter Blog","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html","og_locale":"en_US","og_type":"article","og_title":"100 Words You Should Know - Word Counter Blog","og_description":"As an adult English speaker, you&#8217;re expected to have an extensive vocabulary that includes some words that are seldom used in conversational English. You should also be striving to improve your vocabulary. While all these lists are somewhat subjective, they&#8217;re a good way to see how good your current vocabulary happens to be, and work &hellip;","og_url":"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html","og_site_name":"Word Counter Blog","article_published_time":"2016-12-19T14:42:56+00:00","article_modified_time":"2017-01-01T19:20:14+00:00","og_image":[{"url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/adult-words-550x287.jpg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"19 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/wordcounter.net\/blog\/#website","url":"https:\/\/wordcounter.net\/blog\/","name":"Word Counter Blog","description":"Because words count","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/wordcounter.net\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html#primaryimage","url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/adult-words.jpg","contentUrl":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2016\/12\/adult-words.jpg","width":1200,"height":628,"caption":"words you should know"},{"@type":"WebPage","@id":"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html#webpage","url":"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html","name":"100 Words You Should Know - Word Counter Blog","isPartOf":{"@id":"https:\/\/wordcounter.net\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html#primaryimage"},"datePublished":"2016-12-19T14:42:56+00:00","dateModified":"2017-01-01T19:20:14+00:00","author":{"@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef"},"breadcrumb":{"@id":"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/wordcounter.net\/blog\/2016\/12\/19\/102744_words-you-should-know.html#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/wordcounter.net\/blog"},{"@type":"ListItem","position":2,"name":"100 Words You Should Know"}]},{"@type":"Person","@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef","name":"admin","url":"https:\/\/wordcounter.net\/blog\/author\/admin"}]}},"_links":{"self":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/2744"}],"collection":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/comments?post=2744"}],"version-history":[{"count":9,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/2744\/revisions"}],"predecessor-version":[{"id":2844,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/2744\/revisions\/2844"}],"wp:attachment":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/media?parent=2744"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/categories?post=2744"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/tags?post=2744"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}