{"id":3207,"date":"2017-12-04T07:47:55","date_gmt":"2017-12-04T15:47:55","guid":{"rendered":"https:\/\/wordcounter.net\/blog\/?p=3207"},"modified":"2017-12-04T07:47:55","modified_gmt":"2017-12-04T15:47:55","slug":"the-daily-word-counts-of-19-famous-writers","status":"publish","type":"post","link":"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html","title":{"rendered":"The Daily Word Counts of 19 Famous Writers"},"content":{"rendered":"<p>Aspiring writers often have quite a few questions wondering if they are doing everything correctly. Should they sign up for some sort of class on writing to get experience? Do they need a mentor that will guide them along the way? Is it true they have to starve first by giving up their job so they can focus on only writing? But the truth of the matter is, what may work for one writer may not work for another.<\/p>\n<p>The most difficult thing facing an aspiring writer is to take time out of each and every day to practice their craft. In truth, you are either an aspiring writer or a writer. If all you do is talk about wanting to write a book, then you are an aspiring writer. If you are actively writing each and every week, then you are already a writer! When it comes down to it, aspiring writers talk the talk, but writers walk the walk.<\/p>\n<p>Which leads to one of the most asked questions by writers or aspiring writers. How much should I write every day? There is such a thing as quality over quantity though. But by realizing the daily word count that successful writers write, it should provide a good estimate on what you should be achieving. And I am speaking about the daily word count for the book that you are writing, not anything else.<\/p>\n<p>Many people, unfortunately, write thousands of words on their social media accounts during the day. They write about their daily schedule, what they had to eat recently, or their personal views on the most recent topics. If you are truly a writer, do yourself a favor and stay off of social media as much as you can and focus on your writing project. When you finally complete your book, I guarantee that you will not say to yourself, “I sure wish I would have posted more on Facebook instead to keep everyone up to date on the mundane things of my life.”<\/p>\n<p><strong>Daily Word Counts<\/strong><br \/>\nAs you will notice from reading the list below, daily word counts vary greatly from one successful writer to the next. In addition, these are all authors that make their living by writing. They don’t have a forty hour a week job to go to either. But if you have been writing for awhile now and know your approximate daily word count, it might compare quite favorably with these famous authors!<\/p>\n<h2>Ernest Hemingway: 500 Words<\/h2>\n<p>Of course, Hemingway is no longer alive, but when he was he would stick around writing about 500 words a day. “When I am working on a book or a story I write every morning as soon after first light as possible. You have started at six in the morning, say, and may go on until noon or be through before that,” Hemingway said.<\/p>\n<h2>Stephen King: 2,000 Words<\/h2>\n<p>Stephen King seems to be one of the most prolific writers of all time. His novels can be extremely long and wordy, so one would think he would write an immense amount of words daily. However, this is not always the case.<\/p>\n<p>In his book On Writing: A Memoir of the Craft, King speaks on his writing speed. He would set a daily goal of about 2,000 words. This would add up to about 180,000 words in three months of writing. He also said that three months was the maximum amount of time it should take someone to finish a first draft. If it takes longer, it will get tougher and tougher to delve back into the story with the right frame of mind. In addition, King can often become involved in marathon writing sessions. He wrote The Running Man in one week.<\/p>\n<h2>Jack London: 1,500 Words<\/h2>\n<p>Jack London’s most well known novel, The Call of the Wild, was a classic. He probably had a few more in him, but he died at the age of forty. “You can’t wait for inspiration. You have to go after it with a club,” he stated.<\/p>\n<h2>Tom Wolfe: 135 Words<\/h2>\n<p>Tom Wolfe is an author that has written many popular books that were later made into films. The Right Stuff and The Bonfire of the Vanities are just a couple. However, he never seemed to be in a rush to finish his books. His book A Man in Full is 370,000 words and it took him eleven years to finish. “My children grew up thinking that was all I did: write, and never finish, a book called A Man in Full,” Wolfe admitted.<\/p>\n<h2>Mark Twain: 1,400-1,800 Words<\/h2>\n<p>If there was a Mount Rushmore for writers, Mark Twain would definitely be on it. But he realized that sometime it depended on the location of where you are actually doing the writing. “In 1897, when we were living in Tedworth Square, London, and I was writing the book called “Following the Equator” my average was eighteen hundred words a day; here in Florence, (1904), my average seems to be fourteen hundred words per sitting of four or five hours.”<\/p>\n<h2>W. Somerset Maugham: 1,000 Words<\/h2>\n<p>W. Somerset Maugham was a British playwright, novelist, and short story author. He was among the most popular writers of his era and was also reportedly the highest-paid author during the 1930s. He was an orphan by the time he turned ten years old and was raised by an uncle that did his best to make into an accountant. Maugham persevered through life and wrote some quality classics. But he even recognized there was no set formula on writing. “There are three rules for writing a novel,” he said. “Unfortunately, no one knows what they are.”<\/p>\n<h2>Sarah Waters: 1,000 Words<\/h2>\n<p>Sarah Waters is a Welsh novelist and bestselling author. She has written six novels to date with many of them being turned into films. Still, she feels the same way a lot of writers do when sitting down to write everyday. “My minimum is 1,000 words a day… Those 1,000 words might well be rubbish- they often are. But then, it is always easier to return to rubbish words at a later date and make them better,” Waters said.<\/p>\n<h2>Sebastian Faulks: 1,000 Words<\/h2>\n<p>Sebastian Faulks is a British novelist, journalist, and broadcaster. He is perhaps best known for his historical novels that are set in France. Faulks believes in consistency when working. “When I am writing a book I write from ten til six everyday in a small office near my house,” he said. “I never write less than a 1000 words a day. Writer’s Block is God’s way of telling you to shut up. More people should have it.”<\/p>\n<h2>Michael Crichton: 10,000 Words<\/h2>\n<p>Michael Crichton wrote several novels that were later turned into films. Jurassic Park was just one of the popular ones. Crichton passed away almost ten years ago, but he was an American author, screenwriter, film director, and producer that did very well in the genres of science fiction and thrillers. Also, his daily word count was always extremely high. “Books aren&#8217;t written &#8211; they&#8217;re rewritten,” he said. “Including your own. It is one of the hardest things to accept, especially after the seventh rewrite hasn&#8217;t quite done it.”<\/p>\n<h2>Kate DiCamillo: 600-900 Words<\/h2>\n<p>Kate DiCamillo is an American writer of children&#8217;s fiction that has written several modern day classics. Because of Winn-Dixie, The Tale of Despereaux, and Flora &amp; Ulysses are merely a few. She is also one of six people to win two Newbery Medals recognizing her work. &#8220;My goal is two pages a day, five days a week. I never want to write, but I&#8217;m always glad that I have done it,” DiCamillo said. I think many writers know exactly what she means by this.<\/p>\n<h2>Nicholas Sparks: 2,000 Words<\/h2>\n<p>Nicholas Sparks is an American romance novelist, screenwriter, and producer. His books and films all follow a bit of the same pattern with a woman meeting a new man, and the women that read his books and watch his movies just love it. He has published nineteen novels to date. Sparks says a novel takes him a few months to conceive, and then about five months to write. He sets a daily goal for himself of 2,000 words which takes him about five to six hours to write. “See,” he said, “it’s not an unbelievable pace.”<\/p>\n<h2>J.G. Ballard: 1,000 Words<\/h2>\n<p>James Ballard was an English novelist and short story writer who passed away in 2009. He said, “All through my career I’ve written 1,000 words a day- even if I’ve got a hangover. You’ve got to discipline yourself if you’re professional. There’s no other way.”<\/p>\n<h2>Ian McEwan: 600 Words<\/h2>\n<p>Ian McEwan is an English novelist and screenwriter that has attained the recognition that most writers dream about. In 2008, The Times featured him on their list of &#8220;The 50 greatest British writers since 1945&#8221; and The Daily Telegraph ranked him number 19 in their list of the &#8220;100 most powerful people in British culture&#8221;. Not too shabby. “I aim for about six hundred words a day and hope for at least a thousand when I’m on a roll,” he once said.<\/p>\n<h2>Lee Child: 1,800 Words<\/h2>\n<p>Lee Child is a British author who is best known for his Jack Reacher novels that have been made into films starring Tom Cruise. “I write in the afternoon, from about 12 until about 6 or 7,” he said. “I use an upstairs room as my office. Once I get going I keep at it, and it usually takes about six months from the first blank screen until the end.”<\/p>\n<h2>Anne Rice: 3,000 Words<\/h2>\n<p>Anne Rice is an American author from New Orleans that writes quite a bit of gothic fiction. She is best known for her vampire novels and the film Interview with a Vampire. “I have to get all distractions out of the way,” she says. “I plunge into the work and write an episode; I can’t just clock in at 3,000 words. I have to have time free to resolve things. I write in episodic ways. But when I’m ready to plunge in, I write from late morning through all afternoon, all evening.”<\/p>\n<h2>Arthur Conan Doyle: 3,000 Words<\/h2>\n<p>Arthur Conan Doyle is best known for his novels starring Sherlock Holmes, probably the most popular fictional detective of all time. He wrote sixty stories about the legendary sleuth. “Anything is better than stagnation,” he said.<\/p>\n<h2>Arthur Hailey: 600 Words<\/h2>\n<p>Arthur Hailey died in 2004, but before his time was up he had written many novels that had a backdrop of several industries. One of his more popular ones that was later made into a movie was Airport. “I set myself 600 words a day as a minimum output, regardless of the weather, my state of mind or if I’m sick or well,” he had said. “There must be 600 finished words- not almost right words.”<\/p>\n<h2>Graham Greene: 500 Words<\/h2>\n<p>Graham Greene was an English novelist regarded by many as one of the great writers of the 20th century. He wrote highly acclaimed serious Catholic novels and thrillers. Greene came close to winning the Nobel Prize for Literature in back to back years in 1966 and 1967. He passed away in 1991, but through his 67 years of writing he had completed 25 novels. “Over twenty years I have probably averaged five hundred words a day for five days a week. I can produce a novel in a year, and that allows time for revision and the correction of the typescript. I have always been very methodical, and when my quota of work is done I break off, even in the middle of a scene,” he said.<\/p>\n<h2>Holly Black: 1,000 Words<\/h2>\n<p>Holly Black is an American writer best known for The Spiderwick Chronicles, a series of children&#8217;s fantasy books she created with writer and illustrator Tony DiTerlizzi. She also has written a trilogy of young adult novels officially called the Modern Faerie Tales trilogy. Black perhaps summarizes the feeling of every writer when she responded back to a compliment about how productive she has been with all her novels. “First of all, thank you very much for saying I’m productive, because some days I don’t feel that way,” she said. “Yes, I try to write a thousand words every day. I’ve actually put up my daily word counts online for my last several novels. I do this to keep myself honest, saying exactly when I wrote what part of the book. Certainly the comment I most often get is, “That’s not really a lot of words,” but it goes to show that just steadily working will get you a book. I try to make a thousand words a day, but that isn’t always the reality.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Aspiring writers often have quite a few questions wondering if they are doing everything correctly. Should they sign up for some sort of class on writing to get experience? Do they need a mentor that will guide them along the way? Is it true they have to starve first by giving up their job so &hellip;<\/p>\n","protected":false},"author":7,"featured_media":3210,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Daily Word Counts of 19 Famous Writers - Word Counter Blog<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Daily Word Counts of 19 Famous Writers - Word Counter Blog\" \/>\n<meta property=\"og:description\" content=\"Aspiring writers often have quite a few questions wondering if they are doing everything correctly. Should they sign up for some sort of class on writing to get experience? Do they need a mentor that will guide them along the way? Is it true they have to starve first by giving up their job so &hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html\" \/>\n<meta property=\"og:site_name\" content=\"Word Counter Blog\" \/>\n<meta property=\"article:published_time\" content=\"2017-12-04T15:47:55+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/12\/word-count.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"960\" \/>\n\t<meta property=\"og:image:height\" content=\"540\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Ryan Crawley\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\",\"url\":\"https:\/\/wordcounter.net\/blog\/\",\"name\":\"Word Counter Blog\",\"description\":\"Because words count\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/wordcounter.net\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html#primaryimage\",\"url\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/12\/word-count.jpg\",\"contentUrl\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/12\/word-count.jpg\",\"width\":960,\"height\":540},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html#webpage\",\"url\":\"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html\",\"name\":\"The Daily Word Counts of 19 Famous Writers - Word Counter Blog\",\"isPartOf\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html#primaryimage\"},\"datePublished\":\"2017-12-04T15:47:55+00:00\",\"dateModified\":\"2017-12-04T15:47:55+00:00\",\"author\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7226ef5451f51e29ee0ddbc5b4163218\"},\"breadcrumb\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/wordcounter.net\/blog\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The Daily Word Counts of 19 Famous Writers\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7226ef5451f51e29ee0ddbc5b4163218\",\"name\":\"Ryan Crawley\",\"url\":\"https:\/\/wordcounter.net\/blog\/author\/ryanc\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The Daily Word Counts of 19 Famous Writers - Word Counter Blog","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html","og_locale":"en_US","og_type":"article","og_title":"The Daily Word Counts of 19 Famous Writers - Word Counter Blog","og_description":"Aspiring writers often have quite a few questions wondering if they are doing everything correctly. Should they sign up for some sort of class on writing to get experience? Do they need a mentor that will guide them along the way? Is it true they have to starve first by giving up their job so &hellip;","og_url":"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html","og_site_name":"Word Counter Blog","article_published_time":"2017-12-04T15:47:55+00:00","og_image":[{"width":960,"height":540,"url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/12\/word-count.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"Ryan Crawley","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/wordcounter.net\/blog\/#website","url":"https:\/\/wordcounter.net\/blog\/","name":"Word Counter Blog","description":"Because words count","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/wordcounter.net\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html#primaryimage","url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/12\/word-count.jpg","contentUrl":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/12\/word-count.jpg","width":960,"height":540},{"@type":"WebPage","@id":"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html#webpage","url":"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html","name":"The Daily Word Counts of 19 Famous Writers - Word Counter Blog","isPartOf":{"@id":"https:\/\/wordcounter.net\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html#primaryimage"},"datePublished":"2017-12-04T15:47:55+00:00","dateModified":"2017-12-04T15:47:55+00:00","author":{"@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7226ef5451f51e29ee0ddbc5b4163218"},"breadcrumb":{"@id":"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/wordcounter.net\/blog\/2017\/12\/04\/103207_the-daily-word-counts-of-19-famous-writers.html#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/wordcounter.net\/blog"},{"@type":"ListItem","position":2,"name":"The Daily Word Counts of 19 Famous Writers"}]},{"@type":"Person","@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7226ef5451f51e29ee0ddbc5b4163218","name":"Ryan Crawley","url":"https:\/\/wordcounter.net\/blog\/author\/ryanc"}]}},"_links":{"self":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/3207"}],"collection":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/comments?post=3207"}],"version-history":[{"count":4,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/3207\/revisions"}],"predecessor-version":[{"id":3214,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/3207\/revisions\/3214"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/media\/3210"}],"wp:attachment":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/media?parent=3207"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/categories?post=3207"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/tags?post=3207"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}