{"id":5,"date":"2014-05-09T10:38:27","date_gmt":"2014-05-09T17:38:27","guid":{"rendered":"http:\/\/www.wordcounter.net\/blog\/?p=5"},"modified":"2015-07-02T10:42:40","modified_gmt":"2015-07-02T17:42:40","slug":"make-money-writing","status":"publish","type":"post","link":"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html","title":{"rendered":"40 Ways to Make Money as a Writer"},"content":{"rendered":"<p><center><a href=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/05\/make-money-writing.jpg\"><img loading=\"lazy\" src=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/05\/make-money-writing-550x412.jpg\" alt=\"make money writing\" width=\"550\" height=\"412\" class=\"alignnone size-medium wp-image-169\" srcset=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/05\/make-money-writing-550x412.jpg 550w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/05\/make-money-writing-700x525.jpg 700w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/05\/make-money-writing-624x468.jpg 624w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/05\/make-money-writing.jpg 720w\" sizes=\"(max-width: 550px) 100vw, 550px\" \/><\/a><\/center><\/p>\n<p>When people think of someone as being a writer they often think in terms of books. Fiction, non-fiction, memoir, and scholarly books all come to mind as &#8220;writerly&#8221; pursuits. And certainly books are a noble goal and worth writing if that&#8217;s what you want to do. However, there are many more ways to make money as a writer. In fact, there are so many ways to make money writing that it&#8217;s possible to make a <a href=\"https:\/\/wordcounter.net\/blog\/2014\/04\/its-okay-to-be-a-writing-sellout\/\">very good income<\/a> as a writer without ever penning a single book. Here are forty ideas to get you started.<\/p>\n<h2>Blogging<\/h2>\n<p>It seems like everyone has a blog these days, but there is still room for well-crafted blogs that serve their readers with useful, unique, and timely information. If you don&#8217;t want to start your own blog, you may be able to write for someone else or sell yourself as a guest poster to several different blogs. It&#8217;s also important to remember that a lot of blogging these days is <a href=\"https:\/\/wordcounter.net\/blog\/2014\/04\/46-ways-to-promote-your-writing\/\">promoting yourself<\/a>.<\/p>\n<h2>Greeting Cards<\/h2>\n<p>You can get paid to craft those pithy sayings inside the cards.<\/p>\n<h2>Magazine Articles<\/h2>\n<p>Print magazines aren&#8217;t dead and there are thousands of them out there for just about every interest, hobby, and demographic.<\/p>\n<h2>Scholarly Publishing<\/h2>\n<p>If you have academic credentials or want to boost your credibility within the academic community, you might look into writing for scholarly journals in your field, or publishing books with an academic press. If you don&#8217;t want to enter the market under your own name, plenty of academics need help with their articles, books, dissertations, and course materials.<\/p>\n<h2>E-Books\/Self-Publishing<\/h2>\n<p>It&#8217;s easier than ever for an author to self-publish their books, either electronically or in print. The positives are that you retain control of all of the content and any income you generate is yours to keep (after taxes, of course). The negatives are that you are responsible for all of the marketing of your book, as well as any expenses incurred to publish it.<\/p>\n<h2>Traditional Publishing<\/h2>\n<p>Some consider having a book accepted by a traditional print publisher to be the &#8220;holy grail&#8221; of writing. However, you will likely have to compromise on some of your content and you will still have to do a lot of your own marketing and publicity. Your publisher may also not give you a large advance and your royalties may not match your dreams.<\/p>\n<h2>Textbooks<\/h2>\n<p>You can either write whole books (see scholarly publishing, above), or write individual sections. Many publishers hire writers on staff or on a freelance basis to write sections of textbooks.<\/p>\n<h2>Technical Writing<\/h2>\n<p>Online help, user manuals, training manuals, scientific documents, research notes, and other forms of documentation fall under the heading of &#8220;technical writing.&#8221; It can be dry, but lucrative. Experience in the field about which you are writing is often helpful, but may not be required.<\/p>\n<h2>Marketing Copy<\/h2>\n<p>Businesses have to move their products and advertise themselves. They need writers to write brochures, advertisements, catalog copy, slogans, marketing emails, and direct mail pieces.<\/p>\n<h2>Poetry<\/h2>\n<p>While not (generally) a huge money-maker, poets can publish their own collections, or publish individual poems in anthologies or magazines. Also, poets may find work in the greeting card and lyricist markets.<\/p>\n<h2>Contests<\/h2>\n<p>There are contests for almost every form of writing and many offer cash prizes. You might not be able to make a living from contests alone, but the recognition you get from winning can open up additional opportunities for you.<\/p>\n<h2>Teaching<\/h2>\n<p>Many people need to learn how to be better writers. You can teach at workshops, through community education classes and private tutoring, at corporations and corporate retreats, in job training programs, and even in prisons. It&#8217;s not true that those who can&#8217;t do teach. Many writers supplement their incomes through training and teaching programs.<\/p>\n<h2>Content Mills<\/h2>\n<p>These are companies that rely on a small army of freelancers to churn out online content that will result in huge numbers of hits for the company, thus bringing in revenue through advertising. Pay is usually dismal, creativity and lovely prose are sacrificed in favor of search engine optimization, and the clips you get from working there may or may not net you additional opportunities, as more &#8220;serious&#8221; markets sometimes look down on content mills. Only you can decide whether or not a content mill is for you.<\/p>\n<h2>Ghostwriting<\/h2>\n<p>Some people have stories to tell, but not a writerly bone in their body. You get paid to tell the story, but you will receive no byline or credit for the work. It can be lucrative, but contractual limitations may prevent you from cashing in on the work should the book become a bestseller.<\/p>\n<h2>Short Stories<\/h2>\n<p>You may be able to have several published in book form, but the larger markets for stories tend to be magazines or niche websites.<\/p>\n<h2>Newspaper Reporter\/Columnist\/Editorials<\/h2>\n<p>Print journalism isn&#8217;t dead, yet. There are still openings for reporters and columnists. You might have the best luck breaking in at your local paper, rather than going straight for the state or national papers.<\/p>\n<h2>Script Writing<\/h2>\n<p>Sure, everyone wants to pen a movie, but scripts are also required in television, advertising, and in the corporate world.<\/p>\n<h2>Write the News for TV<\/h2>\n<p>You can write the news bits that the newscasters will read off the TelePrompTer.<\/p>\n<h2>Articles for Trade Publications<\/h2>\n<p>Sure, the big glossy magazines are a dream market, but steady, well paying work can be found writing for trade publications. These are the magazines that cover such exciting topics like plumbing, landscaping, and fish pond management, among many others. They need content, too.<\/p>\n<h2>Grant Writing<\/h2>\n<p>Helping other people secure money can be very lucrative. There is an art to grant writing, however, and you need to learn how successful grant proposals are crafted before you can expect to succeed in this market.<\/p>\n<h2>Travel\/Tourism\/Chamber of Commerce Publications<\/h2>\n<p>All of those brochures in the visitor&#8217;s center, the articles in the coupon books you find in the hotel lobby, and local magazines need writers. You can also write for the glossy travel magazines, but you&#8217;ll have a better chance getting in if you&#8217;ve perfected your craft at the local level.<\/p>\n<h2>Newsletters<\/h2>\n<p>Churches, businesses, neighborhood groups, and many other organizations publish newsletters. Some keep writers on staff, but many hire freelancers or talented members of the organization.<\/p>\n<h2>Press Releases<\/h2>\n<p>When a business or government organization has something to say to the public, they don&#8217;t just blurt it out. They craft a carefully worded press release that casts them and the issue or product in the best light. If you can make anything sound wonderful, you&#8217;ll likely succeed here.<\/p>\n<h2>Corporate Writing<\/h2>\n<p>Annual reports, business plans, legal documents (if you have that background), internal newsletters, catalogs, training manuals and scripts, and presentation scripts are some examples of the writing types that businesses need. Some businesses have dedicated writers and others hire on a freelance basis.<\/p>\n<h2>Government Work<\/h2>\n<p>Legislative agendas, new laws, requests for proposals, reports, meeting notes, and distilling scientific or other research into language that can be understood by the public and elected officials are all government writing jobs. Some are hired for a specific department, others work state or countywide. Small towns and counties may hire freelancers to do their writing for them.<\/p>\n<h2>Book Doctor<\/h2>\n<p>Alas, someone has written a book and it&#8217;s terrible. But they won&#8217;t give up the dream of seeing it in print. You could be hired to resuscitate the book (which may mean anything from a little editing to a full blown do-over or ghostwriter gig). You may also help the author find an agent or publisher, or help with their self-publishing plan. You&#8217;ll have the satisfaction of seeing the project live on, but you won&#8217;t get the joy of a byline.<\/p>\n<h2>Children&#8217;s Markets<\/h2>\n<p>Kids have more of a place in the world today than they used to. There are many magazines for children and teens, as well as a booming Young Adult market for books. Many corporations also hire people to write marketing and advertising copy that appeals to teens and kids. Writers are needed for kid&#8217;s TV programs, educational books, and games, as well.<\/p>\n<h2>Video Game Writer<\/h2>\n<p>Sure, the programmers make the characters appear on the screen, but it&#8217;s often writers who put together the story lines and dialogue for those games. They also write the manuals.<\/p>\n<h2>Resume Writer<\/h2>\n<p>You can help job candidates stand out by crafting a well-written resume that presents their skills in a readable, professional format.<\/p>\n<h2>Speaking<\/h2>\n<p>If your writing has qualified you as an expert on anything, you can turn that into extra income by giving talks or seminars about your areas of expertise.<\/p>\n<h2>Eulogies and Obituaries<\/h2>\n<p>It sounds morbid, but people will pay to make sure their loved one, corporate chief, or political ally gets a proper send off.<\/p>\n<h2>Humor<\/h2>\n<p>Joke books, humorous memoirs, funny advice books, captions for cartoons, funny bumper stickers, scripts for comedians, and poster captions are writing types where a good sense of humor is required. All of those things you see around town that make you chuckle were written by someone.<\/p>\n<h2>Editing and Proofreading<\/h2>\n<p>While not &#8220;writing&#8221; per se, this can be a great way to earn a little extra on the side.<\/p>\n<h2>Lyricist<\/h2>\n<p>If you have a musical bent, you can write for musicians and corporations. Sometimes they have no trouble getting the notes right, but they can&#8217;t write a decent lyric or jingle.<\/p>\n<h2>Web Copy<\/h2>\n<p>Sometimes this is synonymous with marketing copy or blogging, but there are people and companies who need writers to write the various sections of their websites. Those &#8220;About Us,&#8221; &#8220;Corporate History,&#8221; &#8220;Employee Profile,&#8221; and product pages get written by someone.<\/p>\n<h2>Reviewer<\/h2>\n<p>Books, movies, and products all get reviewed on websites, in magazines, and on TV shows. If you have a knack for criticism, you can make a living as a reviewer.<\/p>\n<h2>Domain Name Writer<\/h2>\n<p>People will pay you to come up with a great domain name. It&#8217;s not as easy as it sounds since, at this point, all of the common names have been snatched up.<\/p>\n<h2>Translator<\/h2>\n<p>If you&#8217;re fluent in another language, you can make a living translating books and articles. It may not be writing your own stuff, but often some editing and rewriting is required to make the translation read correctly.<\/p>\n<h2>Speech Writer<\/h2>\n<p>Many business people, politicians, and activists don&#8217;t write their own speeches. A gifted orator is not necessarily a gifted writer and vice-versa.<\/p>\n<h2>Online Articles<\/h2>\n<p>If you don&#8217;t want to work for a content mill, a blog, or the Internet site of a print magazine, there are still plenty of places online that need content. There are some web-only &#8220;magazines&#8221; that cover a variety of issues, and there are plenty of niche sites. Some businesses also post articles related to what they do or sell.<\/p>\n<h2>Social Media Writer<\/h2>\n<p>There are businesses that are (or need to be) on social media, but have no clue how to go about it or what to say. They need someone who can write Tweets that make sense, or Facebook postings that attract potential clients. This might be the province of someone in marketing, but some businesses have created dedicated social medial jobs, or you might be able to offer yourself up as a freelancer.<\/p>\n<p>Writing skills are valuable. Everything you see around you that has words on it was written by someone. That means that whatever you&#8217;re looking at could be a potential market for you. The good news is that while some markets require a large number of clips or a solid portfolio of work, many are open to beginners. Especially local, community publications and organizations. They may not pay much, but you can get in, build up your reputation, and network your way to higher paying opportunities. If you can write well, doors will open.<\/p>\n<p>Even better, you can do several types of writing at once. You can be both a technical writer and a marketing writer, if you want. That way, if one market temporarily slows down, you have others to fall back on. The more types of writing you can offer clients, the higher your income is likely to go.<\/p>\n<p>And here&#8217;s a final piece of advice: Don&#8217;t get hung up on the idea that you&#8217;re not a writer if you haven&#8217;t published a book. I used to hem and haw whenever someone asked me, &#8220;What do you do?&#8221; because I didn&#8217;t want to say, &#8220;I&#8217;m a writer.&#8221; It seemed as though I couldn&#8217;t claim that title if I hadn&#8217;t written a book. Fortunately, I got over it. I write many different types of articles and manuals. I put my rear end in the chair every day and write something for someone. And I get paid for it. If that doesn&#8217;t make me a writer, I don&#8217;t know what does. So now, when someone asks, &#8220;What do you do?&#8221; I proudly say, &#8220;I&#8217;m a writer.&#8221;<\/p>\n<p>(Photo courtesy of <a href=\"https:\/\/www.flickr.com\/photos\/anotherphotograph\/2812844303\/\">Tony Hall<\/a>)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When people think of someone as being a writer they often think in terms of books. Fiction, non-fiction, memoir, and scholarly books all come to mind as &#8220;writerly&#8221; pursuits. And certainly books are a noble goal and worth writing if that&#8217;s what you want to do. However, there are many more ways to make money &hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[88,90,89,91,93,94,95,92],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>40 Ways to Make Money as a Writer - Word Counter Blog<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"40 Ways to Make Money as a Writer - Word Counter Blog\" \/>\n<meta property=\"og:description\" content=\"When people think of someone as being a writer they often think in terms of books. Fiction, non-fiction, memoir, and scholarly books all come to mind as &#8220;writerly&#8221; pursuits. And certainly books are a noble goal and worth writing if that&#8217;s what you want to do. However, there are many more ways to make money &hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html\" \/>\n<meta property=\"og:site_name\" content=\"Word Counter Blog\" \/>\n<meta property=\"article:published_time\" content=\"2014-05-09T17:38:27+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-07-02T17:42:40+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/05\/make-money-writing-550x412.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\",\"url\":\"https:\/\/wordcounter.net\/blog\/\",\"name\":\"Word Counter Blog\",\"description\":\"Because words count\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/wordcounter.net\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html#primaryimage\",\"url\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/05\/make-money-writing.jpg\",\"contentUrl\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/05\/make-money-writing.jpg\",\"width\":720,\"height\":540},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html#webpage\",\"url\":\"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html\",\"name\":\"40 Ways to Make Money as a Writer - Word Counter Blog\",\"isPartOf\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html#primaryimage\"},\"datePublished\":\"2014-05-09T17:38:27+00:00\",\"dateModified\":\"2015-07-02T17:42:40+00:00\",\"author\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\"},\"breadcrumb\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/wordcounter.net\/blog\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"40 Ways to Make Money as a Writer\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\",\"name\":\"admin\",\"url\":\"https:\/\/wordcounter.net\/blog\/author\/admin\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"40 Ways to Make Money as a Writer - Word Counter Blog","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html","og_locale":"en_US","og_type":"article","og_title":"40 Ways to Make Money as a Writer - Word Counter Blog","og_description":"When people think of someone as being a writer they often think in terms of books. Fiction, non-fiction, memoir, and scholarly books all come to mind as &#8220;writerly&#8221; pursuits. And certainly books are a noble goal and worth writing if that&#8217;s what you want to do. However, there are many more ways to make money &hellip;","og_url":"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html","og_site_name":"Word Counter Blog","article_published_time":"2014-05-09T17:38:27+00:00","article_modified_time":"2015-07-02T17:42:40+00:00","og_image":[{"url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/05\/make-money-writing-550x412.jpg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/wordcounter.net\/blog\/#website","url":"https:\/\/wordcounter.net\/blog\/","name":"Word Counter Blog","description":"Because words count","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/wordcounter.net\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html#primaryimage","url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/05\/make-money-writing.jpg","contentUrl":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/05\/make-money-writing.jpg","width":720,"height":540},{"@type":"WebPage","@id":"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html#webpage","url":"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html","name":"40 Ways to Make Money as a Writer - Word Counter Blog","isPartOf":{"@id":"https:\/\/wordcounter.net\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html#primaryimage"},"datePublished":"2014-05-09T17:38:27+00:00","dateModified":"2015-07-02T17:42:40+00:00","author":{"@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef"},"breadcrumb":{"@id":"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/wordcounter.net\/blog\/2014\/05\/09\/105_make-money-writing.html#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/wordcounter.net\/blog"},{"@type":"ListItem","position":2,"name":"40 Ways to Make Money as a Writer"}]},{"@type":"Person","@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef","name":"admin","url":"https:\/\/wordcounter.net\/blog\/author\/admin"}]}},"_links":{"self":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/5"}],"collection":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/comments?post=5"}],"version-history":[{"count":9,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/5\/revisions"}],"predecessor-version":[{"id":407,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/5\/revisions\/407"}],"wp:attachment":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/media?parent=5"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/categories?post=5"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/tags?post=5"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}