{"id":25,"date":"2014-04-07T10:13:43","date_gmt":"2014-04-07T17:13:43","guid":{"rendered":"http:\/\/www.wordcounter.net\/blog\/?p=25"},"modified":"2015-07-02T10:45:04","modified_gmt":"2015-07-02T17:45:04","slug":"46-ways-to-promote-your-writing","status":"publish","type":"post","link":"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html","title":{"rendered":"46 Ways to Promote Your Writing"},"content":{"rendered":"<p><center><a href=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/04\/book-signing.jpg\"><img loading=\"lazy\" src=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/04\/book-signing-550x412.jpg\" alt=\"promoting your book and writing\" width=\"550\" height=\"412\" class=\"alignnone size-medium wp-image-118\" srcset=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/04\/book-signing-550x412.jpg 550w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/04\/book-signing-700x525.jpg 700w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/04\/book-signing-624x468.jpg 624w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/04\/book-signing.jpg 1024w\" sizes=\"(max-width: 550px) 100vw, 550px\" \/><\/a><\/center><\/p>\n<p>Whether your write books, articles, or keep a blog, if you want to make money you have to promote your work. Even if you are traditionally published, you&#8217;ll likely have to handle at least some of your own promotion. Publishers are cutting marketing departments and budgets and placing more responsibility on the authors themselves. (Unless you&#8217;re hugely famous or they think your book will be a huge success, in which case they will do much more for you and you can stop reading now and go take a nap.) <\/p>\n<p>For everyone else, get ready to learn how to market. Just like needing to <a href=\"https:\/\/wordcounter.net\/blog\/2014\/01\/finding-time-to-write\/\">find time to write<\/a>, you&#8217;re going to need to find time to market. Before you do anything else, though, you need to figure out who your ideal reader is and how you will reach them. It doesn&#8217;t help your cause if you&#8217;re promoting in all the wrong places. You have to use the media that your readers use. You have to go to the places where your readers go. So, if your ideal reader is a forty year-old religious mother, being a guest blogger on &#8220;Bikers, Women, and Drugs&#8221; (I made that up so if it really exists, sorry) isn&#8217;t likely to gain you the sort of exposure you need.<\/p>\n<p>Take some time and figure out who is most likely to read your work, what they want, and how you can reach them. Then figure out what on this list will help you make those ideal readers aware of your work.<\/p>\n<h2>Your blog\/website<\/h2>\n<p>Most writers need a website these days. You can post excerpts, let people know where you&#8217;ll be appearing, provide contact information, and sell books. A blog is a bonus. You can use it to keep readers updated on your work, share advice, or write about events in your field of expertise.<\/p>\n<h2>Speak<\/h2>\n<p>Non-fiction writers can speak about their topics at conferences, schools, and other gatherings. You can also speak about writing itself to writer&#8217;s groups, at libraries, or at writing conferences. When you speak, have copies of your work for sale, or at least have a handout ready listing your work and where to buy it.<\/p>\n<h2>Bookstore appearances<\/h2>\n<p>You may not be famous enough to warrant a cross-country book tour, but maybe you can appear at some local stores and sign books or do a reading.<\/p>\n<h2>Social media<\/h2>\n<p>There are so many social media sites these days that you could make a career out of doing nothing but keeping them all updated. So don&#8217;t try to do them all. Pick two or three that you like the most (and which your readers use) and stick with them. Dedicate a set amount of time each week to updating them so you don&#8217;t get caught spending more time social networking than writing.<\/p>\n<h2>Message boards<\/h2>\n<p>Find message boards that relate to your work and post helpful responses to questions. Put information about your work in your signature. Never spam a board with random links to your books, however.<\/p>\n<h2>Email signature<\/h2>\n<p>At the very least, include a link to your website and\/or social networking page. You can also put information about your latest book in your email signature.<\/p>\n<h2>Teach<\/h2>\n<p>If you&#8217;re an expert on something, see if you can teach somewhere. Community college classes, seminars, and business training sessions are all options. You can also teach your writing form or genre to writer&#8217;s groups or extension classes.<\/p>\n<h2>Go to conferences\/workshops<\/h2>\n<p>Plenty of glad-handing and business card swapping goes on at writing conferences. You can also go to business conferences and conferences related to your field of expertise. Hand out your business card and have some books in your trunk that you can sell if you generate any interest.<\/p>\n<h2>Publish<\/h2>\n<p>If you&#8217;ve written a book, try getting some articles published, as well. You can publish in magazines, newspapers, newsletters, or on other websites. Your credit at the end of the article will read something like, &#8220;Jane Doe is the author of &#8216;Title X&#8217; and resides in Michigan with her three cats.&#8221; Readers of the article will be informed about your book (and your cats).<\/p>\n<h2>Appear at related events<\/h2>\n<p>Diana Gabaldon writes the hugely successful &#8220;Outlander&#8221; series, which begins in the Scottish Highlands during the Jacobite rebellion. She frequently appears at events such as Highland games and related fairs and festivals. Successful sci-fi and fantasy writers often go to Comic-Con. If your book or work has a theme, see if there are events that are compatible at which you can appear. You may have to start small with local events rather than shooting for Comic-Con right off the bat. Figure out where your readers go and go there.<\/p>\n<h2>Leverage your biography<\/h2>\n<p>If there&#8217;s something in your life that has affected your work (perhaps you are a cancer survivor writing about cancer treatments, or you&#8217;ve suffered the traumatic loss of a spouse and you write about surviving grief), find a way to connect the two for your readers. Perhaps you appear at or contribute to charitable events related to your work. Perhaps you speak to high school kids about bullying, if that&#8217;s your topic. Make a personal connection with your readers and the cause that inspires you.<\/p>\n<h2>Schedule a virtual book tour<\/h2>\n<p>Many authors now tour virtually rather than flying around the country. It&#8217;s cheaper and less tiring. You can appear via Skype or online chat. Bloggers may take questions in advance and then post your answers at a later date.<\/p>\n<h2>Give your book away for free<\/h2>\n<p>With the rise of ebooks, it&#8217;s now possible to give your book away for free or at a greatly reduced price for a limited time. This can get your book in the hands of people who will leave positive reviews and spread word of mouth.<\/p>\n<h2>If your book is free, make sure everyone knows it<\/h2>\n<p>There are plenty of sites on the Internet that <a href=\"http:\/\/www.mediabistro.com\/galleycat\/free-ebook-promotion_b52130\">promote free ebooks<\/a>. In most cases, you don&#8217;t have to pay to be listed.<\/p>\n<h2>Get reviewed<\/h2>\n<p>Get your book into the hands of reviewers. This may mean giving away copies to bloggers, sending it to media outlets, or asking fellow authors for a brief review on their blog.<\/p>\n<h2>Create a book trailer<\/h2>\n<p>Many authors now create book trailers, similar to movie trailers, that show the highlights of the book. If you go this route, make sure it&#8217;s professionally done. A bad book trailer can be laughable and unless you&#8217;re writing humor, this isn&#8217;t what you&#8217;re going for.<\/p>\n<h2>Put together a soundtrack for your book<\/h2>\n<p>Is there music that inspired you while you wrote? Do the characters listen to certain music? Create a playlist and post it on your website. (Never post the actual songs for download. Include links to legitimate retailers where readers can buy the songs.) Readers like to listen to the music that goes with the book.<\/p>\n<h2>Get other authors to comment on your work<\/h2>\n<p>No, you might not get Stephen King to offer a blurb for your book, but you may be able to find other authors who are willing to offer comments for your book jacket or website. Be sure to return the favor if you can.<\/p>\n<h2>Press release<\/h2>\n<p>No, the New York Times might not care that you&#8217;re publishing your first book. But a local media outlet just might, particularly if your story or biography has some relevance to the local community. Create a solid press release and then get it out to media outlets that will find your story interesting and relevant to their readers.<\/p>\n<h2>Guest post on blogs<\/h2>\n<p>Find the blogs that your readers frequent and ask if you can write a guest post about the topic of interest. You won&#8217;t write about your own work, but your writing credit will read, &#8220;Jane Doe, author of XYZ.&#8221;<\/p>\n<h2>Invest in good cover art<\/h2>\n<p>It&#8217;s true that books are often judged on their covers. An easy to read cover with good artwork and pleasing graphic design sells better than one that looks cheap or like it was put together by an eighth-grader. Good cover art can be re-sized to fit and look good on everything from business cards to websites. Unless you are gifted in this area, don&#8217;t design your own cover. And don&#8217;t use cover art &#8220;generators&#8221; that allow you to select from images and fonts to put together your own cover. Too many self-published books show up with the same images on the covers and it&#8217;s confusing to readers.<\/p>\n<h2>Connect with readers<\/h2>\n<p>List your contact information on your website and in the back of your book. If readers want to ask questions, complain or comment, or schedule you for a speaking engagement, make it easy for them to do so.<\/p>\n<h2>Make it easy to find your previous work<\/h2>\n<p>If this isn&#8217;t your first book, make sure to include links or information about your previous books within the current book. You can also provide sample chapters from an earlier (or forthcoming) book to get readers interested in reading more.<\/p>\n<h2>Use book clubs<\/h2>\n<p>Submit your work to book clubs to see if they&#8217;ll feature it as their selection. You don&#8217;t have to aim for Oprah. There are plenty of local and online book clubs that might be interested. Include a discussion guide at the end of your book or as a separate document to help the club facilitate discussion.<\/p>\n<h2>Always have copies available<\/h2>\n<p>Keep copies of your book in your car so that you can give or sell one to anyone who expresses interest. If yours is an ebook, have a business card on hand with links to your website or whatever websites are selling the book. I&#8217;ve also known authors to keep USB thumb drives on hand with the book preloaded to give away. You never know when you&#8217;re going to get interest, so make sure you&#8217;re ready to capitalize on it.<\/p>\n<h2>Host a contest<\/h2>\n<p>You can not only give your book(s) away, but you can also include something else like a gift card or something related to the topic of your book. People love freebies and the chance to win something. The contest can also serve to build your email list so that you can send out newsletters or announce future releases.<\/p>\n<h2>Give away extras<\/h2>\n<p>If people buy your book by a certain date or from a certain website, or if they can provide proof of purchase, you can include freebies like an accompanying novella, &#8220;outtake&#8221; chapters, or chapters from the next book in the series. Think of it like including bonus features found on the enhanced edition of a DVD.<\/p>\n<h2>Cross-promote with other writers<\/h2>\n<p>Find other writers in your genre or field. Feature their blog posts on your website, link to their materials, and request that they do the same for you.<\/p>\n<h2>Leverage a collaboration<\/h2>\n<p>If your work is part of an anthology or was the result of a collaboration (either amongst authors or illustrators), you should all be promoting each other as much as possible.<\/p>\n<h2>Market the total package<\/h2>\n<p>If you&#8217;ve got multiple books, consider selling them as a bundle. If you write non-fiction and you have course materials, video, or audio lectures that support your content, consider bundling some or all of it together. Sell your bundle at a lower price than readers could buy the items individually and you&#8217;ll create a sense of value. Readers like to pass on word of the great deal they received.<\/p>\n<h2>Donate your book<\/h2>\n<p>Give your book to libraries, schools, clubs, shelters, or other organizations that might not be able or willing to purchase your work for themselves.<\/p>\n<h2>Create a Pinterest board for your book<\/h2>\n<p>Pin images and links that inspired your work or relate to it in some way. Maybe pin a picture of the location you used for your novel, or pictures of the clothes your characters wear. Some readers like to keep the details in their heads, but others like to see what the author saw while writing the book.<\/p>\n<h2>Appear in your alumni newsletter<\/h2>\n<p>Make sure your alumni association knows that you&#8217;re publishing a book and have them add you to the newsletter. Admit it: You always read the, &#8220;Where are they now?&#8221; section and roll your eyes at the bragging that goes on in there. You might as well get in on the bragging, too.<\/p>\n<h2>Host a podcast<\/h2>\n<p>You can post podcasts on your website. Talk about your latest work, your writing process, works coming out by your favorite authors, or anything else that you think will interest your readers. Keep it informative, speak clearly, and don&#8217;t go on for hours.<\/p>\n<h2>Business cards<\/h2>\n<p>Some people say they&#8217;re obsolete in the digital world, but business cards are still incredibly useful. They can be easily handed out at conferences, appearances, and workshops. They can be included with press releases and marketing kits. Make them easy to read and include all relevant contact information.<\/p>\n<h2>Comment on other blogs<\/h2>\n<p>Take the time to post constructive comments on other blogs and make sure to include a link back to your website or a mention of your book. But don&#8217;t comment just to make the link. &#8220;Cool post, dude!&#8221; isn&#8217;t effectively promoting your work. Make sure you have something useful to add to the conversation.<\/p>\n<h2>Be generous with your thanks<\/h2>\n<p>If someone helps you, be it a bookstore owner, blogger, or member of the media, be sure to say thank you. Send a personalized card or a thank you letter or email. These people are much more likely to continue to recommend the work of someone who was polite and thoughtful than someone who was rude and ungrateful.<\/p>\n<h2>Create some merchandise<\/h2>\n<p>It doesn&#8217;t have to be expensive stuff, but bookmarks, pencils, notepads, and other promotional items are nice to give away at appearances. If you have more funds, you can create more expensive items which are relevant to your book and something that your readers will find useful or fun. These can be the basis of contests and giveaways, and you can include them with book purchases or sell them in their own right.<\/p>\n<h2>Try consigning your book<\/h2>\n<p>If a bookstore won&#8217;t buy your book, see if you can consign it with them. If it sells, they split the profits with you. If not, you take the books back and the store is out nothing. This can work with non-traditional outlets, as well. For example, if your book has a tie to a tourist location, see if you can place your book in gift shops or local museums.<\/p>\n<h2>Use your family, friends, and work colleagues<\/h2>\n<p>See if your family and friends would be willing to talk about your work with others they know, or if they might post it on their social networking profiles. You don&#8217;t want to make a big deal out of this or force anyone into doing something they don&#8217;t want to do, but a quick, &#8220;My sister just publisher her latest book!&#8221; with a link to Amazon can reach people you might not reach otherwise.<\/p>\n<h2>Create a YouTube channel<\/h2>\n<p>You can post your book trailer, instruction videos (if applicable) and videos of your appearances and interviews. You can also put together slide shows, reviews of other books, and other videos as appropriate to your reader&#8217;s interests.<\/p>\n<h2>Throw a launch party<\/h2>\n<p>See if your local bookstore will let you host a launch party for your book. You can do a reading, speak on your topic, have a contest or raffle, provide refreshments, or play games, if appropriate.<\/p>\n<h2>Enter contests<\/h2>\n<p>There are many contests and award for writers and many allow entry of previously published works. If you win or place, your work will likely be featured on the contest website and may be included in an anthology with other winners.<\/p>\n<h2>Approach organizations and businesses<\/h2>\n<p>If your book has a tie with an organization or business, see if you can interest them in buying some copies. Perhaps an animal rescue organization would like to sell or give away your book about how to foster dogs to their clients. Or maybe a large business wants your book on how to create dynamic sales presentations.<\/p>\n<h2>Blab<\/h2>\n<p>You don&#8217;t want to be annoying, but never miss a chance to talk about your book. If someone asks, &#8220;What do you do?&#8221; at a party, talk about your book. If you&#8217;re waiting to mail books at the post office and someone asks, &#8220;That looks heavy, what are you mailing?&#8221; don&#8217;t hesitate to tell them. If you won&#8217;t toot your own horn, who will?<\/p>\n<h2>Don&#8217;t go too far<\/h2>\n<p>The final piece of advice is simple. You want to promote your work, but you don&#8217;t want to anger your readers, bookstore owners, or blog hosts. It&#8217;s fine to ask for a chance to appear or contribute, but if the answer is no, don&#8217;t whine or pester. If people are kind enough to subscribe to your email list or provide their emails in your blog comments, don&#8217;t abuse it by sending them emails every day. Only send email when you have something new and relevant, not just begging emails. And provide a clear option for them to opt-out. And if someone says they&#8217;re not comfortable promoting your work (it&#8217;s not their thing or they just don&#8217;t like it), don&#8217;t force or guilt them into it. You want to promote your work, not make everyone sick of you.<\/p>\n<p>Don&#8217;t try to do everything. There will always be something else you can do, or someone else who is doing more than you to promote their work. At some point, though, you have to realize that there is only so much you can do so do it well, be satisfied with it, and let it go. You could make marketing into your whole career, but you don&#8217;t want to do that. Your main job is to write and you can&#8217;t do that if you never stop promoting. Producing more work is the best way to promote your older work.<\/p>\n<p>(Photo courtesy of <a href=\"https:\/\/www.flickr.com\/photos\/steventom\/2981595684\/\">Steven Tom<\/a>)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Whether your write books, articles, or keep a blog, if you want to make money you have to promote your work. Even if you are traditionally published, you&#8217;ll likely have to handle at least some of your own promotion. Publishers are cutting marketing departments and budgets and placing more responsibility on the authors themselves. (Unless &hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[69,74,72,70,73,68,67,71],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>46 Ways to Promote Your Writing - Word Counter Blog<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"46 Ways to Promote Your Writing - Word Counter Blog\" \/>\n<meta property=\"og:description\" content=\"Whether your write books, articles, or keep a blog, if you want to make money you have to promote your work. Even if you are traditionally published, you&#8217;ll likely have to handle at least some of your own promotion. Publishers are cutting marketing departments and budgets and placing more responsibility on the authors themselves. (Unless &hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html\" \/>\n<meta property=\"og:site_name\" content=\"Word Counter Blog\" \/>\n<meta property=\"article:published_time\" content=\"2014-04-07T17:13:43+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-07-02T17:45:04+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/04\/book-signing-550x412.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"15 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\",\"url\":\"https:\/\/wordcounter.net\/blog\/\",\"name\":\"Word Counter Blog\",\"description\":\"Because words count\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/wordcounter.net\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html#primaryimage\",\"url\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/04\/book-signing.jpg\",\"contentUrl\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/04\/book-signing.jpg\",\"width\":1024,\"height\":768,\"caption\":\"promoting your book and writing\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html#webpage\",\"url\":\"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html\",\"name\":\"46 Ways to Promote Your Writing - Word Counter Blog\",\"isPartOf\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html#primaryimage\"},\"datePublished\":\"2014-04-07T17:13:43+00:00\",\"dateModified\":\"2015-07-02T17:45:04+00:00\",\"author\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\"},\"breadcrumb\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/wordcounter.net\/blog\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"46 Ways to Promote Your Writing\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\",\"name\":\"admin\",\"url\":\"https:\/\/wordcounter.net\/blog\/author\/admin\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"46 Ways to Promote Your Writing - Word Counter Blog","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html","og_locale":"en_US","og_type":"article","og_title":"46 Ways to Promote Your Writing - Word Counter Blog","og_description":"Whether your write books, articles, or keep a blog, if you want to make money you have to promote your work. Even if you are traditionally published, you&#8217;ll likely have to handle at least some of your own promotion. Publishers are cutting marketing departments and budgets and placing more responsibility on the authors themselves. (Unless &hellip;","og_url":"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html","og_site_name":"Word Counter Blog","article_published_time":"2014-04-07T17:13:43+00:00","article_modified_time":"2015-07-02T17:45:04+00:00","og_image":[{"url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/04\/book-signing-550x412.jpg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"15 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/wordcounter.net\/blog\/#website","url":"https:\/\/wordcounter.net\/blog\/","name":"Word Counter Blog","description":"Because words count","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/wordcounter.net\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html#primaryimage","url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/04\/book-signing.jpg","contentUrl":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/04\/book-signing.jpg","width":1024,"height":768,"caption":"promoting your book and writing"},{"@type":"WebPage","@id":"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html#webpage","url":"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html","name":"46 Ways to Promote Your Writing - Word Counter Blog","isPartOf":{"@id":"https:\/\/wordcounter.net\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html#primaryimage"},"datePublished":"2014-04-07T17:13:43+00:00","dateModified":"2015-07-02T17:45:04+00:00","author":{"@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef"},"breadcrumb":{"@id":"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/wordcounter.net\/blog\/2014\/04\/07\/1025_46-ways-to-promote-your-writing.html#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/wordcounter.net\/blog"},{"@type":"ListItem","position":2,"name":"46 Ways to Promote Your Writing"}]},{"@type":"Person","@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef","name":"admin","url":"https:\/\/wordcounter.net\/blog\/author\/admin"}]}},"_links":{"self":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/25"}],"collection":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/comments?post=25"}],"version-history":[{"count":7,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/25\/revisions"}],"predecessor-version":[{"id":410,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/25\/revisions\/410"}],"wp:attachment":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/media?parent=25"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/categories?post=25"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/tags?post=25"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}