{"id":30,"date":"2015-12-31T10:27:03","date_gmt":"2015-12-31T18:27:03","guid":{"rendered":"http:\/\/www.wordcounter.net\/blog\/?p=30"},"modified":"2016-01-01T12:39:48","modified_gmt":"2016-01-01T20:39:48","slug":"writer-resolutions","status":"publish","type":"post","link":"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html","title":{"rendered":"31 New Year&#8217;s Resolutions for Writers"},"content":{"rendered":"<p><center><a href=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2013\/12\/writer-resolutions.jpg\"><img loading=\"lazy\" src=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2013\/12\/writer-resolutions-550x366.jpg\" alt=\"writer new year&#039;s resolutions\" width=\"550\" height=\"366\" class=\"alignnone size-medium wp-image-34\" srcset=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2013\/12\/writer-resolutions-550x366.jpg 550w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2013\/12\/writer-resolutions-700x466.jpg 700w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2013\/12\/writer-resolutions-624x416.jpg 624w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2013\/12\/writer-resolutions.jpg 1024w\" sizes=\"(max-width: 550px) 100vw, 550px\" \/><\/a><\/center><\/p>\n<p>It&#8217;s almost that time again. Time to resolve to get your entire life under control, preferably by February first. Yes, it&#8217;s time for the dreaded New Year&#8217;s resolution. This year, in addition to trying to lose weight, quit smoking, save money, or give up some other addiction, why not resolve to improve a part (or parts) of your writing life? You might find that fixing up your writing life leads to improvement in other areas as you gain confidence and success in your work. And even if it doesn&#8217;t, you&#8217;ve still accomplished something significant. Here are some ideas to get you started.<\/p>\n<h2>Finish the Project<\/h2>\n<p>Whether you&#8217;re working on a book, short story, article, or poetry, finish whatever it is you&#8217;re working on. It&#8217;s easy to get sidetracked or frustrated and jump from project to project, <a href=\"https:\/\/wordcounter.net\/blog\/2014\/01\/13\/1014_25-excuses-for-not-writing.html\">never finishing anything<\/a>. But a finished work (and by finished, I mean revised, edited, and as perfect as you can make it) is the only thing you should be submitting for publication, which is resolution #2.<\/p>\n<h2>Submit the Project<\/h2>\n<p>Just don&#8217;t submit it until it&#8217;s finished. In the rush to feel like you&#8217;re making progress it&#8217;s tempting to send things out too soon. Resist this urge and wait until it&#8217;s as great as you can make it. You might get rejected, but you might also get accepted. Submitting the work is the only way to know for sure.<\/p>\n<h2>Try Something New<\/h2>\n<p>If you normally write novels, try a memoir. If you normally write short articles, try a novel or short story. Trying new forms of writing keeps the creative juices flowing and may introduce you to something you really enjoy.<\/p>\n<h2>Call Yourself a Writer<\/h2>\n<p>Do you write? Then you&#8217;re a writer and you shouldn&#8217;t be afraid to label yourself as such. Too many of us hem and haw when asked, &#8220;What do you do?&#8221; Just own it. &#8220;I&#8217;m a writer.&#8221;<\/p>\n<h2>Exercise<\/h2>\n<p>Yes, this is one resolution that everyone makes, but it&#8217;s especially important for writers. We tend to spend too much time sitting on our butts. (Whether we&#8217;re working or mindlessly surfing the Internet and calling it &#8220;work,&#8221; the result is the same. Too much butt-sitting.) In addition to just being good for you, exercise boosts creativity and gives your mind a chance to roam free for a while. Bonus points if you can go outside and get some fresh air and new scenery.<\/p>\n<h2>Make Writing a Priority<\/h2>\n<p>Find them time in your day to write. This may mean skipping other fun activities, or letting some chores or errands pile up for another day. Do whatever you have to do to make writing a priority in your life instead of something that you do in your spare time.<\/p>\n<h2>Read More<\/h2>\n<p>Good writers read a lot. Read fiction, non-fiction, poetry, memoir, or the back of cereal boxes. You&#8217;ll get ideas and improve your craft by studying those who do it better (and worse) than you.<\/p>\n<h2>Journal More<\/h2>\n<p>If you already keep a journal, resolve to be more consistent about writing in it. Or, start a different kind of journal. Maybe you&#8217;re keeping one that tracks your daily activities, but can you also add one dedicated to your creativity or travel? Writing about something new can open you up to new ideas. If you don&#8217;t keep a journal, start one. It gives you some writing practice and may let you see ideas and problems in ways you haven&#8217;t before.<\/p>\n<h2>Learn at Least One New Thing<\/h2>\n<p>Take a class in something or make an effort to study on your own. It doesn&#8217;t have to be writing related. The more things you know, the deeper your well of experience that you can draw upon when writing. And if you take a class, you might meet some interesting &#8220;characters&#8221; for your work.<\/p>\n<h2>Stop Beating Yourself Up<\/h2>\n<p>If you get rejected or things aren&#8217;t going as you hoped, don&#8217;t get down on yourself. Calling yourself a failure or talking about giving up (&#8220;I&#8217;m so terrible. I&#8217;ll never get published so why bother) are counterproductive. It hurts you and isn&#8217;t necessary. You don&#8217;t have to be super positive all the time, but don&#8217;t flog yourself to death. If you get rejected, try to say, &#8220;That one didn&#8217;t work out. I&#8217;ll try again.&#8221; This is supposed to be fun and if all you&#8217;re doing is beating up on yourself, that&#8217;s not fun or healthy.<\/p>\n<h2>Back-Up Your Data<\/h2>\n<p>We all know we should do this, but a surprising number of people do not. Do you really want to try to rewrite your novel from scratch, or pay someone several hundred dollars to try and recover your data in the event of computer failure? And remember: If you lose your laptop, recovery isn&#8217;t an option. A backup drive or cloud service can be had for $100 or less and is well worth it for the peace of mind.<\/p>\n<h2>Get Organized<\/h2>\n<p>This is another one that many people attempt every New Year, but you can narrow it down to organizing just your writing life. (Many people give up on this one because organizing the whole house seems impossible, but since you&#8217;re only going to organize your writing space, you&#8217;re already ahead of the crowd. Do more if you want to, but at least get your writing area under control.) Get a file cabinet, clean up your hard drive, get an in\/out box, or use whatever other methods work for you. It doesn&#8217;t have to be pretty or trendy, just functional.<\/p>\n<h2>Set a Realistic Overall Goal for the Year<\/h2>\n<p>Maybe your goal is to query twenty agents or get six new clients. Maybe you want to complete a novel and a short story, or to earn 5% more than you did last year. Pick one goal for the year and then spend the year tracking your progress. Just be realistic. You probably won&#8217;t finish thirty novels this year, nor will you make 50% more than you did last year. Being realistic leads to success. Overblown goals lead to crashing and burning.<\/p>\n<h2>Show up Consistently<\/h2>\n<p>One of the challenges of writing is showing up for work every day. There&#8217;s always so much else you could (maybe should) be doing. Train yourself to show up every day. Marking a calendar with an &#8220;X&#8221; or a sticker every day that you write is a good idea. After a few days of consistently showing up, you&#8217;ll have a nice string of marks that you won&#8217;t want to break. When tempted to skip out on a day, the thought of breaking that string will get you in the chair.<\/p>\n<h2>Volunteer<\/h2>\n<p>While not directly related to writing, volunteering gets you out of the house, off your butt, and exposes you to people and events that might provide fodder for your work. And it does something good for others, which is good for your soul. You can also volunteer for causes that are writing-related. Maybe tutor disadvantaged youths or help in a literacy campaign.<\/p>\n<h2>Create Your Online Presence (or improve what you&#8217;ve got)<\/h2>\n<p>Working <a href=\"https:\/\/wordcounter.net\/blog\/2015\/05\/26\/10223_quality-author-website.html\">writers need a website<\/a> and possibly a Twitter and\/or Facebook account to help with promotion to connect with readers and clients. If you&#8217;ve already got something, check to make sure it meets your needs and is professional-looking. If you don&#8217;t have anything, either figure out how to do it yourself or hire someone. Your website doesn&#8217;t have to be huge or technologically advanced, but it should be professional and informative.<\/p>\n<h2>Talk Less, Write More<\/h2>\n<p>Do you find yourself talking about your work more than actually doing it? If you spend more time talking about how you&#8217;d like to write, your dreams, and your works in progress, shut up and write. Talking won&#8217;t get the work done and published. Writing will.<\/p>\n<h2>Enter a Contest<\/h2>\n<p>You might not win, but simply entering forces you to produce a work and submit it, helping you to get past the whole, &#8220;I&#8217;m afraid of finishing anything and getting rejected&#8221; hurdles. And if you do win, fame and fortune might be yours. Or you might just win $20 or a gift certificate. Either way, winning is winning.<\/p>\n<h2>Figure out What&#8217;s Broken<\/h2>\n<p>If you&#8217;re having trouble even getting to the chair and producing anything, something&#8217;s broken. Maybe it&#8217;s your routine. You might be better of writing in the morning rather than in the afternoon or vice versa. Maybe your writer&#8217;s group isn&#8217;t fun anymore and they&#8217;re dragging you down. Maybe you&#8217;re feeling negative vibes from your significant other that he or she doesn&#8217;t like the time you spend writing. Maybe you don&#8217;t like the type of writing you&#8217;re doing anymore. Evaluate everything and everybody in your writing life to figure out what&#8217;s broken and then figure out how to fix it.<\/p>\n<h2>Sleep More<\/h2>\n<p>When you&#8217;re well rested, your brain just functions better. You&#8217;ll make fewer mistakes in your work and your ideas will be clearer and more numerous. It&#8217;s hard to get more sleep when you have other things to do, but you simply have to make it a priority.<\/p>\n<h2>Support Other Writers<\/h2>\n<p>Most writers won&#8217;t admit to being jealous of more successful writers, but the ugly monster is there. Instead of thinking, &#8220;She&#8217;s so lucky. She only got published because she knew someone who knew someone,&#8221; and seething over her good fortune, try being more positive. Try, &#8220;Hey, it&#8217;s great that you got published. I&#8217;m so happy for you.&#8221; Success for one person doesn&#8217;t mean there will be none for you. It&#8217;s not like grabbing the last TV at the Black Friday blowout sale. Be kind and encouraging to others. You might find that you receive support in return instead of negativity. Plus, you&#8217;re just gaining good karma points. Who knows? That person who knew someone who knew someone might share that information with you, too.<\/p>\n<h2>Learn about Self-Publishing<\/h2>\n<p>Even if your goal is to be traditionally published, learning about self-publishing can come in handy. It&#8217;s a growing market with lots of opportunity for all forms of writing. Done well, it can lead to success. Done poorly and hastily, however, and you can end up being the guy with 1,500 one-star reviews on Amazon. Don&#8217;t be that guy.<\/p>\n<h2>Have More Fun<\/h2>\n<p>If writing is becoming something you dread, you need to find a way to make it fun again. No, it&#8217;s never going to be a laugh-a-minute job, but it shouldn&#8217;t be something you hate, either. Maybe you need to try a new form or genre, or just stop taking everything so seriously.<\/p>\n<h2>Stop Procrastinating<\/h2>\n<p>There are lots of ways to conquer <a href=\"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html\">writer&#8217;s procrastination<\/a>. Before you let it eat away your productivity, figure out why you do it and then get over it. Every day that you don&#8217;t write is another missed opportunity. This is the easiest way to <a href=\"https:\/\/wordcounter.net\/blog\/2014\/01\/31\/1061_finding-time-to-write.html\">find more time to write<\/a>.<\/p>\n<h2>Conquer Your Fear of Revision<\/h2>\n<p>Too many writers have bunches of first drafts littering their hard drives, yet they never send them out because revision leaves them cold. The first draft was fun. Revision feels like drudgery. Get over it. Read books or take a class in editing and revision. You cannot succeed as a writer unless you&#8217;re willing to revise (often) so the sooner you beat this fear, the better.<\/p>\n<h2>Act Professionally (even if you don&#8217;t feel professional)<\/h2>\n<p>This is sort of like faking it till you make it. Even if you don&#8217;t have work or a publisher\/agent yet, act as if you do when contacting people. Be confident (but not arrogant) and treat everyone with courtesy and professionalism. If you look like a slob, talk in slang, miss deadlines, or submit work with mistakes, people aren&#8217;t going to work with you.<\/p>\n<h2>Limit Non-Essential Internet Surfing<\/h2>\n<p>The Internet is a fabulous invention, but it&#8217;s also a massive time waster. You can recapture a lot of time in your day if you limit your Facebooking, Tweeting, and mindless surfing.<\/p>\n<h2>Stay Informed<\/h2>\n<p>No, you don&#8217;t have to commit to watching two hours of CNN every night. But a good writer is informed, not only about things related to writing but also about world events. Sometimes your best ideas will come from what&#8217;s going on in the world. And don&#8217;t limit yourself to learning about just one side of an issue. Seek out balanced coverage and form your own opinions.<\/p>\n<h2>Share<\/h2>\n<p>It&#8217;s easy to cocoon yourself in your house with your manuscripts, but you need the input of other people to make your work better. Sure, you think you&#8217;re a genius, but what do other people think? Sharing is scary, though, because it feels risky. &#8220;What if they hate it? I&#8217;ll have wasted all this time.&#8221; Get past the fear. Find people you trust to give you good (not necessarily positive) feedback and share your work with them. You&#8217;ll get a more realistic picture of how you&#8217;re doing.<\/p>\n<h2>Stop Comparing Yourself to Others<\/h2>\n<p>Some people make a boatload of money. Others make a more modest amount. Some writers are on TV all the time while others are virtual recluses. No one way is right for everyone, so stop wasting time comparing your career with everyone else&#8217;s. Every career moves at its own pace and is subject to a variety of factors and influences. Figure out what you want and then go for that, not what you think everyone else is doing.<\/p>\n<h2>Improve Your Vocabulary<\/h2>\n<p>Work on bettering your writing by <a href=\"https:\/\/wordcounter.net\/blog\/2014\/01\/22\/1027_25-ways-to-improve-your-writing-vocabulary.html\">improving your vocabulary<\/a>. This is an easy way to <a href=\"https:\/\/wordcounter.net\/blog\/2014\/03\/03\/1043_improve-your-writing-skills.html\">improve your writing<\/a> (and yourself) in the New Year.<\/p>\n<p>You don&#8217;t have to tackle everything on this list. That would ensure failure before you even get the holiday decorations packed away. Just pick one or two that motivate you and then pace yourself so that you spread the effort out over the year. It&#8217;s a New Year&#8217;s resolution, after all. It&#8217;s supposed to be good for the whole year so there&#8217;s no need to freak out if you haven&#8217;t finished it by Valentine&#8217;s Day.<\/p>\n<p>(Photo courtesy of <a href=\"http:\/\/www.flickr.com\/photos\/31677782@N03\/3160528007\/\">Kat<\/a>)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It&#8217;s almost that time again. Time to resolve to get your entire life under control, preferably by February first. Yes, it&#8217;s time for the dreaded New Year&#8217;s resolution. This year, in addition to trying to lose weight, quit smoking, save money, or give up some other addiction, why not resolve to improve a part (or &hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[5,7,4,6,3],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>31 New Year&#039;s Resolutions for Writers - Word Counter Blog<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"31 New Year&#039;s Resolutions for Writers - Word Counter Blog\" \/>\n<meta property=\"og:description\" content=\"It&#8217;s almost that time again. Time to resolve to get your entire life under control, preferably by February first. Yes, it&#8217;s time for the dreaded New Year&#8217;s resolution. This year, in addition to trying to lose weight, quit smoking, save money, or give up some other addiction, why not resolve to improve a part (or &hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html\" \/>\n<meta property=\"og:site_name\" content=\"Word Counter Blog\" \/>\n<meta property=\"article:published_time\" content=\"2015-12-31T18:27:03+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-01-01T20:39:48+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2013\/12\/writer-resolutions-550x366.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\",\"url\":\"https:\/\/wordcounter.net\/blog\/\",\"name\":\"Word Counter Blog\",\"description\":\"Because words count\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/wordcounter.net\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html#primaryimage\",\"url\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2013\/12\/writer-resolutions.jpg\",\"contentUrl\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2013\/12\/writer-resolutions.jpg\",\"width\":1024,\"height\":683,\"caption\":\"writer new year's resolutions\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html#webpage\",\"url\":\"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html\",\"name\":\"31 New Year's Resolutions for Writers - Word Counter Blog\",\"isPartOf\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html#primaryimage\"},\"datePublished\":\"2015-12-31T18:27:03+00:00\",\"dateModified\":\"2016-01-01T20:39:48+00:00\",\"author\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\"},\"breadcrumb\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/wordcounter.net\/blog\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"31 New Year&#8217;s Resolutions for Writers\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\",\"name\":\"admin\",\"url\":\"https:\/\/wordcounter.net\/blog\/author\/admin\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"31 New Year's Resolutions for Writers - Word Counter Blog","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html","og_locale":"en_US","og_type":"article","og_title":"31 New Year's Resolutions for Writers - Word Counter Blog","og_description":"It&#8217;s almost that time again. Time to resolve to get your entire life under control, preferably by February first. Yes, it&#8217;s time for the dreaded New Year&#8217;s resolution. This year, in addition to trying to lose weight, quit smoking, save money, or give up some other addiction, why not resolve to improve a part (or &hellip;","og_url":"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html","og_site_name":"Word Counter Blog","article_published_time":"2015-12-31T18:27:03+00:00","article_modified_time":"2016-01-01T20:39:48+00:00","og_image":[{"url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2013\/12\/writer-resolutions-550x366.jpg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/wordcounter.net\/blog\/#website","url":"https:\/\/wordcounter.net\/blog\/","name":"Word Counter Blog","description":"Because words count","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/wordcounter.net\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html#primaryimage","url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2013\/12\/writer-resolutions.jpg","contentUrl":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2013\/12\/writer-resolutions.jpg","width":1024,"height":683,"caption":"writer new year's resolutions"},{"@type":"WebPage","@id":"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html#webpage","url":"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html","name":"31 New Year's Resolutions for Writers - Word Counter Blog","isPartOf":{"@id":"https:\/\/wordcounter.net\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html#primaryimage"},"datePublished":"2015-12-31T18:27:03+00:00","dateModified":"2016-01-01T20:39:48+00:00","author":{"@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef"},"breadcrumb":{"@id":"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/wordcounter.net\/blog\/2015\/12\/31\/1030_writer-resolutions.html#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/wordcounter.net\/blog"},{"@type":"ListItem","position":2,"name":"31 New Year&#8217;s Resolutions for Writers"}]},{"@type":"Person","@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef","name":"admin","url":"https:\/\/wordcounter.net\/blog\/author\/admin"}]}},"_links":{"self":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/30"}],"collection":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/comments?post=30"}],"version-history":[{"count":18,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/30\/revisions"}],"predecessor-version":[{"id":1094,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/30\/revisions\/1094"}],"wp:attachment":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/media?parent=30"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/categories?post=30"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/tags?post=30"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}