{"id":3073,"date":"2017-07-25T07:40:14","date_gmt":"2017-07-25T14:40:14","guid":{"rendered":"https:\/\/wordcounter.net\/blog\/?p=3073"},"modified":"2017-10-11T14:36:45","modified_gmt":"2017-10-11T21:36:45","slug":"5-struggling-writers","status":"publish","type":"post","link":"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html","title":{"rendered":"5 Struggling Writers Who Eventually Made It"},"content":{"rendered":"<p>Very few writers actually make a living at their craft. If you are a writer yourself, you know this already. People will tell you to give it up and get a real job. This is why most writers write only on the side or totally give up the craft after awhile. It can be quite frustrating. The toughest thing to do is to remain positive while facing adversity.<\/p>\n<p>Many successful writers did exactly that. They kept writing even though it seemed like it was hopeless. Friends and family would often tell them to give it up, and focus on other aspects of their lives. But when you are the person chasing your dream, giving up is often not an option. If you are a true writer, then you realize that writing is something that is in your soul. To give it up would be impossible. Let&#8217;s look at some very successful writers who did not start out that way.<\/p>\n<h2>1. Dr. Seuss<\/h2>\n<p><img loading=\"lazy\" class=\"alignleft size-full wp-image-3100\" src=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/dr-seuss.jpg\" alt=\"Dr. Seuss\" width=\"1269\" height=\"850\" srcset=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/dr-seuss.jpg 1269w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/dr-seuss-550x368.jpg 550w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/dr-seuss-768x514.jpg 768w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/dr-seuss-700x469.jpg 700w\" sizes=\"(max-width: 1269px) 100vw, 1269px\" \/><br \/>\nWe all know who Dr. Seuss is! But he didn&#8217;t start out with that name. Dr. Seuss was entirely his pen name. The much beloved children&#8217;s author&#8217;s name was actually <b>Theodor Seuss Geisel<\/b>. It turns out he wasn&#8217;t a doctor at all! However, he is one of the most successful writers of all time. His books have sold over 600 million copies.<\/p>\n<p>His original goal was to become an English teacher. But his future wife convinced him to give up wanting to become an English teacher, and convinced him to pursue drawing instead. They later married, but Dr. Seuss never did have any children of his own. He originally drew political cartoons for papers and magazines. Eventually he turned his attention to children&#8217;s books where he did both the writing and illustrations.<\/p>\n<p>His first children&#8217;s book was <strong>And to Think That I Saw It on Mulberry Street<\/strong>. It did not start off a smashing success though. He sent it around to numerous publishers and they all turned it down. In fact, it was the 28th publisher he sent it to that decided to take a chance on it. Vanguard Press ended up selling 6 million copies of the book. It&#8217;s a good thing Dr. Seuss did not give up after the 27th publisher rejected it. It just goes to show you that good fortune could be just around the corner. But first you have to turn that corner before you can find it.<\/p>\n<h2>2. J.K. Rowling<\/h2>\n<p><img loading=\"lazy\" class=\"alignleft size-full wp-image-3101\" src=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/jk-rowling.jpg\" alt=\"J.K. Rowling\" width=\"1100\" height=\"694\" srcset=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/jk-rowling.jpg 1100w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/jk-rowling-550x347.jpg 550w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/jk-rowling-768x485.jpg 768w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/jk-rowling-700x442.jpg 700w\" sizes=\"(max-width: 1100px) 100vw, 1100px\" \/><br \/>\nUnless you have been living under a rock for the last 20 years, you have probably heard of the author J.K. Rowling. She is the very well-known author of the <strong>Harry Potter<\/strong> series that debuted in 1997. It took her approximately six years to write that first book. Her real name is Joanne Rowling, switching over to J.K. in honor of her mother and as a way to make her books a bit more popular. It is thought that boys do not often read books of female authors, so the unknown J.K. Rowling was born. Going with just initials instead of a first name was a way at the beginning of having all children interested in her books. Now just having her name being on a book is a way to interest millions of people.<\/p>\n<p>Rowling did not have a book deal handed to her on a silver platter. Her life was often very difficult. She always thought she wanted to be a writer though. She enjoyed being alone in her room and creating stories out of nothing. Her mother died when she was 25 years old. Rowling was just six months in to writing Harry Potter at the time, and she had not told her mom about the story she was working on.<\/p>\n<p>She soon married and had a daughter. However, the marriage would end just a bit after a year. Rowling was left penniless, jobless, and living in a rundown apartment with her young daughter. She survived off welfare and continued to write the book that would change her life. Once the book was finished, publisher after publisher turned it down. Finally, Bloomsbury, a publishing house in London, took a chance on the book and the unknown author. Her series of seven Harry Potter books would proceed to sell more than 450 million copies. Forbes estimated her net worth to be over $1 billion in 2011. From a struggling single mother with an idea for a book in her head that took six years for her to write to an amazingly successful author, Rowling has enjoyed quite the ride!<\/p>\n<h2>3. Sylvester Stallone<\/h2>\n<p><img loading=\"lazy\" class=\"alignleft size-full wp-image-3103\" src=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/sylvester-stallone.jpg\" alt=\"Sylvester Stallone\" width=\"1200\" height=\"764\" srcset=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/sylvester-stallone.jpg 1200w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/sylvester-stallone-550x350.jpg 550w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/sylvester-stallone-768x489.jpg 768w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/sylvester-stallone-700x446.jpg 700w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><br \/>\nYou may be scratching your head right now and wondering what Sylvester Stallone has to do with struggling writers that finally make it after enduring many failures. Stallone&#8217;s actual life story is even more impressive than Rocky&#8217;s. His rags to riches tale is almost hard to believe, but I assure you that it is all true.<\/p>\n<p>Stallone was a struggling actor in New York for many years. And when I say struggling, I am being kind. He landed very few parts and was financially broke. He once had to steal his wife&#8217;s jewelry just to pawn it off so they survive a bit longer. He didn&#8217;t even have the money to buy food for his pet dog, so he had to approach strangers asking if they would be interesting in buying him. Stallone sold his dog for $25, and then walked away crying. He was homeless and slept at the bus station for days while he had nothing left to eat. Things could not get much worse.<\/p>\n<p>A couple weeks later, he saw a boxing match between Muhammad Ali and Chuck Wepner. Wepner was a serious underdog heading into the fight. People did not think he had a chance at the ever-impressive Ali. Wepner surprised everyone by trading blows and almost going the entire 15 rounds with Ali. Ali knocked Wepner out with only 20 seconds left in the fight. This inspired Stallone so much that he wrote the screenplay <strong>Rocky<\/strong> in one 20 hour marathon session.<\/p>\n<p>He started pitching it to some studios and production companies. At the age of 30 years old, according to Stallone, he received an offer of $125,000 for the script. At the time, he had only about one hundred dollars in the bank and a pregnant wife. The studio was looking at having Burt Reynolds or Ryan O&#8217;Neal star in the film. Stallone, basically an unknown actor, turned down the offer because he wanted to be able to star in Rocky as well.<\/p>\n<p>The offer reportedly got up to $350,000 for the screenplay Rocky if Stallone agreed he would not act in it. He once again turned down the offer and bet on himself. The studio finally agreed to pay him $35,000 for Rocky and agreed to let him star in it. They had a small $1 million budget and shot the whole movie in about four weeks. The rest is history! It won several awards and Stallone went on to write all the Rocky films among others. He also found the person who had bought his dog and ended up buying it back, according to Stallone, for three thousand dollars.<\/p>\n<h2>4. Stephen King<\/h2>\n<p><img loading=\"lazy\" class=\"alignnone wp-image-3107 aligncenter\" src=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/471px-Stephen_King_Comicon.jpg\" alt=\"\" width=\"344\" height=\"438\" \/><\/p>\n<p>Stephen King is known as one of the most prolific writers of our time. By the end of 2016, he had written a grand total of 57 novels, including the ones that he wrote under his pen name of Richard Bachman. His work ethic with his writing has been nothing short of amazing. However, people may not realize how much he struggled before he became an &#8220;overnight&#8221; success. King has been known as such a huge talent for so long, people forget that he did not start out that way.<\/p>\n<p>Born in Portland, Maine in 1947, King&#8217;s parents divorced when he was still very young. King and his brother David spent much of their youth being shuttled back and forth between their parents in Indiana and Connecticut. He later moved back to Maine with his brother and mother. If you are a fan of King&#8217;s work, you may have noticed that his stories are sometimes centered in Maine.<\/p>\n<p>King later graduated from college with an English degree in 1970. He searched for a teaching position, but could not land one. He ended up working in a laundry and wrote short stories during his spare time. In 1971, he was hired at Hampden Academy to teach English. He also married his wife Tabitha that year, also a fellow writer. They struggled mightily the first few years of their marriage with finances. Their phone was often disconnected because they just did not have enough money to pay the bills.<\/p>\n<p>By 1973, things had not gotten much better. King and his wife had two young kids by then. Tabitha was working at Dunkin&#8217; Donuts while King kept teaching English in Maine. Finances continued to be so bad that he moonlighted as a janitor and gas pump attendant. They lived in a drafty doublewide trailer and drove around an old Buick held together by wire and tape. The typewriter he used was actually his wife&#8217;s, since he was too poor to have one of his own. His desk located in their trailer was in the laundry room wedged between the washing machine and the dryer. He continued to write faithfully even though he had not received much money from selling short stories to magazines such as Playboy and Penthouse. He found it difficult to share the good news of his short stories being published when they were stuck in these men&#8217;s magazines.<\/p>\n<p>One day the Hampden Academy offered him an extra $300 a year if he would take the extra position of being the faculty advisor to the debate club. It was an offer he could not refuse, he thought, because it would allow his family to buy groceries. His wife, though, refused it for him when she realized it would not give him much time to write anymore. She was willing to risk it because she knew her husband had real talent.<\/p>\n<p>A year later, after more than 30 publishers declined it, King received a phone call at school from his wife saying that his novel <strong>Carrie <\/strong>just sold to Doubleday Publishing. He received an advance of $2,500 for Carrie. It was not enough to quit teaching and focus on his writing, but it allowed them to get a better car and move out of the trailer and into a small apartment. They were even able to get their phone connected again. However, the hardback book Carrie only sold 13,000 copies. He was not exactly setting the literary world on fire. He started on a new book and put Carrie in the back of his mind. Then he received a very unexpected phone call. The paperback rights to Carrie was sold to Signet Books for $400,000. Half of that went directly to King. The paperback version of Carrie sold over a million copies. King gave up teaching and his wife quit Dunkin&#8217; Donuts. The rest is history!<\/p>\n<h2>5. Laura Ingalls Wilder<\/h2>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-3110\" src=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/Laura_Ingalls_Wilder_cropped_sepia2.jpg\" alt=\"\" width=\"269\" height=\"358\" \/><\/p>\n<p>Many writers start worrying that by the time they reach the age of 30, and if they still haven&#8217;t made it, that success will never come. They wrongly start to feel a bit ancient and grow more and more frustrated. Quite a number of writers will give up on their dream completely. Keep your chin up, for you are the originator of your own story.<\/p>\n<p>Laura Ingalls Wilder is best known for the <strong>Little House on the Prairie <\/strong>series of books that she wrote based on her childhood growing up in a pioneer family. Born in 1867, she lived to be 90 years old. However, she did not have her first book published by Harper &amp; Brothers until 1932 when she was well into her sixties. Prosperity and wealth were not even a glimmer in her eyes until then.<\/p>\n<p>If you have read her books or have seen the television show based <span style=\"line-height: 1.5\">on her family and her life as a child, you know that surviving as a pioneer family trying to homestead is extremely tough. She would go on to become a teacher in a one room school house a few months before she turned 16 years old. She felt she had to help out with her family&#8217;s finances as much as possible. She taught for three years, but never enjoyed it. Wilder did not end up completing high school. <\/span><\/p>\n<p>Wilder married when she was 18 years old, and her husband Almanzo was 28. They had a homestead claim that was doing pretty well. They had a daughter named Rose a year later. They had a son three years after that, but he died shortly after birth. Her husband was left partially paralyzed after an illness during their first few years of marriage. Eventually he regained use of his legs, but for the rest of his life he had to walk with a cane.<\/p>\n<p>Wilder became a columnist and editor for a small newspaper from 1911 until the mid-1920s. Her daughter Rose was also gaining some success as a writer herself. However, the Stock Market Crash of 1929 decimated all their savings and left the Wilders broke. But through her daughter&#8217;s connections in the publishing world, Wilder was able to get published some of her memoirs titled Little House in the Big Woods in 1932. Wilder was 65 years old and had just sold her first book. The book eventually led off a series of eight books in total about her family&#8217;s experiences on the American frontier.<\/p>\n<h2>Struggling Is Not a Bad Thing<\/h2>\n<p>Have you ever heard that the ride is the true adventure? Rarely does an &#8220;overnight sensation&#8221; happen. And even the people that get labeled as such mostly have tried to achieve their dreams for years before. Struggling writers are not uncommon. What is uncommon is the amount of persistence that writers can display. Everyone has doubts. Everyone has doors that will close on them. But don&#8217;t let that door close on your dreams. Set a goal and go for it! You will be disappointed in yourself later in life if you don&#8217;t. There is not an age limit on success. Continue to write and good things can happen!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Very few writers actually make a living at their craft. If you are a writer yourself, you know this already. People will tell you to give it up and get a real job. This is why most writers write only on the side or totally give up the craft after awhile. It can be quite &hellip;<\/p>\n","protected":false},"author":7,"featured_media":3105,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>5 Struggling Writers Who Eventually Made It - Word Counter Blog<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"5 Struggling Writers Who Eventually Made It - Word Counter Blog\" \/>\n<meta property=\"og:description\" content=\"Very few writers actually make a living at their craft. If you are a writer yourself, you know this already. People will tell you to give it up and get a real job. This is why most writers write only on the side or totally give up the craft after awhile. It can be quite &hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html\" \/>\n<meta property=\"og:site_name\" content=\"Word Counter Blog\" \/>\n<meta property=\"article:published_time\" content=\"2017-07-25T14:40:14+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2017-10-11T21:36:45+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/writer-struggle.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"804\" \/>\n\t<meta property=\"og:image:height\" content=\"612\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Ryan Crawley\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\",\"url\":\"https:\/\/wordcounter.net\/blog\/\",\"name\":\"Word Counter Blog\",\"description\":\"Because words count\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/wordcounter.net\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html#primaryimage\",\"url\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/writer-struggle.jpg\",\"contentUrl\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/writer-struggle.jpg\",\"width\":804,\"height\":612},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html#webpage\",\"url\":\"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html\",\"name\":\"5 Struggling Writers Who Eventually Made It - Word Counter Blog\",\"isPartOf\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html#primaryimage\"},\"datePublished\":\"2017-07-25T14:40:14+00:00\",\"dateModified\":\"2017-10-11T21:36:45+00:00\",\"author\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7226ef5451f51e29ee0ddbc5b4163218\"},\"breadcrumb\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/wordcounter.net\/blog\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"5 Struggling Writers Who Eventually Made It\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7226ef5451f51e29ee0ddbc5b4163218\",\"name\":\"Ryan Crawley\",\"url\":\"https:\/\/wordcounter.net\/blog\/author\/ryanc\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"5 Struggling Writers Who Eventually Made It - Word Counter Blog","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html","og_locale":"en_US","og_type":"article","og_title":"5 Struggling Writers Who Eventually Made It - Word Counter Blog","og_description":"Very few writers actually make a living at their craft. If you are a writer yourself, you know this already. People will tell you to give it up and get a real job. This is why most writers write only on the side or totally give up the craft after awhile. It can be quite &hellip;","og_url":"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html","og_site_name":"Word Counter Blog","article_published_time":"2017-07-25T14:40:14+00:00","article_modified_time":"2017-10-11T21:36:45+00:00","og_image":[{"width":804,"height":612,"url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/writer-struggle.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"Ryan Crawley","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/wordcounter.net\/blog\/#website","url":"https:\/\/wordcounter.net\/blog\/","name":"Word Counter Blog","description":"Because words count","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/wordcounter.net\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html#primaryimage","url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/writer-struggle.jpg","contentUrl":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2017\/07\/writer-struggle.jpg","width":804,"height":612},{"@type":"WebPage","@id":"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html#webpage","url":"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html","name":"5 Struggling Writers Who Eventually Made It - Word Counter Blog","isPartOf":{"@id":"https:\/\/wordcounter.net\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html#primaryimage"},"datePublished":"2017-07-25T14:40:14+00:00","dateModified":"2017-10-11T21:36:45+00:00","author":{"@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7226ef5451f51e29ee0ddbc5b4163218"},"breadcrumb":{"@id":"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/wordcounter.net\/blog\/2017\/07\/25\/103073_5-struggling-writers.html#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/wordcounter.net\/blog"},{"@type":"ListItem","position":2,"name":"5 Struggling Writers Who Eventually Made It"}]},{"@type":"Person","@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7226ef5451f51e29ee0ddbc5b4163218","name":"Ryan Crawley","url":"https:\/\/wordcounter.net\/blog\/author\/ryanc"}]}},"_links":{"self":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/3073"}],"collection":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/comments?post=3073"}],"version-history":[{"count":21,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/3073\/revisions"}],"predecessor-version":[{"id":3142,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/3073\/revisions\/3142"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/media\/3105"}],"wp:attachment":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/media?parent=3073"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/categories?post=3073"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/tags?post=3073"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}