{"id":9,"date":"2014-02-24T13:36:39","date_gmt":"2014-02-24T21:36:39","guid":{"rendered":"http:\/\/www.wordcounter.net\/blog\/?p=9"},"modified":"2017-03-01T07:43:10","modified_gmt":"2017-03-01T15:43:10","slug":"beat-writing-procrastination","status":"publish","type":"post","link":"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html","title":{"rendered":"27 Ways to Beat Writer&#8217;s Procrastination"},"content":{"rendered":"<p><center><a href=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/02\/writing-procrastination.jpg\"><img loading=\"lazy\" src=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/02\/writing-procrastination-550x412.jpg\" alt=\"stop procrastinating writers\" width=\"550\" height=\"412\" class=\"alignnone size-medium wp-image-77\" srcset=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/02\/writing-procrastination-550x412.jpg 550w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/02\/writing-procrastination-700x525.jpg 700w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/02\/writing-procrastination-624x468.jpg 624w, https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/02\/writing-procrastination.jpg 1024w\" sizes=\"(max-width: 550px) 100vw, 550px\" \/><\/a><\/center><\/p>\n<p>Procrastination can be a problem for many writers. For some, it can become a habit that&#8217;s hard to break and which has the potential to derail your writing career. It&#8217;s not that you don&#8217;t need\/want to work, but you keep coming up with a thousand other things that either have to be <a href=\"https:\/\/wordcounter.net\/blog\/2014\/01\/finding-time-to-write\/\">done right now<\/a>, or which seem like a better alternative than writing. They may also <a href=\"https:\/\/wordcounter.net\/blog\/2014\/01\/25-excuses-for-not-writing\/\">simply be excuses<\/a>. Then, before you know it, the day is over and you haven&#8217;t written a word.<\/p>\n<p>String enough of these days together and you start to find yourself locked in a vicious cycle. You know you should be writing but you&#8217;re not, that makes you depressed or angry so you don&#8217;t want to write, so you go find something else to do like watch bad reality TV and eat chips. Maybe you miss a few deadlines due to your procrastination and either lose some work or end up rushing to finish something, which makes you feel even more tired and frustrated. The cycle repeats until you give up, decide it&#8217;s not meant to be, and go to work at the Zippy Mart.<\/p>\n<p>I exaggerate, of course. (well, sort of). The good news is that (in the absence of a true mental illness) procrastination can usually be cured by honing your awareness of the problem, using your common sense, and employing good time management skills. Here are twenty-seven ideas to help you overcome your procrastination habit.<\/p>\n<h2>Don&#8217;t wait for the muse<\/h2>\n<p>Many writers say things like, &#8220;I&#8217;m not inspired just now,&#8221; or, &#8220;When the muse strikes, I&#8217;ll really put in the effort.&#8221; Newsflash: The muse is a fairy tale. Rarely does inspiration come out of nowhere. Usually it&#8217;s the result of some work on your part, like doing some freewriting, buckling down and researching your next article, or drafting something that you know is crap but which you intend to rework later. If you wait for the muse, you could be waiting forever. Just sit down and start working on something. Anything. That will get the creative juices flowing and lead to more inspiration.<\/p>\n<h2>Don&#8217;t wait for perfect conditions<\/h2>\n<p>&#8220;I&#8217;ll write when the kids are quiet.&#8221; &#8220;I&#8217;ll write when [insert crisis] is over.&#8221; &#8220;I&#8217;ll write when I&#8217;m retired.&#8221; &#8220;I&#8217;ll write once I get my office renovated.&#8221; Any of this sound familiar? If so, you could be guilty of waiting for ideal conditions in which to write. However, ideal conditions almost never happen. There&#8217;s always something going on, something going wrong, something (or someone) annoying you, and demands on your time. That&#8217;s life. If you want to make writing a priority in your life then you can&#8217;t wait for perfect conditions. You just have to deal with whatever else is going on and write, too. You do this for other things you&#8217;ve identified as priorities in your life, so why not writing?<\/p>\n<h2>Set a timer<\/h2>\n<p>Buy an egg timer, use your cell phone&#8217;s timer function, or set the timer on your stove. Set the timer for the minimum amount of time you&#8217;re willing to commit to writing right now. It may be fifteen minutes, thirty minutes, or an hour. Then put your butt in the chair and write until the timer goes off. If you&#8217;re into it by then (which you probably will be), keep going. If you really want to quit you can do so, secure in the knowledge that you did something semi-productive today.<\/p>\n<h2>Set a goal<\/h2>\n<p>If you don&#8217;t like writing with a timer, try a page or word count goal instead. If you need to focus on research, set a goal to call one source, or look up three facts. Once the goal is met, you can quit if you wish or keep going.<\/p>\n<h2>Keep an appointment<\/h2>\n<p>Some people work better when they have the formality of an appointment to keep. If that&#8217;s you, note in your calendar that you will be writing from 7 PM &#8211; 9 PM (for example) and then keep that appointment with yourself.<\/p>\n<h2>Become an &#8220;X&#8221; Man (or Woman)<\/h2>\n<p>Every day that you write and do the work you&#8217;re supposed to do, make an &#8220;X&#8221; (or smiley face, or star, etc.) on your calendar. After a while, you have a lovely string of X&#8217;s. You&#8217;re less tempted to skip a day at that point because it stinks to mess up such a pretty string of success.<\/p>\n<h2>Make it a habit<\/h2>\n<p>The point of numbers three through six, above, is to help make writing a habit. Research consistently shows that once something is a habit, you do it with little effort or angst. You simply do what you need to do and rarely do you skip it. You don&#8217;t spend an hour trying to decide whether you should shower or brush your teeth today, or decide to do something else instead of showering (I hope) because you just can&#8217;t bring yourself to turn on the water. You just do it. Make writing the same kind of habit.<\/p>\n<h2>Develop a ritual<\/h2>\n<p>Sometimes having a pre-writing ritual can help move your brain into work mode when it really wants to go take a nap. Maybe you sit down and sharpen your pencil. Maybe you freewrite for ten minutes before the &#8220;real&#8221; work begins. Maybe you get a glass of water in your favorite glass and set it on your desk before beginning work. Whatever it is, your ritual is something you do every time you get ready to write. After a while, your brain and body know that if the ritual is taking place, it&#8217;s time to get to work.<\/p>\n<h2>Keep multiple projects going at once<\/h2>\n<p>Sometimes procrastination is born out of boredom or being stuck on a project. This is why keeping multiple projects going at once can be helpful. If you become bored or stuck on your novel, for example, you can switch over and work on your short story or that article you want to pitch to your favorite magazine. If you only have one thing going, it&#8217;s a lot easier to say, &#8220;I&#8217;m stuck,&#8221; and break out the XBox.<\/p>\n<h2>Have someone check up on you<\/h2>\n<p>Accountability can do wonders for curing procrastination. Have a friend agree to call you at a certain time and ask you how much work you&#8217;ve done, or join a writer&#8217;s group that expects to see progress at each meeting. Sure, you could just lie and say, &#8220;Oh, I wrote thirty pages today,&#8221; but inside you&#8217;re going to feel like crap if you do. And if you&#8217;re honest and say, &#8220;I played video games all afternoon instead of writing,&#8221; you&#8217;re going to be ashamed. Actually working will alleviate both feelings.<\/p>\n<h2>Find a role model<\/h2>\n<p>If you have trouble getting down to work, find someone who doesn&#8217;t and make them your writing buddy. You can both go to the library or the coffee shop to work. If the other person is working diligently, chances are you won&#8217;t want to look like a slacker in comparison.<\/p>\n<h2>Go somewhere else<\/h2>\n<p>If working at home has too many ways you can procrastinate (laundry, maintenance, cleaning, etc.), go to the library. If the coffee shop is too full of friends or cool things to waste time with, stop trying to be a hipster and just go home. If you&#8217;re having trouble getting to work where you are, find a better place.<\/p>\n<h2>Plan tomorrow before you quit today<\/h2>\n<p>Write down what you need to do tomorrow, set a starting time, and note any other information to help you get started the next day. Rather than sitting at the computer wondering what to do (and then surfing Pinterest when you can&#8217;t figure it out), you&#8217;ll know what to do and can immediately get to it.<\/p>\n<h2>Practice and learn<\/h2>\n<p>Sometimes you aren&#8217;t skilled enough to tackle the project at hand and, rather than admit it, it&#8217;s easier to procrastinate. This tends to happen when you take on a project in an industry that you aren&#8217;t familiar with, or when you take on your first project of a given type. Maybe you&#8217;ve never written a training manual before but you&#8217;ve agreed to do one for your favorite client, for example. But you can learn to do almost anything. Rather than procrastinating, get to work learning about this new thing you&#8217;ve signed up for. Learn the rules and formats required, read examples of other&#8217;s work, and practice until you&#8217;ve got a feel for it.<\/p>\n<h2>Eliminate unnecessary tasks<\/h2>\n<p>Sometimes, when you have too much to do, your brain just says, &#8220;No, thanks,&#8221; and shuts down. This can lead to procrastination as you piddle around trying to figure out which thing to do first, or how you&#8217;re going to fit everything into the day. Say, &#8220;No,&#8221; to anything that isn&#8217;t essential. Delegate anything you can to someone else. Don&#8217;t take on an obligation if you know it&#8217;s going to cut into your writing time and you don&#8217;t have to do it. Schedule appointments for times other than your prime writing time. The more you can reduce the demands on your time, the more time you&#8217;ll have to write.<\/p>\n<h2>But beware of too much time<\/h2>\n<p>While it&#8217;s great to clear your calendar so you can write more, some people find that having too much time is worse than having none at all. When I first quit my job and started working from home as a full-time writer, I had a lot more time. Days stretched before me with no meetings, no set times for arrival or departure, and no commute. I could do as I chose and I often chose nothing. There&#8217;s an illusion with too much time that you can always get to it &#8220;later.&#8221; Since you&#8217;re not pressed for time, you can write anytime, right? But you often don&#8217;t. I overcame it using many of the strategies listed here, but I learned that having too much time can be as bad as being stretched to the limit.<\/p>\n<h2>Get organized and stay that way<\/h2>\n<p>It&#8217;s easy to procrastinate by filing, cleaning up the desk, or putting away reference materials. But this is just another way to avoid the work. If your desk is a mess, dedicate a day to cleaning it up, devising a workable filing system, and making sure that everything you need is easy to hand. Then keep it that way. Now you have no excuse for not writing because everything is in its place and easy to find.<\/p>\n<h2>Get over perfectionism<\/h2>\n<p>The thought that you have to be perfect can freeze you where you stand. If you can&#8217;t be perfect, you think, why bother? It&#8217;s easier to go clean the house or trawl Facebook than to write crap. Nobody&#8217;s perfect. Let it go and just do the best you can on any given day. If the day&#8217;s work is bad you can always fix it later, but get at least something down on the paper.<\/p>\n<h2>Break the project down<\/h2>\n<p>Rather than tackling a project all at once (which can seem overwhelming and lead to procrastination), break it down into smaller chunks. Focus on outlining just one chapter, for example, or writing one section of a book proposal.<\/p>\n<h2>Deal with fear<\/h2>\n<p>Sometimes fear masquerades as procrastination. It&#8217;s not that you don&#8217;t want to write, it&#8217;s that you&#8217;re afraid to write. You&#8217;re afraid of rejection, of failure, of what your friends or family will think, or even of success (it happens). If you admit your fear and deal with it, the procrastination may go away.<\/p>\n<h2>Turn off\/ignore all distractions<\/h2>\n<p>You know how it goes. You answer the phone, only to be caught talking to your mother for an hour. Instead of saying, &#8220;I&#8217;ll call you back in two hours,&#8221; you actually think, &#8220;Thank goodness. Now I don&#8217;t have to work.&#8221; You let the distraction lead you down the path of procrastination. To prevent this, turn off the phone, get some noise canceling headphones, refuse to answer the door, etc. Also, if you can, turn off your Internet while you&#8217;re working. It&#8217;s one of the biggest, easiest distractions, so if you can make it harder to get online, you&#8217;ll eliminate at least one avenue of procrastination.<\/p>\n<h2>Learn to manage your time better<\/h2>\n<p>Time management is a skill that can be learned. When you&#8217;re bad at managing time it gets away from you, or you spend too much time on the unimportant things and not enough on what you really wanted to do. Procrastination can be a form (or symptom) of poor time management skills. There are books and classes on the subject if you need to improve your skill.<\/p>\n<h2>Find the motivation<\/h2>\n<p>If a project isn&#8217;t due for months, or it&#8217;s a big project like a book, it&#8217;s hard to find motivation day in and day out. The end is nowhere in sight and your motivation to work has left the building. You have to find something that motivates you to work. Maybe it&#8217;s the thought that you could finish early and impress your client. Maybe if you finish early you&#8217;ll get paid sooner. Maybe if you finish early (and you really don&#8217;t like this project) you can move on to something else. Maybe you can take satisfaction in the work itself, even if it doesn&#8217;t seem to be getting you anywhere. Ask yourself, &#8220;Why am I doing this?&#8221; and figure out how to keep your motivation high.<\/p>\n<h2>Keep moving<\/h2>\n<p>Ever notice that if you go a few days without writing it gets easier not to write? This is because projects build momentum and when you interrupt that momentum, it&#8217;s harder to get it restarted. It&#8217;s easier to say, &#8220;What&#8217;s one more day?&#8221; If you keep writing, though, you keep your momentum going and it becomes harder to stop writing than it is to start. (The same is true of exercise, incidentally.)<\/p>\n<h2>Don&#8217;t delude yourself into thinking you&#8217;re working when you&#8217;re not<\/h2>\n<p>Yes, you may need to research the mating habits of squirrels for your project. But you probably don&#8217;t need to spend three hours doing so and you definitely don&#8217;t need to follow links from squirrels to nuts to cute pictures of squirrels on Pinterest and then to Amazon.com to search for nuts to buy. You can&#8217;t call all this wasted time &#8220;research&#8221; because it&#8217;s not. If you need to interrupt your writing, do so quickly and then get back to it. Better yet, make a note of what you need to know and keep on writing. You can do your &#8220;research&#8221; later.<\/p>\n<h2>Reward yourself<\/h2>\n<p>If you do what you&#8217;re supposed to do on a given day (and be honest here), give yourself a small reward. It doesn&#8217;t have to be expensive. Maybe one song download from iTunes, a sticker on your calendar, or a favorite snack. Rewards may not make the task any easier, but knowing that you&#8217;ll get something fun at the end can motivate you to put your butt in the chair.<\/p>\n<h2>Ask yourself if you really want to be a writer<\/h2>\n<p>If procrastination can&#8217;t be overcome, it might be time to ask yourself if you really want to write. Maybe you are really trying to fill someone else&#8217;s expectations, or to do a job that you heard was &#8220;great&#8221; but which you don&#8217;t really want to do. It&#8217;s better to admit that writing isn&#8217;t for you than to struggle every day.<\/p>\n<p>Many things can cause procrastination and discovering why you&#8217;re dragging your feet to your desk is usually the first step in overcoming the problem. If you already know why you&#8217;re procrastinating, then taking some active steps to stop it can help you get to work. Procrastination is one of those things that always seems like a good (or at least harmless) idea at the time, but which just leads to problems later on.<\/p>\n<p>(Photo courtesy of <a href=\"http:\/\/www.flickr.com\/photos\/10393601@N08\/2987926396\/\">Rennett Stowe<\/a>)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Procrastination can be a problem for many writers. For some, it can become a habit that&#8217;s hard to break and which has the potential to derail your writing career. It&#8217;s not that you don&#8217;t need\/want to work, but you keep coming up with a thousand other things that either have to be done right now, &hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[41,15,38,29,40,39,42],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>27 Ways to Beat Writer&#039;s Procrastination - Word Counter Blog<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"27 Ways to Beat Writer&#039;s Procrastination - Word Counter Blog\" \/>\n<meta property=\"og:description\" content=\"Procrastination can be a problem for many writers. For some, it can become a habit that&#8217;s hard to break and which has the potential to derail your writing career. It&#8217;s not that you don&#8217;t need\/want to work, but you keep coming up with a thousand other things that either have to be done right now, &hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html\" \/>\n<meta property=\"og:site_name\" content=\"Word Counter Blog\" \/>\n<meta property=\"article:published_time\" content=\"2014-02-24T21:36:39+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2017-03-01T15:43:10+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/02\/writing-procrastination-550x412.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\",\"url\":\"https:\/\/wordcounter.net\/blog\/\",\"name\":\"Word Counter Blog\",\"description\":\"Because words count\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/wordcounter.net\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html#primaryimage\",\"url\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/02\/writing-procrastination.jpg\",\"contentUrl\":\"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/02\/writing-procrastination.jpg\",\"width\":1024,\"height\":768,\"caption\":\"stop procrastinating writers\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html#webpage\",\"url\":\"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html\",\"name\":\"27 Ways to Beat Writer's Procrastination - Word Counter Blog\",\"isPartOf\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html#primaryimage\"},\"datePublished\":\"2014-02-24T21:36:39+00:00\",\"dateModified\":\"2017-03-01T15:43:10+00:00\",\"author\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\"},\"breadcrumb\":{\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/wordcounter.net\/blog\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"27 Ways to Beat Writer&#8217;s Procrastination\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef\",\"name\":\"admin\",\"url\":\"https:\/\/wordcounter.net\/blog\/author\/admin\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"27 Ways to Beat Writer's Procrastination - Word Counter Blog","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html","og_locale":"en_US","og_type":"article","og_title":"27 Ways to Beat Writer's Procrastination - Word Counter Blog","og_description":"Procrastination can be a problem for many writers. For some, it can become a habit that&#8217;s hard to break and which has the potential to derail your writing career. It&#8217;s not that you don&#8217;t need\/want to work, but you keep coming up with a thousand other things that either have to be done right now, &hellip;","og_url":"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html","og_site_name":"Word Counter Blog","article_published_time":"2014-02-24T21:36:39+00:00","article_modified_time":"2017-03-01T15:43:10+00:00","og_image":[{"url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/02\/writing-procrastination-550x412.jpg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/wordcounter.net\/blog\/#website","url":"https:\/\/wordcounter.net\/blog\/","name":"Word Counter Blog","description":"Because words count","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/wordcounter.net\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html#primaryimage","url":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/02\/writing-procrastination.jpg","contentUrl":"https:\/\/wordcounter.net\/blog\/wp-content\/uploads\/2014\/02\/writing-procrastination.jpg","width":1024,"height":768,"caption":"stop procrastinating writers"},{"@type":"WebPage","@id":"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html#webpage","url":"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html","name":"27 Ways to Beat Writer's Procrastination - Word Counter Blog","isPartOf":{"@id":"https:\/\/wordcounter.net\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html#primaryimage"},"datePublished":"2014-02-24T21:36:39+00:00","dateModified":"2017-03-01T15:43:10+00:00","author":{"@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef"},"breadcrumb":{"@id":"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/wordcounter.net\/blog\/2014\/02\/24\/109_beat-writing-procrastination.html#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/wordcounter.net\/blog"},{"@type":"ListItem","position":2,"name":"27 Ways to Beat Writer&#8217;s Procrastination"}]},{"@type":"Person","@id":"https:\/\/wordcounter.net\/blog\/#\/schema\/person\/7c0be7135ed003a1e5265fa457b671ef","name":"admin","url":"https:\/\/wordcounter.net\/blog\/author\/admin"}]}},"_links":{"self":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/9"}],"collection":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/comments?post=9"}],"version-history":[{"count":10,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/9\/revisions"}],"predecessor-version":[{"id":2957,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/posts\/9\/revisions\/2957"}],"wp:attachment":[{"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/media?parent=9"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/categories?post=9"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wordcounter.net\/blog\/wp-json\/wp\/v2\/tags?post=9"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}